[{"summary": "The mobile app offers a personalized feed of short videos across various categories, providing tools for users to create and customize their own content with special effects, filters, music, and more.", "actions": [["The user watches short-form videos on TikTok.", ["watch history", "liked videos", "comment history", "engagement data"]], ["The user engages with videos they like on TikTok.", ["liked videos", "engagement data", "device information"]], ["The user skips videos they don't like on TikTok.", ["videos", "user preferences"]], ["The user discovers new videos based on their preferences on TikTok.", ["video preferences", "watch history", "interaction history", "user profile"]], ["The user captures their daily moments using TikTok's easy-to-use tools.", ["videos", "captured moments", "user preferences", "location data"]], ["The user adds special effects, filters, music, and more to their videos on TikTok.", ["videos", "special effects", "filters", "music preferences"]], ["The user explores different types of videos on TikTok.", ["videos", "likes", "dislikes", "watch history"]], ["The user pauses and resumes recording multiple times in one video on TikTok.", ["videos", "recording duration", "creative style"]], ["The user is entertained and inspired by a global community of creators on TikTok.", ["content preferences", "engagement levels", "location data", "device information"]], ["The user adds their favorite music or sound to their videos for free on TikTok.", ["favorite music", "favorite sound", "videos", "music preferences"]], ["The user expresses themselves with creative effects on TikTok.", {"Personal data": ["videos", "creative effects", "preferred music genres", "creative preferences"]}], ["The user edits their own videos using TikTok's integrated editing tools.", ["videos", "editing preferences", "music choices", "video content"]]]}, {"summary": "The mobile app provides support for Chromecast, XTREAM-CODES API, automatic live stream reconnection, EPG XMLTV format, parental control, multiple themes, built-in player for various formats, dynamic language switching, and more, allowing users to customize their IPTV experience with their own content.", "actions": [["The app's built-in player supports all popular video formats including RTMP tokens.", ["video formats", "RTMP tokens"]], ["Users can report any problems or bugs to droidvision.co.uk@gmail.com or https://twitter.com/gsetechnology.", ["email address", "Twitter handle"]]]}, {"summary": "The mobile app is a simple and efficient organizer tool for creating notes, to-do lists, and reminders without any complicated setup, featuring customizable colors, autosave functionality, and a user-friendly interface with no ads.", "actions": [["The user creates notes, quick lists, checklists, or backups for any idea.", ["notes", "quick lists", "checklists", "backups", "ideas"]], ["The user uses the app to manage their schedule with proper and good notes.", ["schedule", "notes"]], ["The user accesses and organizes their to-do list and notes using the customizable and resizable widget.", ["to-do list", "notes", "organizational preferences"]]]}, {"summary": "The mobile app helps learners in the UK pass their driving theory test with a pass guarantee, offering comprehensive revision materials, mock tests, personalized learner plans, and practical driving lessons for a one-time access fee.", "actions": [["The user practices DVSA revision questions and explanations.", {"Personal data": ["DVSA revision questions", "explanations"]}], ["The user follows a personal learner plan for Theory Test revision.", ["Theory Test topics", "revision progress", "learning preferences"]], ["The app provides English voiceover for Theory Test questions and The Highway Code.", ["language preference", "learning preferences", "theory test knowledge"]], ["The user revises from the latest UK Highway Code and takes an interactive quiz.", ["UK Highway Code", "quiz answers"]], ["The user learns official UK road signs using illustrations, descriptions, and photos.", ["location (UK)", "learning preferences", "visual learning style"]], ["The user accesses over 160 virtual practical driving lesson videos.", ["driving experience level", "learning progress", "preferred driving techniques"]]]}, {"summary": "The mobile app consolidates employee benefits such as Lunch, Wellness, Sport & Culture, and Commuting into one convenient platform, allowing users to make payments with their benefits or Finnair Plus points at various merchant locations.", "actions": [["The user makes payments using their employee benefits or Finnair Plus points in thousands of merchant locations.", ["payment information", "employee benefits", "Finnair Plus points", "purchase history", "location data"]], ["The user sees which benefits their employer has enabled for them by downloading the app.", ["employment status", "benefits enabled", "employer information"]], ["The user can use Finnair Plus points for payment for Sport & Culture and Wellness services.", {"Personal data": []}], ["The user has their benefit balances and payment receipts always accessible in their pocket.", ["benefit balances", "payment receipts"]]]}, {"summary": "The mobile app is a festive Wear OS watchface that features a customizable Christmas countdown, enchanting holiday-themed backgrounds, daily statistics, and personalization options to keep you in the holiday spirit with practical functionality.", "actions": [["The user customizes the watchface by selecting from 10 background images featuring holiday characters like Santa, a snowman, or a penguin.", ["watchface customization", "background images selection", "holiday characters preferences"]], ["The user personalizes the watchface with 30 different color themes for the clock, date, stats, and countdown.", ["color preferences", "time format preferences", "date format preferences", "stats preferences", "countdown preferences"]], ["The user views the Christmas Countdown feature on the watchface, tracking the days leading up to Christmas.", ["location", "date and time preferences", "holiday interests"]], ["The user sees key statistics such as heart rate, steps taken, and battery life displayed on the watchface.", ["heart rate", "steps taken", "battery life"]], ["The user is reminded to use the companion app on their phone to discover other watchfaces by the developer.", ["phone usage data", "watchface preferences"]], ["The user taps the heart rate text to measure heart rate on request.", ["heart rate"]]]}, {"summary": "The mobile app is a modern watch face with high resolution, optimization, low battery consumption, multilingual support, weather display, changeable colors, and AOD mode, available for Wear OS devices with API Level 30+ and offering promotions and news updates on various platforms.", "actions": [["The app provides a second version of the modern watch face.", ["watch face preferences"]], ["The app provides installation instructions for the watch face.", ["watch model", "operating system", "installation preferences"]], ["The app optimizes for high performance.", ["app usage data", "device information", "location data"]], ["The app displays weather in Fahrenheit/Celsius.", ["location", "temperature unit preference"]], ["The app directs users to follow news and promotions on the web, Telegram, Facebook, and Instagram.", ["web browsing activity", "Telegram account information", "Facebook account information", "Instagram account information"]]]}, {"summary": "The mobile app is an AI-powered browser that enhances browsing experience with features like Copilot, built-in shopping tools for earning rewards, privacy protection with security tools, organization tools for managing web content, and a search engine powered by AI for comprehensive answers and productivity.", "actions": [["The user earns rewards while shopping with Microsoft Edge partner retailers.", ["shopping history", "purchased items", "reward points", "location data"]], ["The user compares prices across different retailers and gets notified of price drops.", ["product preferences", "retailer choices", "purchase history", "location"]], ["The app provides a private browser that securely syncs favorites, passwords, and other saved data across signed-in devices.", ["favorites", "passwords", "saved data", "devices"]]]}, {"summary": "The mobile app offers a digital and modern snowflake watch face with a GYRO effect, customizable colors, app shortcuts, complications, and compatibility with all Wear OS devices API 30+, allowing users to personalize their watch face and stay updated with the latest releases through their social media channels.", "actions": [["The user customizes the snowflake watch face with different colors.", ["color preferences"]], ["The user selects apps to add to the custom app shortcuts on the watch face.", {"Personal data": ["app preferences", "watch face settings"]}], ["The user chooses which complication to display on the watch face.", ["watch face complications", "display preferences"]], ["The user checks out other watch faces by the developer in the Google Play Store.", ["watch faces", "app preferences", "Google Play Store activity"]], ["The user follows the developer on social media to stay updated with the latest releases.", ["social media account", "interest in developer's projects"]]]}, {"summary": "The mobile app allows users to view native eDrawings and SolidWorks files on Android devices, facilitating easy collaboration and communication in product development with features such as multi-touch gestures, drawing sheets, exploded views, and in-app purchase options for enhanced capabilities like measuring, cross-section viewing, markups, and sharing.", "actions": [["The user views native eDrawings files and SolidWorks® parts, assemblies, and drawings files.", ["eDrawings files", "SolidWorks® parts", "assemblies", "drawings files"]], ["The user loads and sends files via email to collaborate with others involved in product development.", ["files", "email addresses", "product development information"]], ["The user upgrades to eDrawings Pro using in-app purchase to unlock additional capabilities.", ["purchase history", "payment information"]], ["The user measures designs, views cross sections of models, creates markups, and shares marked up eDrawings files with others for review.", ["designs", "models", "markups", "eDrawings files"]]]}, {"summary": "The mobile app offers fast, secure access to Edenred's programs, allowing users to check balances, view transactions, discover nearby shops and restaurants, track expenses, and connect with thousands of partners to maximize employee benefits, all in one convenient platform.", "actions": [["The user views their transaction history.", ["transaction history"]], ["The user discovers new shops and restaurants in their area.", ["location data", "search history", "preferences", "reviews"]], ["The user tracks all their expenses using the app.", ["expenses", "financial transactions"]], ["The app helps the user discover shops and restaurants near them.", ["location", "preferences", "search history"]], ["The app tracks all expenses for the user.", ["financial transactions", "purchase details", "payment methods"]], ["The app guides the user to the nearest restaurants in the network.", ["location", "restaurant preferences", "cuisine preferences", "payment method"]], ["The app provides information on opening times and contact info for partner locations.", ["location preferences", "contact information", "partner locations"]], ["The app allows the user to call partners with one click.", ["contact information", "call history", "preferred partners"]], ["The app helps the user stay connected with all their Edenred cards and transactions.", ["Edenred cards", "transaction history"]], ["The user downloads, logs in, and enjoys the MyEdenred app experience.", ["download history", "login credentials", "app usage data"]], ["The user rates and reviews the app to provide feedback for future updates.", ["user ratings", "reviews", "feedback"]]]}, {"summary": "The mobile app is a convenient tool for individuals with shift work, offering a simple and intuitive way to manage and organize their work schedule on their Android device.", "actions": [["The user manages and organizes their work schedule.", ["work schedule", "tasks", "appointments", "reminders"]], ["The user accesses their work schedule on their Android mobile phone or tablet.", ["work schedule", "device type"]], ["The app helps the user manage their shift work schedule.", ["work schedule", "shift preferences", "work hours", "break times"]], ["The user uses the app to organize their work shifts in a simple and intuitive way.", ["work shifts", "work schedule", "task assignments"]]]}, {"summary": "The mobile app provides real-time P2000 notifications for emergency services such as police, fire, and ambulance, allowing users to stay informed about incidents in their area, with additional features in the Pro version including ad-free experience and capcode support.", "actions": [["The user installs the app on their mobile phone.", ["device type", "operating system", "location", "IP address"]], ["The user shares emergency notifications with their friends.", ["emergency notifications", "friends list"]], ["The user customizes settings to receive notifications based on specific cap-codes.", ["notification settings", "cap-codes preferences"]], ["The user accesses emergency alerts in their vicinity and specified locations.", ["location data", "specified locations", "emergency alert preferences"]]]}, {"summary": "The mobile app is a pocket-sized sampler that allows users to record sounds, create beats, add effects, and easily generate tracks with intuitive interface and a variety of features, including resampling, exporting tracks as WAV files, AI sample separation, MIDI control, built-in microphone and DJ effects, and additional features available through in-app purchase.", "actions": [["The user records samples with their phone's mic or loads their own sounds.", ["audio samples", "sound recordings", "device information"]], ["The user creates beats with the samples, adds effects, and creates a track.", ["music samples", "effects preferences", "created tracks"]], ["The user exports loops or entire tracks as professional quality WAV files.", ["music loops", "tracks", "export preferences"]], ["The user uses AI to separate samples into individual instruments.", ["audio samples", "music preferences"]], ["The user plays chromatically or in one of 9 scales in keyboard mode.", ["musical preferences", "keyboard mode choice"]], ["The user adds effects to the entire mix.", ["audio mix", "effect preferences"]], ["The user plays their samples on a keyboard using MIDI control.", ["music samples", "keyboard usage data", "MIDI control settings"]], ["The user turns off 'OpenSL' in Koala's audio settings if facing microphone input issues.", ["audio settings", "microphone input issues"]], ["The user purchases SAMURAI In-App features like Pro-quality Timestretch, Piano roll editor, Auto-chop, and Pocket operator sync out.", ["purchase history", "payment information", "device information"]]]}, {"summary": "The mobile app is a feature-rich GPX viewer and offline maps tool that also serves as a GPS locator, tracks viewer, trip stats analyzer, and navigation tool with customizable options and additional features such as track recording and weather forecast.", "actions": [["The user views tracks, routes, and waypoints from gpx, kml, kmz, and loc files.", ["location data", "travel history"]], ["The user opens multiple files using the file browser and accesses favorite files and history.", ["file names", "file paths", "file types", "favorite files", "browsing history"]], ["The user analyzes information and statistics for tracks and routes.", ["location data", "activity preferences", "fitness data"]], ["The user views graphs like elevation profile and speed profile for tracks and routes.", {"Personal data": ["location data", "activity tracking data", "device information"]}], ["The user views graphs of other track data like cadence, heart rate, power, and air temperature.", ["cadence data", "heart rate data", "power data", "air temperature data"]], ["The user analyzes information for waypoints and adjusts their icons.", ["waypoints", "icons"]], ["The user changes track and route color and colorizes track and route line by elevation, speed, cadence, heart rate, or air temperature.", ["track color", "route color", "elevation", "speed", "cadence", "heart rate", "air temperature"]], ["The user views online maps such as Google Maps, Mapbox, HERE, Thunderforest, and others.", {"Personal data": ["location", "search history", "IP address"]}], ["The user adds custom online TMS or WMS maps.", ["location data", "map preferences", "custom markers"]], ["The user shows current GPS position on a map and follows GPS position continuously by adjusting map position.", ["GPS position", "map position"]], ["The user rotates the map according to device orientation sensor or movement direction data from GPS.", ["location data", "device orientation data"]], ["The user receives notifications when GPS position is near waypoint with adjustable distance.", ["GPS position", "waypoint location", "notification preferences"]], ["The user synchronizes tracks and waypoints created on Trackbook.", ["location data", "route information", "timestamp", "tracking history"]], ["The user creates new tracks or edits existing tracks and routes, splits track or route into two, and merges two tracks or routes into one.", ["location data", "exercise preferences", "route preferences", "activity history"]], ["The user adds waypoints on the map and sets their name and icon.", ["location data", "display name", "icon choice"]], ["The user records and exports trips into gpx or kml files, records elevation and speed statistics, and receives distance or time voice notifications.", ["location data", "elevation statistics", "speed statistics", "trip details", "voice notifications preferences"]], ["The user views weather forecast for the next 7 days and hourly forecasts.", ["location", "time preferences"]]]}, {"summary": "The mobile app makes it easy to switch from an Android device to an iPhone or iPad by securely transferring various types of content data such as contacts, messages, photos, and more.", "actions": [["The app securely transfers Contacts, Message history, Camera photos and videos, Mail accounts, Calendars, and WhatsApp content from the Android device to the new iPhone or iPad.", ["Contacts", "Message history", "Camera photos and videos", "Mail accounts", "Calendars", "WhatsApp content"]], ["Once the content transfer is complete, the user can start using their new iPhone or iPad to explore its features and possibilities.", ["content transferred", "device type", "features explored", "preferences"]]]}, {"summary": "The mobile app provides a platform for creating invite-only spaces with topic-based channels for text, voice, and video chat, allowing users to stay connected with friends and communities through various interactive features like screen sharing, custom emojis, and low-latency chat capabilities.", "actions": [["The user creates an invite-only place for their community or friends.", {"Personal data": ["community members", "friends", "location", "interests"]}], ["The user sends messages directly to friends or calls them using voice chat.", {"Personal data": ["messages", "voice chat logs", "friend list"]}], ["The user joins voice channels to hang out with friends and watch videos together.", ["voice channels", "friends", "videos"]], ["The user engages in low-latency voice and video chat to stay close with friends.", ["voice data", "video data", "chat messages", "contact list"]], ["The user talks with friends while gaming and shares images easily.", ["conversations", "images shared", "gaming activity", "friends list"]], ["The user waves hello over video, watches friends stream games, and shares stories over voice calls.", ["video interactions", "game streams", "voice call conversations"]], ["The user snaps a photo and creates custom emojis to share with friends.", ["photos", "custom emojis", "friends list"]], ["The user shares funny videos, stories, and group photos with friends.", ["funny videos", "stories", "group photos"]], ["The user hangs out in group channels or talks privately with direct messages.", ["group channels", "direct messages", "contacts list"]], ["The user moderates and organizes meetings for their community or friends.", ["meeting schedules", "attendees list", "agenda topics", "meeting notes"]]]}, {"summary": "The mobile app is a license key for BubbleUPnP, enabling ad removal and unlocking full functionality for streaming music, videos, and photos to a variety of devices in your home, with access to media from various sources and extensive features like Chromecast support and playback queue management.", "actions": [["The user installs and evaluates the free BubbleUPnP app.", ["app installation data", "evaluation feedback"]], ["The user installs the license app for BubbleUPnP to remove ads and limitations.", ["app usage data", "purchase history", "device information"]], ["The user contacts technical support at bubblesoftproducts@gmail.com for help.", ["email address"]], ["The user streams music, videos, and photos to various devices in their house.", ["music preferences", "video preferences", "photos", "devices in house"]], ["The app offers playback queue, editable playlists, scrobbling, sleep timer, and various shuffle modes.", {"Personal data": []}]]}, {"summary": "The mobile app helps users enjoy shopping at Tuš stores by providing store information, discounts, a virtual membership card, exclusive offers, and easy management of the Tuš Club loyalty program.", "actions": [["The user uses the Tuš mobile application to locate the nearest Tuš store and view store discounts.", ["location data", "search history", "store preferences", "discount preferences"]], ["The user utilizes the virtual card feature on the app for membership identification and to access Tuš Club benefits.", ["membership ID", "Tuš Club benefits", "virtual card usage"]], ["The user explores the Tuš discount store section on the app to view current offerings and prices.", ["location", "shopping interests", "purchase history"]], ["The user checks their coupon status and details on cashing in coupons through the app.", ["coupon status", "coupon details"]], ["The user manages their Tuš Club account, makes user information changes, and checks benefit status.", ["account information", "user details", "benefit status"]], ["The user joins the Tuš customer loyalty club via the Tuš mobile application to access member benefits.", ["name", "email address", "phone number", "date of birth", "location", "shopping preferences"]]]}, {"summary": "The mobile app helps Intratuin Extra members receive special benefits and offers assistance in caring for their indoor and outdoor plants, providing plant care tips, reminders, and access to exclusive discounts and inspiration content.", "actions": [["The user signs up for Intratuin Extra to receive benefits and assistance with plant care.", ["name", "email address", "phone number", "home address", "plant care interests"]], ["The user accesses information about Intratuin Extra and keeps their membercard handy in the app.", ["Intratuin Extra membership information", "membercard details"]], ["The user seeks guidance on plant care through the app to ensure plants receive necessary attention.", ["plant types", "care instructions", "location of plants", "frequency of care"]], ["The app notifies the user when action is required, such as watering plants and providing plant food.", ["plant types", "plant care schedule", "location of plants"]], ["The user discovers inspiration through blogs and lookbooks in the Intratuin app about trends in garden furniture, BBQs, and home decor.", ["blogs", "lookbooks", "trends in garden furniture", "trends in BBQs", "trends in home decor"]], ["The app provides benefits to Intratuin Extra members, such as welcome gifts, monthly vouchers, birthday gifts, and discounts on products.", ["membership status", "birthday", "purchase history", "product preferences"]], ["The app offers assistance with plant care by providing information on over 600 plants, allowing users to manage their plant collections, customize plant notifications, and access plant-related tips and advice.", ["plant collections", "plant notifications", "plant-related tips and advice"]]]}, {"summary": "The mobile app allows users to scan barcodes, pay with registered credit cards for entry into competitions, browse digital leaflets, access transaction history, discover recipes, view branded products, and find nearby MAS Supermarkets on an interactive map.", "actions": [["The user scans their barcode at the till to collect entries for the MAS competition.", ["barcode data", "competition entries"]], ["The user pays with their credit card registered in the app to collect entries for the MAS competition.", ["credit card details", "entries for MAS competition"]], ["The user has the opportunity to win gifts by participating in the MAS competition.", ["participation in MAS competition", "preferences for gifts"]], ["The user browses through a digital version of the monthly leaflet in the app.", ["reading habits", "interests in monthly events", "app usage"]], ["The user views their transaction history in the app.", ["transaction history"]], ["The user finds unique recipes in the app.", ["food preferences", "dietary restrictions", "cooking skills"]], ["The user views branded products in the app.", ["shopping preferences", "brand preferences", "product interests"]], ["The user interacts with the interactive map to locate the nearest MAS Supermarket.", ["location data", "current location", "search query"]], ["The user gets information about the nearest MAS Supermarket on the interactive map.", ["location data", "search history", "current location"]]]}, {"summary": "The mobile app is a versatile multi-protocol stream receiver that allows you to stream screen, photos, music, and videos from your devices to your TV, with features like support for YouTube videos, audio sync, AirMirror, and compatibility with various devices.", "actions": [["The user streams screen, photos, music, and videos from their phones and laptops to their TV using AirReceiver.", ["photos", "music", "videos", "screen content"]], ["The app works in the background to stream media to the user's Android device.", {"Personal data": ["media preferences", "Android device information"]}], ["The app supports Youtube videos for streaming.", {"Personal data": []}], ["The app supports a slideshow feature.", ["photos", "slides", "transitions", "captions"]], ["The app streams audio, video, and photos from AirPlay clients like iTunes and iOS.", ["audio files", "video files", "photos", "AirPlay clients", "device information"]], ["The app streams audio, video, and photos from DLNA clients like WMP12 and AirShare.", ["audio", "video", "photos"]], ["The app has a configurable network name.", {"Personal data": []}], ["The user downloads and installs the Free Tools AirSender on their PC for Windows Screen Mirror.", ["device type", "operating system", "location"]], ["The user clicks the icon of 'AirSender' at the Windows status bar and selects the device running AirReceiver for screen mirroring.", ["device information", "network information"]]]}, {"summary": "The mobile app offers a personalized feed of short-form videos across various categories, provides tools for creating original content with special effects and music, and connects users to a global community of creators for entertainment and inspiration.", "actions": [["The user watches short-form videos on TikTok.", ["watched videos", "liked videos", "interaction history"]], ["The user engages with videos they like on TikTok.", ["liked videos", "engagement activity", "user preferences"]], ["The user skips videos they don't like on TikTok.", ["videos", "user preferences"]], ["The user creates their own original videos on TikTok.", ["videos", "content preferences", "music interests", "audience demographics"]], ["The user uses easy-to-use tools to view and capture daily moments on TikTok.", ["videos", "captured moments", "viewing history", "device information"]], ["The user takes their videos to the next level with special effects, filters, music, and more on TikTok.", ["videos", "special effects", "filters", "music preferences"]], ["The user explores various types of videos on TikTok.", ["videos", "video categories", "watch history", "engagement data"]], ["The user pauses recording multiple times in one video on TikTok.", {"personal_data": ["videos", "recording duration", "pausing frequency", "user activity pattern"]}], ["The user is entertained and inspired by a global community of creators on TikTok.", ["videos", "creators", "content preferences", "engagement data"]], ["The user adds their favorite music or sound to their videos for free on TikTok.", ["favorite music", "sound preferences", "video content"]], ["The user expresses themselves with creative effects on TikTok.", ["videos", "creative effects", "preferred music genres", "engagement with TikTok trends"]], ["The user edits their own videos using integrated editing tools on TikTok.", ["videos", "editing preferences", "music choices", "video content"]]]}, {"summary": "The mobile app NFC Tools - Pro Edition unlocks all features of NFC Tools, allowing users to read, write, and program tasks on NFC tags and compatible chips with additional features such as profile management, task execution without tags, and conditional actions.", "actions": [["The user unlocks all possibilities of the app NFC Tools by purchasing the Pro Edition.", {"Personal data": []}], ["The user reads, writes, and programs tasks on NFC tags and other compatible NFC chips.", ["personal tasks", "NFC tags", "programming tasks"]], ["The user unleashes the power of their imagination to create fun and useful routines.", ["imagination", "fun routines", "useful routines"]], ["The user saves profiles (records and tasks) using the profile management system.", ["profiles", "records", "tasks"]], ["The user imports existing NFC tags to edit records or tasks quickly.", ["NFC tags", "records", "tasks"]], ["The user executes tasks without NFC tags by using a shortcut on their home screen.", ["location data", "app usage data", "device model"]], ["The user creates complex actions with conditions using conditional blocks.", ["user-created actions", "conditions", "conditional blocks"]], ["The user contacts support if they encounter any problems.", ["contact details", "device information", "description of the problem"]]]}, {"summary": "The mobile app offers OpenAI's latest advancements for instant answers, tailored advice, creative inspiration, professional input, and learning opportunities, with a free sync feature across devices.", "actions": [["The app offers tailored advice to the user.", ["preferences", "interests", "location data", "search history"]], ["The app provides creative inspiration to the user.", ["interests", "hobbies", "artistic preferences"]]]}, {"summary": "The mobile app allows guitarists to easily view, play, and write tablature for various instruments, with features such as a powerful score player, NotePad tool, and the ability to export ideas into desktop versions of the program.", "actions": [["The user views tablature, plays, and writes music using the Guitar Pro app.", ["musical preferences", "guitar playing skills", "music compositions"]], ["The user practices their favorite songs using the mobile version of Guitar Pro.", ["favorite songs", "music interests"]], ["The user notes and saves arpeggios, riffs, and chord sequences on the single-track tablature NotePad.", ["music notes", "arpeggios", "riffs", "chord sequences"]], ["The app supports multiple file formats including GP3/4/5/6/7/8 (.gp) for the user.", ["file formats", "preferences"]], ["The user loads files via WiFi, web browser, and email using the Guitar Pro app.", ["files", "WiFi usage data", "web browser data", "email data"]], ["The user creates and edits a single-track tablature using the NotePad tool for various instruments.", ["music preferences", "instrument choices", "editing history"]], ["The user exports their ideas into Guitar Pro 6 and 7 formats for further composition on the desktop version.", ["ideas", "Guitar Pro 6 format", "Guitar Pro 7 format"]]]}, {"summary": "The mobile app provides real-time car performance and diagnostics data through an OBD II Bluetooth adapter, allowing users to track engine information, sensor data, fault codes, and customize their dashboard with various widgets and gauges.", "actions": [["The user sees real-time data about their car's performance and sensor data.", ["car performance data", "sensor data"]], ["The app uses GPS to provide tracker logs with OBD engine logging for the user to review their activities.", ["location data", "vehicle information", "activity logs"]], ["The app features a Dyno/Dynomometer for horsepower and torque readings.", ["vehicle make and model", "engine specifications", "horsepower readings", "torque readings"]], ["The user can read Transmission Temperatures for their specific vehicle.", {"Personal data": ["vehicle make", "vehicle model", "vehicle year", "transmission temperatures"]}], ["The user can customize their dashboard and profiles according to their preferences.", ["dashboard preferences", "profile customization", "user preferences"]], ["The app allows users to video record their journey with onscreen OBDII data overlay for analysis.", ["video recordings", "location data", "vehicle information", "driving behavior"]], ["The user can send GPS tagged tweets directly to Twitter, especially during road trips.", ["location data", "tweets", "road trip activities"]], ["Users can enable Heads-up display (HUD) mode for night time driving.", ["location data", "time of day preferences", "driving habits"]], ["The app features a GPS Speedometer for tracking and real-time web upload capabilities.", ["location data", "speed data", "route data", "real-time web upload history"]], ["The app supports sharing screenshots to social media platforms like Facebook, Twitter, and Google+.", ["screenshots", "social media platforms"]], ["Users need a Bluetooth OBD2 adapter for the app to work, which plugs into the car's diagnostics socket.", {"Personal data": ["car make", "car model", "car year"]}], ["The app offers continuous updates with new features added in each release.", ["app usage data", "device information", "preferences"]]]}, {"summary": "The mobile app offers a wide range of lifelike sound effects and features like fake call chat messenger, voice changer, and soothing sleep sounds to enhance your prank game and create hilarious moments with friends.", "actions": [["The user selects lifelike sound effects for pranks from a wide range of options.", ["sound effect preferences", "prank preferences"]], ["The user creates moments of amusement and hilarity by playing funny meme sounds.", ["meme sounds", "humor preferences"]], ["The user trolls friends with unexpected and realistic scare sounds like gun and bomb simulators.", ["friends list", "location data", "audio recordings"]], ["The user customizes caller ID, avatar, and voice for a fake call chat messenger or audio call.", ["caller ID", "avatar", "voice"]], ["The user engages in a prank audio call conversation with friends as famous celebrities.", ["audio recordings", "friends' contact information", "celebrity impersonations"]], ["The user enjoys relaxation by choosing soothing melodies and tranquil sounds for sleep.", ["music preferences", "sleep patterns"]], ["The user transforms their voice into different voices using the voice changer feature.", ["voice recordings", "voice modifications", "preferred voices"]], ["The user engages in conversations with different voices, such as favorite celebrities or cartoon characters.", ["conversations", "favorite celebrities", "cartoon characters"]]]}, {"summary": "The mobile app offers a BOGO promotion for purchasing watch faces, where users can buy one watch face and email the receipt to receive a coupon for a Snowman-themed watch face with various features for Wear OS.", "actions": [["The user buys a watch face.", ["purchase history", "payment information", "shipping address"]], ["The user sends an email to mjwatchfaces@gmail.com.", ["email address"]], ["The user attaches the receipt from Google to the email.", ["receipt", "email address"]], ["The app displays Watch Face FLW106 with Snowman for Wear OS.", ["device type", "operating system", "Watch Face FLW106", "Wear OS"]], ["The app features Diamond Analog Second, Minute, and Hour Watch Hand.", ["time preferences", "watch design preferences"]], ["The app shows Heart Rate Number.", {"Personal data": ["heart rate data"]}], ["The app displays Step Count.", ["step count"]], ["The user changes the image by pressing and holding, then pressing Customize on the app.", ["images", "editing preferences"]]]}, {"summary": "The mobile app is a highly customizable offline monthly calendar for Android, designed to help users easily plan and organize their schedules in 2023 with features like appointment scheduling, event reminders, and flexible event creation.", "actions": [["The user customizes event reminders, notification appearance, and overall appearance.", ["event reminders", "notification appearance", "overall appearance"]], ["The user checks their upcoming agenda, schedules business meetings, events, and books appointments easily.", ["agenda", "business meetings", "events", "appointments"]], ["The user exports settings to .txt files to import to another device.", ["settings"]], ["The user shares events fast on social media, emails, etc.", ["events", "location", "contacts", "social media accounts"]], ["The user imports holidays, contact birthdays, and anniversaries easily.", ["holidays", "contact birthdays", "anniversaries"]]]}, {"summary": "The mobile app offers a wide selection of cosmetics and perfumes from over 1,500 global brands, with tailored offers, authentic reviews, and smart tools to assist in product selection, along with exclusive app-only discounts, wishlist feature, customer reviews, Virtual Try On option, fast and secure shopping experience, and access to a professional blog and live streams for continual inspiration.", "actions": [["The user accesses app-only offers for special discounts and deals.", ["purchase history", "location data", "browsing history"]], ["The user utilizes the Wishlist feature to organize beauty favorites and search for better deals.", ["beauty products", "shopping preferences", "favorite brands", "budget constraints"]], ["The user reads verified reviews from customers to make informed decisions on beauty products.", {"Personal data": ["beauty product preferences", "customer reviews", "purchase decisions"]}], ["The user tries on different shades of lipstick, foundation, or eyeshadow using the Virtual Try On feature.", ["photos", "facial features", "makeup preferences"]], ["The user engages in fast, simple, and secure shopping by searching for products, making a selection, and completing the purchase.", ["search history", "selected products", "purchase history"]], ["The user explores professional blog content and live streams for inspiration within the app.", ["professional blog content", "live streams", "interests", "industry preferences"]]]}, {"summary": "The mobile app offers a comprehensive suite of graphic design tools including a photo editor, video editor, logo maker, and customizable templates for creating social media posts, flyers, and more.", "actions": [["The user designs social media posts, videos, flyers, photo collages, and video collages from customizable templates.", ["photos", "videos", "text content", "design preferences"]], ["The user boosts their graphic design skills or builds their brand with the logo maker.", ["graphic design skills", "branding goals"]], ["The user uses the photo editor to crop, flip, and edit images.", ["images", "editing history", "device information"]], ["The user adjusts brightness, contrast, saturation, etc. in the photo editor.", ["photos", "editing preferences"]], ["The user adds text to their photo in the photo editor.", ["photos", "text added", "photo editor usage"]], ["The user creates professional videos in the video editor.", ["videos", "editing preferences", "work industry", "video content"]], ["The user overlays multiple audio tracks of music, sound effects, and voiceovers in the video editor.", ["audio tracks", "music preferences", "sound effects", "voice recordings"]], ["The user makes images move with one-tap animations and page transitions in the video editor.", ["images", "animations", "video editing preferences"]], ["The user designs for Instagram, Snapchat, Facebook, or LinkedIn using the app.", ["social media platforms used", "design preferences"]], ["The user plans posts with Scheduler in Canva Pro.", ["posts", "schedule", "content", "images"]], ["The user uses the banner maker for thumbnails and ads.", ["thumbnails", "ads", "design preferences"]], ["The user accesses premium templates, images, videos, logo maker, audio, and graphic design elements in Canva Pro.", ["subscription status", "usage data", "payment information"]], ["The user creates consistent logos with the logo maker, fonts, and colors in Brand Hub.", ["logos", "fonts", "colors"]], ["The user schedules posts for Instagram and Facebook.", ["scheduled posts", "content", "publishing times", "target audience demographics"]], ["The user engages with presentations and worksheets as a student or teacher.", ["student/teacher status", "presentation materials", "worksheets", "learning progress"]], ["The user uses the photo editor, logo maker, collage maker, and video editor for brand visuals and mood boards.", ["photos", "logos", "collages", "videos", "brand visuals", "mood boards"]], ["The user creates graphic designs for Instagram templates, resumes, photo collages, logo maker, and video editor as a personal user.", ["graphic designs", "Instagram templates", "resumes", "photo collages", "logo maker", "videos"]], ["The user grows their business with the logo maker, video editor, poster maker, and Magic Presentations as an entrepreneur.", ["business information", "logo designs", "videos", "posters", "presentation content"]], ["The user removes unwanted objects from any image using Magic Eraser.", ["images", "objects in images", "editing preferences"]], ["The user creates images with the magic Text to Image tool.", ["text input", "image preferences", "design style"]]]}, {"summary": "The mobile app unlocks all the possibilities of NFC Tools, allowing users to read, write, and program tasks on NFC tags and other compatible chips with additional features such as profile management, import from existing tags, and conditional blocks for complex actions.", "actions": [["The user creates fun and useful routines using NFC Tools.", ["routines", "NFC tool usage", "device information"]], ["The user saves profiles (records and tasks) using the profile management system.", ["profiles", "records", "tasks"]], ["The user imports existing NFC tags to edit records or tasks quickly.", {"Personal data": ["NFC tags", "records", "tasks"]}], ["The user creates complex actions with conditions using conditional blocks.", ["user actions", "condition settings"]], ["The user needs the free app NFC Tasks to execute tasks.", ["device type", "operating system", "app preferences"]]]}, {"summary": "The mobile app allows users to collect points for purchases, move through different tiers for benefits, access discounts and coupons, participate in games, and locate service stations for Fresh Corner items.", "actions": [["The user confirms their e-mail address.", ["email address"]], ["The user starts collecting points with the digital Slovnaft Move card.", ["location data", "purchase history", "points collected", "preferences"]], ["The user enjoys a Fresh Corner welcome gift.", ["name", "email address", "physical address", "birthday"]], ["The user earns points for purchases made with the digital Slovnaft Move card.", ["purchase history", "transaction details"]], ["The user moves through different tiers based on earned points.", ["points", "tiers"]], ["The user completes questionnaires to earn extra points.", {"personal data": ["questionnaire responses", "points earned"]}], ["The user recommends the Slovnaft Move app to friends to earn extra points.", ["app recommendation", "friend list", "points system"]], ["The user accesses discounts, coupons, and challenges in the app.", ["shopping preferences", "favorite brands", "location", "purchase history"]], ["The user participates in prize-winning games through the app.", ["game history", "prizes won", "participation frequency", "preferences"]], ["The user finds service stations offering Fresh Corner coffee and hot-dogs using the app.", ["location", "coffee preferences", "food preferences"]], ["The user plans routes directly to service stations through the app.", ["location data", "vehicle type", "fuel preferences", "distance to service stations"]], ["The user reads the General Terms & Conditions on www.slovnaftmove.sk.", ["IP address", "location data", "device information"]]]}, {"summary": "The mobile app offers a vast selection of entertainment from Disney, Pixar, Marvel, Star Wars, and National Geographic, including new Originals, classic movies, and TV shows, with features like 4K UHD streaming, parental controls, and IMAX Enhanced viewing.", "actions": [["The user streams the latest movie releases, exclusive Original series, and a catalog of classics.", ["movie preferences", "TV series preferences", "watch history", "genre preferences"]], ["The user watches Originals like Star Wars: Andor and fan favorites like Encanto and The Simpsons.", ["watch history", "favorite shows", "movie genres"]], ["The user experiences exclusive new Originals from Disney, Pixar, Marvel, Star Wars, and National Geographic.", ["viewing history", "preferences", "interests"]], ["The user accesses new releases, timeless classics, and past seasons of favorite TV shows.", ["watched TV shows", "favorite TV shows", "viewing history"]], ["The user watches over 100 titles in 4K UHD and HDR.", ["watched titles", "video quality preferences"]], ["The user watches content in IMAX Enhanced format with certain Marvel and Pixar titles.", ["movies", "IMAX Enhanced format", "Marvel titles", "Pixar titles"]], ["The user changes an individual profile’s content rating under Profile settings.", ["profile content rating"]], ["The user opts out of selling their information by visiting https://www.disneyplus.com/legal/privacy-policy.", ["opt-out preference", "personal information"]]]}, {"summary": "The mobile app allows users to buy and sell pre-loved items, including clothing, homeware, accessories, toys, and books, with 0% selling fees, easy shipping, secure payment, and buyer protection, while also offering a platform for discovering unique finds and connecting with a global community of over 75 million members who share a passion for second-hand fashion.", "actions": [["The user joins Vinted, a community marketplace for buying and selling pre-loved pieces.", ["name", "email address", "location", "payment information", "items for sale", "items purchased"]], ["The user browses quality items from various categories on Vinted.", ["shopping preferences", "size preferences", "favorite categories", "browsing history"]], ["The user takes photos of items, describes them, and sets prices for selling on Vinted.", ["photos", "item descriptions", "prices", "selling platform"]], ["The user receives notifications about favorites or purchases on Vinted.", ["favorites", "purchases"]], ["The user downloads pre-paid shipping labels and tracks packages within the Vinted app.", ["shipping labels", "package tracking information"]], ["The user sends funds straight to their bank after selling on Vinted.", ["bank details", "selling transactions"]], ["The user discovers unique and quality items on the Vinted marketplace.", ["shopping preferences", "size", "color preferences", "brand preferences"]], ["The user follows and chats with members who inspire them on Vinted.", ["followed members", "chat messages", "purchase history"]], ["The user customizes their feed to find items and clothing they love on Vinted.", ["clothing preferences", "items preferences", "shopping behavior"]], ["The user enjoys Buyer Protection and secure payment methods while shopping on Vinted.", ["shopping history", "payment information", "contact details"]], ["The user chats with buyers or sellers directly and explores closets on Vinted.", ["messages", "closet items", "purchase history", "selling history", "location"]], ["The user downloads the second-hand fashion app to join the conversation on Vinted.", ["fashion preferences", "shopping habits", "communication preferences", "location"]]]}, {"summary": "The mobile app offers a fast and convenient way to transfer photos, videos, contacts, and data between devices with features like Smart Switch, Phone Clone, and Contact Transfer for easy and secure data migration.", "actions": [["The user transfers photos, videos, contacts, and data with one tap.", ["photos", "videos", "contacts", "data"]], ["The user migrates data from one phone to another.", ["contact information", "photos", "videos", "messages", "app data"]], ["The user struggles to transfer content and seeks help from the content transfer app.", ["content to transfer", "technical issues encountered", "device information"]], ["The user downloads the smart switch app for sending data anywhere and anytime.", ["download history", "location data", "device information"]], ["The user makes a phone clone to transfer data from one device to another.", ["device data", "contacts", "photos", "messages", "apps"]], ["The user transfers contacts from the old phone to a new phone.", ["contact information", "phone numbers", "email addresses"]], ["The user conveniently transfers photos of any size.", ["photos"]], ["The user uses the smart switch to send data anywhere.", ["location data", "device information", "IP address"]], ["The user sends and receives any file conveniently using the smart transfer app.", ["files", "device information", "email addresses", "transfer history"]], ["The user shares data of any size using the smart transfer app.", ["shared data", "file sizes", "transfer destinations"]], ["The user downloads the clone app to make data transfer ultra-fast.", ["downloaded app", "data transfer speed preference"]], ["The user uses the clone app to clone their phone with another for data transfer.", ["phone data", "device information", "contact list", "messages", "photos"]], ["The user sends data from one device to another using the smart switch transfer data.", ["device data", "transfer data", "device settings"]], ["The user selects the files to transfer, makes a phone clone, and sends data with one tap using the smart switch mobile.", ["files", "phone data", "smart switch mobile usage data"]], ["The user uses the phone transfer app to transfer contacts from an old phone to a new one.", ["contact information", "phone numbers", "email addresses", "names"]], ["The user uses quick share to transfer photos quickly.", ["photos", "device information"]], ["The user transfers photos of any type and size with ease using quick share.", ["photos", "file sizes", "quick share preferences"]]]}, {"summary": "The mobile app allows users to connect with communities, teammates, family, and friends through features like communities, events, chats, channels, meetings, storage, tasks, and calendars all in one place, enabling collaboration, sharing of ideas, making plans, and managing access to information securely.", "actions": [["The user connects with their community, family, friends, or work mates to accomplish tasks, share ideas, and make plans.", ["community connections", "family connections", "friend connections", "work connections", "task details", "idea sharing", "plans"]], ["The user joins audio and video calls in a secure setting, collaborates in documents, and stores files and photos with built-in cloud storage.", ["audio calls", "video calls", "document collaboration", "files", "photos", "cloud storage"]], ["The user meets securely with communities, teammates, family, or friends, and sets up meetings within seconds to collaborate.", ["meeting schedules", "participants", "collaboration topics", "locations"]], ["The user chats 1-1 or to their entire community, @mentions people in chats to get their attention, and creates dedicated communities to discuss specific topics and make plans.", ["chat messages", "community interactions", "@mentions", "community topics", "plans"]], ["The user works closely and collaborates by keeping conversations organized by specific topics and projects with teams and channels.", ["conversations", "topics", "projects", "teams", "channels"]], ["The user sends photos and videos in chats to quickly and easily share important moments and uses cloud storage to access shared documents and files on the go.", ["photos", "videos", "chats", "cloud storage", "shared documents", "shared files"]], ["The user organizes shared content in a community — events, photos, links, files — so they don't have to waste time searching.", ["events", "photos", "links", "files"]], ["The user gets the most out of meetings by using screenshare, whiteboard, or breakout in virtual rooms, manages access to information, and ensures the right people have access to the right info.", ["meeting content", "screen sharing activities", "whiteboard activities", "virtual room usage", "access management"]], ["The user uses task lists to stay on top of projects and plans - assigns tasks, sets due dates, and crosses off items to keep everyone on the same page.", ["task lists", "assigned tasks", "due dates", "project details"]]]}, {"summary": "The mobile app helps users track and improve their blood pressure by recording daily logs, identifying ranges, understanding influencing factors, and offering advice on maintaining healthy levels with practical knowledge, fast data processing, and easy-to-use features for all ages.", "actions": [["The user tracks their blood pressure using the app.", ["blood pressure data"]], ["The user records a daily blood pressure log.", ["blood pressure readings", "date and time of recordings"]], ["The user identifies blood pressure ranges with the app.", ["blood pressure readings", "health data", "age", "gender"]], ["The user receives advice on maintaining healthy blood pressure levels.", {"Personal data": []}], ["The app processes data at a fast speed.", ["processing speed"]], ["The user fills in pulse and blood pressure information with just 1 touch.", ["pulse information", "blood pressure information"]], ["The user writes a BP diary every day to view blood pressure numbers.", ["blood pressure numbers", "health data", "daily activities"]], ["The user tracks the status of the app and records what they have learned.", ["learning progress", "app usage data"]], ["The user uses the app to identify their health status and address issues before they become serious.", ["health status", "medical history", "symptoms", "treatment plans"]]]}, {"summary": "The mobile app offers endless inspiration with billions of Pins to explore, allowing users to save, organize, and share ideas, shop for products, watch DIY tutorials, find home decor inspiration, discover tattoo ideas, connect with a worldwide creative community, and use Pinterest for business purposes.", "actions": [["The user explores billions of Pins from around the world to discover new ideas every day.", ["interests", "location data", "search history", "device information"]], ["The user saves, organizes, and shares their favorite Pins for easy access.", ["saved Pins", "organized Pins", "shared Pins", "interests"]], ["The user creates stylistic theme boards to organize Pins and come back to them when needed.", ["theme boards", "Pins", "interests", "design preferences"]], ["The user sends favorite Pins to friends or shares them in messages to spread inspiration.", {"Personal data": ["favorite Pins", "shared Pins", "inspirational content", "friends"]}], ["The user uploads images directly to the Pinterest app to create their own Pins.", ["images", "created pins", "interests", "preferences"]], ["The user browses through a daily discovery feed filled with their favorite things.", ["interests", "preferences", "search history"]], ["The user connects with stores and innovators that match their aesthetic preferences.", ["aesthetic preferences", "shopping history", "preferred stores", "innovator interests"]], ["The user shops for various items like house plants, fashion pieces, or kitchenware directly from the app.", ["shopping preferences", "purchase history", "payment information", "shipping address"]], ["The user watches quick video tutorials in their feed to learn something new daily.", ["video tutorials", "learning preferences", "interests"]], ["The user organizes videos into boards and saves ideas for future projects.", ["videos", "creative ideas", "project plans"]], ["The user discovers new home decor ideas and design inspiration to bring their dream home to life.", ["home decor ideas", "design inspiration", "dream home preferences"]], ["The user explores tattoo ideas, follows famous tattoo artists, and discovers new styles.", ["tattoo ideas", "followed tattoo artists", "preferred tattoo styles"]], ["The user connects with other creators worldwide, takes inspiration from different corners of the world, and collaborates on group boards.", ["location", "interests", "collaborations", "network connections"]], ["The user can use Pinterest for business purposes, sync website content to Pins, and engage with customers.", ["business information", "website content", "customer interactions"]]]}, {"summary": "The mobile app, OruxMaps, is a versatile tool for outdoor activities allowing users to view both online and offline maps in various formats, access online maps for offline use, share positions with contacts, connect to external devices for data tracking, and utilize features like route navigation, geofence alarms, waypoint creation, and track editing.", "actions": [["The user can download online maps for offline use.", ["location data", "map preferences", "device information"]], ["The user can register into OruxMaps servers, providing personal information like email, date of birth, sex, weight, and height.", ["email", "date of birth", "sex", "weight", "height"]], ["The app asks the user to choose contacts to share their position for 'multitracking' option.", ["contacts", "geolocation data"]], ["The user can share their position with friends and display their friends' positions on their device.", ["geolocation data", "friend list"]], ["The user can create/save waypoints, attaching photo/audio/video extensions.", ["waypoints", "photos", "audio files", "videos"]], ["The user can create custom Waypoint types with their own icons and attach forms to the Waypoints.", ["custom Waypoint types", "icons", "forms"]], ["Basic support for Geocaching is provided.", ["location data", "activity logs", "geocaching preferences"]], ["The user can edit tracks using the track editor tool, modifying track points.", ["track data", "editing history", "device location"]]]}, {"summary": "The mobile app connects your smartphone to a shopping console, partner card, and wallet for contactless shopping in various stores.", "actions": [["The smartphone is connected to shopping console, Partner card, and wallet.", ["shopping history", "payment information", "loyalty card details"]], ["Partner card App allows contactless shopping in Selver, Delice, Kaubamaja, I.L.U., and L'Occitane shops.", {"Personal data": []}]]}, {"summary": "The mobile app allows users in Italy to find the nearest Burger King restaurant, place orders, customize products, access exclusive offers and events, participate in a loyalty program to earn rewards, and enjoy a convenient and fast dining experience.", "actions": [["The user downloads the updated version of the Burger King Italia app.", ["app downloads"]], ["The user finds the nearest restaurant location or orders from their favorite Burger King directly in the app.", ["location data", "favorite restaurants", "food preferences", "order history"]], ["The user customizes their products and selects preferred promotions.", ["product preferences", "customizations", "preferred promotions"]], ["The user decides whether to take away, use the King Drive option, or eat directly at the restaurant to enjoy their order quickly and without waiting.", ["location", "food preferences", "order history", "time constraints"]], ["The user discovers exclusive offers, events, and previews through the app.", ["location", "purchase history", "interests", "age"]], ["The user can choose to participate in the loyalty program to earn free rewards by earning crowns through purchases.", ["loyalty program participation", "purchase history", "earned crowns"]], ["The user accumulates crowns with each purchase, receiving 2 Crowns for every Euro spent.", {"Personal data": ["purchase history", "earned Crowns", "currency used"]}], ["The user explores the products available in the app to obtain and enjoy.", ["product preferences", "purchase history", "payment information"]]]}, {"summary": "The mobile app Opera features a powerful AI browser named Aria, built-in free VPN, private and personal browsing, ad-block, fast data-saving mode, secure web privacy, and the ability to sync across devices.", "actions": [["The user chooses from 3 locations for the free VPN provided by the app.", ["location preferences", "IP address", "device type"]], ["The user shares files and links across all Flow-enabled devices.", ["files", "links", "devices"]], ["The user follows interested topics to receive personalized newsfeed.", ["interest topics", "news preferences"]]]}, {"summary": "The mobile app enhances gaming experience by boosting performance, optimizing settings, and providing special features like game turbo, HDR graphics, and monitoring tools.", "actions": [["The user monitors memory load, storage load, temperature, and network latency using HUD Monitor.", ["memory load", "storage load", "temperature", "network latency"]], ["The user quickly launches their game with Quick Launch feature.", ["game preferences", "device information"]]]}, {"summary": "The mobile app allows users to easily find and manage charging points within the InCharge network, providing access to over 85,000 charging points in Europe, information on availability and rates, tracking of charging sessions, and notifications for available charging points.", "actions": [["The user manages their Vattenfall InCharge charging station.", {"Personal data": []}], ["The user searches and views more than 85,000 charging points in Europe.", ["location data", "search queries", "charging point details"]], ["The user checks the availability and charging rates of charging points.", ["location", "electric vehicle information", "charging preferences", "charging rates"]], ["The user views all charging sessions started with their charge card or credit card.", ["charging sessions", "charge card information", "credit card information"]], ["The user receives a notification when a charging point becomes available.", ["location", "charging preferences", "notification settings"]], ["The user enters their home address and work address to receive notifications about new charging points nearby.", ["home address", "work address", "location data"]], ["The user links their credit card to the app to pay for charging with the credit card.", ["credit card details"]], ["The user logs in to view all their charging sessions and payment details.", ["charging sessions", "payment details", "login information"]], ["The user sets a notification for a charging point to know when it becomes available.", ["location", "charging point availability", "preferred notification settings"]]]}, {"summary": "The mobile app offers exclusive daily deals on top fashion brands with discounts up to -75%, providing registered members with limited offers and benefits such as fast delivery, buy now pay later option, and a 31-day free return policy in select European countries.", "actions": [["The user discovers new exclusive deals every day in the app.", ["shopping preferences", "location", "purchase history", "interest in deals"]], ["The user saves up to -75% when shopping for favorite fashion brands in the app.", ["favorite fashion brands", "shopping habits", "discount preferences"]], ["The user finds top brands at extraordinary reduced prices.", ["shopping preferences", "budget constraints", "brand loyalty"]], ["The user shops from new deals every day before the countdown runs out.", ["shopping preferences", "location", "purchase history", "billing information"]], ["The user benefits from discounts up to -75% on favorite fashion pieces.", ["fashion preferences", "favorite fashion pieces", "discounts received"]], ["The user enjoys a daily selection of trendy curated items.", ["shopping preferences", "trend interests", "purchase history"]], ["The user keeps an eye on the newsletter to secure the best deals.", ["email address", "purchase history", "shopping preferences"]], ["The user registers with their ABOUT YOU account if they already have one.", ["name", "email", "password", "date of birth", "address", "phone number"]], ["The user benefits from fast delivery.", ["delivery address", "purchase history", "preferred payment method"]], ["The user downloads the ABOUT YOU Outlet app.", ["device information", "location data", "email address"]], ["The user shops the best deals available in Germany, Austria, Czech Republic, Slovenia, Slovakia, Romania, Hungary, and Croatia.", ["shopping preferences", "location data"]]]}, {"summary": "The mobile app offers a variety of ride options including eco-friendly choices, upfront pricing, safety features, affordable pricing options, exclusive perks with Uber One membership, advance ride reservations, and additional features like food delivery, car rentals, and package delivery.", "actions": [["The user finds the ride they want by picking from a wide range of products offered by the Uber app.", ["location data", "payment information", "ride preferences", "device information"]], ["The user experiences safety as a top priority with comprehensive safety features established by Uber.", {"Personal data": ["location", "payment information", "contact information", "ride history"]}], ["The user reserves rides in advance to plan their day with confidence.", ["location data", "preferred mode of transportation", "time preferences"]], ["The user chooses eco-friendly rides to reduce their carbon footprint with Uber's commitment to sustainability.", ["location", "ride preferences", "environmental interests"]], ["The user rents cars and has them delivered to their location with the online booking experience provided by Uber.", ["location", "booking history", "payment information", "travel preferences"]], ["The user enjoys additional features like ordering food through Uber Eats, using Uber Connect for no-contact delivery, and booking high-capacity group rides with Uber Charter.", ["location", "food preferences", "delivery preferences", "ride preferences"]]]}, {"summary": "The mobile app allows you to easily cast your phone to various smart TVs like Chromecast, Roku, Fire TV, Xbox, Samsung, and LG TV, enabling you to enjoy your content on a bigger screen with high quality and real-time speed, as well as control smart TV functions and stream music and games.", "actions": [["The user casts their phone screen to TV using the app.", ["phone screen content", "TV connection"]], ["The user can search and stream favorite TV shows on Chromecast TV screen, Roku TV screen, etc through screen mirroring.", ["search history", "favorite TV shows", "streaming preferences", "device information"]], ["The user streams videos and photos directly from their phone to TV using the app.", ["videos", "photos", "device information", "network information"]], ["The user streams music and plays games on the bigger TV screen.", ["music preferences", "game preferences", "device usage"]], ["The user can cast content directly from Youtube, Google Photos, and web browser to Chromecast and smart TV.", ["Youtube content", "Google Photos content", "web browsing history"]], ["The user enables screen mirroring on Roku and shares their screen on any Roku Stick, Roku Box, and Roku TV.", ["device information", "screen content"]], ["The user casts their photos and videos on Roku TV using the app.", ["photos", "videos"]]]}, {"summary": "The mobile app offers a BOGO promotion for purchasing watch faces with various features for Wear OS devices.", "actions": [["The user buys a Watch Face.", ["purchase history", "payment information", "device type"]], ["The user sends an email to mjwatchfaces@gmail.com.", ["email address"]], ["The user attaches a RECEIPT from Google to the email.", ["receipts", "email addresses", "purchase details"]]]}, {"summary": "The mobile app allows users to store and manage all their rewards cards in one place, while also offering features such as scanning barcodes for points, discovering exclusive offers, and saving Passbook/Apple Wallet passes.", "actions": [["The user pops up their rewards card's barcode on their phone for scanning by the cashier.", ["rewards card number", "barcode", "location data"]], ["The user browses coupons, discounts, flyers, and circulars in Stocard.", ["location", "shopping interests", "purchase history"]], ["The user saves Passbook/Apple Wallet passes, airline tickets, and gift cards in Stocard.", ["Passbook/Apple Wallet passes", "airline tickets", "gift cards"]], ["The user collects points with their Wear OS device.", ["fitness activities", "location data", "health data"]]]}, {"summary": "The mobile app helps parents track and understand their baby's mental development through 10 leaps, providing tips, insights, and a personalized schedule, with optional extras like a baby monitor and music to aid in sleep, awarded as one of the top 10 best sold apps by Apple in 2018, 2019, and 2020.", "actions": [["The user tracks their baby's mental development from 0-20 months using the app.", ["baby's age", "baby's milestones", "parenting choices", "location"]], ["The user keeps track of their baby's development and milestones in the app's diary feature.", ["baby's development", "milestones", "diary entries", "parenting preferences"]], ["The app provides over 350 extra milestones for the user to track in the diary as an optional extra.", ["diary entries", "milestones"]], ["The user can access additional features such as a baby monitor, E-Book, Audiobook, and music through the app.", ["parental status", "reading preferences", "listening preferences"]], ["The user manages and cancels their subscriptions through their Google Play Store settings.", ["subscriptions", "Google Play Store settings"]]]}, {"summary": "The mobile app allows users to instantly download their eSIM profile to access unlimited power with no contractual commitment, service charge, or activation fee, providing features such as unlimited minutes & SMS in Austria & the EU, unlimited data on Drei's network, and the ability to pause subscriptions for up to 12 months, with payment via Paypal, and live chat support available.", "actions": [["The user downloads their eSIM profile to their device for unlimited power.", ["eSIM profile", "device information", "mobile carrier information"]], ["The user activates their eSIM profile directly in the app.", ["eSIM profile", "mobile device information", "carrier information", "location data"]], ["The user gets unlimited minutes & SMS in Austria & the EU.", ["location", "telecommunication services plan"]], ["The user can pay via Paypal without providing bank details.", ["Paypal account information"]], ["The user can upgrade their up3 plan to include family members, friends, or colleagues.", ["family members", "friends", "colleagues"]], ["The user can easily change their personal data, account password, and payment method in settings.", ["personal data", "account password", "payment method"]], ["The user can book additional international units or speed boosts through add-on packages.", ["location", "payment information", "internet usage data"]], ["The user can chat with Drei's service team in real-time through the app.", ["chat messages", "user's issues or questions", "personal details shared during conversation"]]]}, {"summary": "The mobile app is an advanced Cubase control app designed to deepen your connection with Cubase by serving as your personal recording assistant, featuring project overview, mixer, and key command pages for enhanced functionality.", "actions": [["The user installs Cubase iC Pro app on their device.", ["device information", "app installation information"]], ["The user connects Cubase iC Pro app to their Cubase software.", ["Cubase iC Pro app", "Cubase software"]], ["The user rates Cubase iC Pro app on Google Play.", ["app name", "rating", "Google Play account information"]]]}, {"summary": "The mobile app is a lightweight smart contact manager that allows you to store and sync contacts, manage emails and events, customize fields, backup contacts automatically, create contact groups, and more, all with privacy and security in mind.", "actions": [["The user adds, edits, and deletes contacts in the app.", ["contact names", "phone numbers", "email addresses", "job titles", "social media profiles"]], ["The app syncs contacts with other devices and backups regularly.", {"Personal data": ["contact information"]}], ["The user sorts and filters contacts by multiple parameters.", ["contact information", "relationship status", "work information", "location data"]], ["The user displays and manages favorite contacts and groups.", ["contact names", "contact numbers", "contact emails", "contact photos", "group names", "group members"]], ["The user exports and imports contacts in vCard format for migrations or backups.", ["contact information", "email addresses", "phone numbers", "job titles"]], ["The user customizes visible fields and settings for contact management.", ["contact information", "preferences", "settings"]], ["The user uses the app for storing and managing contact events.", ["contact information", "event details", "notes", "reminders"]], ["The user customizes the behavior of clicking on a contact.", ["contact details", "interaction preferences"]]]}, {"summary": "The mobile app offers a convenient shopping experience with a wide selection of fashion items, including clothing, shoes, accessories, and sportswear, along with features for staying up-to-date on trends and sales, and the option for free returns.", "actions": [["The user shops for the latest trends in clothing, shoes, accessories, and sportswear.", ["clothing preferences", "shoe sizes", "accessories preferences", "sports interests"]], ["The user explores options focusing on sustainability.", ["sustainability interests", "shopping preferences", "environmental values"]], ["The user follows fashion experts to see how they style their outfits.", ["fashion experts", "outfit styles", "fashion preferences", "inferred clothing sizes"]], ["The user follows brands to see new items and collections.", ["brand preferences", "shopping interests", "purchase history"]], ["The user stays up to date with news and trends from fashion experts and brands.", ["fashion news", "trends", "expert opinions", "brand updates"]], ["The user discovers collections and lines from a variety of designer brands.", ["shopping preferences", "designer brands of interest", "budget range"]], ["The user stays up to date with sales, discounts, promotions, and discount codes.", {"Personal data": ["purchase history", "shopping preferences", "location", "email address"]}], ["The user browses a wide range of affordable and designer fashion items for all occasions.", ["fashion items", "shopping preferences", "budget range", "occasion types"]], ["The user selects the latest shoes from popular brands for women, men, and kids.", ["shoe preferences", "gender", "age group"]], ["The user explores fashion accessories such as handbags, backpacks, jewelry, hats, scarves, watches, and more.", ["fashion accessories preferences"]], ["The user enjoys free returns to try on items at home first.", {"personal_data": ["purchase history", "shipping address", "item sizes", "return history"]}], ["The user connects with Zalando on social media platforms like Facebook, Instagram, and Pinterest.", ["social media profiles", "likes", "dislikes", "preferences"]], ["The user leaves reviews and feedback for the app.", ["reviews", "feedback"]], ["The app sends personalized notifications to users for vouchers, sale alerts, and more.", {"Personal data": ["location", "purchase history", "preferences", "browsing behavior"]}], ["The app loads product images faster by accessing Photos/Media/Files.", ["photos", "media files"]], ["The app uses camera functionality for photo search and barcode scanning.", ["photos", "barcode data"]]]}, {"summary": "The mobile app Smart Switch allows users to transfer various types of data, including contacts, music, photos, and more, from Android, iOS, and Windows devices to new Galaxy devices wirelessly or via wired connections, with detailed instructions provided for each type of transfer.", "actions": [["The user clears cache and data for the Google Play Store app.", ["device information", "app usage data"]], ["The user moves their contacts, music, photos, calendar, text messages, and device settings to a new Galaxy device using Smart Switch.", ["contacts", "music", "photos", "calendar", "text messages", "device settings"]], ["The app suggests favorite apps or similar ones on Google Play.", {"Personal data": ["app usage data", "app preferences", "device information"]}], ["Android owners can transfer data wirelessly if their device is Android 4.0 or higher.", {"Personal data": ["Android device ownership", "Android OS version", "data to be transferred"]}], ["Android owners can transfer data using a charger cable and USB connector if their device is Android 4.3 or higher.", ["device type", "Android version"]], ["Users can transfer contacts, calendar, messages, photos, music, videos, call logs, memos, alarms, Wi-Fi, wallpapers, documents, app data, and home layouts using Smart Switch.", ["contacts", "calendar", "messages", "photos", "music", "videos", "call logs", "memos", "alarms", "Wi-Fi", "wallpapers", "documents", "app data", "home layouts"]], ["Users can send app data and home layouts by upgrading their Galaxy device to M OS.", ["app data", "home layouts", "Galaxy device information"]], ["Other Android devices from various manufacturers are supported for data transfer.", ["device information", "data transfer preferences", "device compatibility"]], ["Various permissions are required for the app service such as access to phone, call logs, contacts, calendar, SMS, storage, microphone, Bluetooth, and location.", ["phone data", "call logs", "contacts", "calendar events", "SMS messages", "stored data", "audio recordings", "Bluetooth information", "location data"]]]}, {"summary": "The mobile app, currently in beta version with upcoming updates, provides comprehensive information on over 14,000 camping sites and 11,500 pitches in Germany and Europe, offering features such as availability and real-time pricing, ADAC Campcard discounts, and detailed reviews for campers to plan their next camping trip efficiently.", "actions": [["The user plans for the next camping season using the app.", ["camping preferences", "outdoor activities interests", "location preferences"]], ["The app provides detailed information on over 14,000 camping sites and over 11,500 pitch sites in Germany and all of Europe.", {"Personal data": []}], ["The user searches for available camping sites at their travel date and books directly through the app.", ["travel dates", "location preferences", "booking information"]], ["The user utilizes comprehensive filtering options for quickly finding a camping site.", ["location preferences", "camping dates", "camping equipment preferences", "budget constraints"]], ["The user marks camping sites as favorites and adds personal notes.", ["camping sites", "favorites", "personal notes"]], ["The user can use the favorites function, view pictures, descriptions, and amenities of sites offline without an internet connection.", ["favorite sites", "pictures", "descriptions", "amenities"]], ["The app supports data transfer and device synchronization through Google Drive.", ["Google Drive account information", "device information", "synchronization data"]], ["The user makes use of the ADAC classification and camper reviews to make informed choices about camping sites.", ["camping preferences", "travel interests", "location preferences"]], ["The user saves money with the digital ADAC Campcard which offers discounts at participating camping sites.", ["financial transactions", "location data", "camping preferences"]], ["The app is available only in German language.", ["preferred language: German"]], ["All updates within the specified calendar year are included in the purchase.", ["purchase history", "calendar year", "updates"]]]}, {"summary": "The mobile app allows users to explore and shop the latest fashion trends for women, men, and kids from over 1000 brands, offering easy shopping with detailed product descriptions, size guides, synced cart and favorites across devices, quick payments, fast deliveries, and the ability to create fashion-forward outfits and shop for home decor items.", "actions": [["The user explores and discovers the latest fashion trends for women, men, and kids.", ["fashion trends", "gender", "age group"]], ["The user shops for fashion, clothes, shoes, and home decor from more than 1000 brands.", ["fashion preferences", "clothing sizes", "shoe sizes", "home decor preferences", "brands of interest"]], ["The user saves favorite items and fashion brands for easy access.", ["favorite items", "fashion brands"]], ["The user syncs their cart and favorites across devices for seamless shopping.", ["shopping cart items", "favorite items", "device information"]], ["The user makes secure payments and completes orders directly from the app.", ["payment information", "order history", "shopping preferences"]], ["The user logs in to view the status of new and previous orders.", ["order status", "order history"]], ["The user creates fashion-proof outfits with clothes and shoes from famous brands.", ["clothing preferences", "shoe preferences", "favorite brands"]], ["The user shops for beautiful design for every room in their home.", ["home decor preferences", "room layouts", "color schemes", "budget constraints"]], ["The user gets notified about new deals and special offers.", ["email address", "location", "shopping preferences"]]]}, {"summary": "The mobile app Email.cz from Seznam allows you to access your email inbox from anywhere, receive notifications for new emails, easily find older messages, open attachments directly in the app, and switch between multiple mailboxes securely with a PIN code.", "actions": [["The user easily finds older messages.", ["messages", "message history", "message recipients"]], ["The user adds multiple email accounts to the app.", ["email accounts"]]]}, {"summary": "The mobile app is a watch face for Wear OS devices with API Level 30+ featuring high resolution, optimization, low battery consumption, multilingual support, customizable features, and various settings instructions and recommendations, available for purchase with a promotion of buy 1 get 1 free.", "actions": [["The user installs the watch face on their Wear OS device.", ["device information", "location data", "app usage data"]], ["The user adjusts settings and customizations for the watch face.", ["watch face settings", "customizations"]], ["The user accesses complications and app shortcuts on the watch face.", ["watch face complications", "app shortcuts"]], ["The user follows news and promotions related to the watch face on various platforms.", ["watch face preferences", "news interests", "promotion preferences"]]]}, {"summary": "The mobile app AZ Recovery is a free, user-friendly tool that helps you quickly recover deleted photos, videos, and various file types, with features like fast and deep scanning, memory card support, file previews, and secure file deletion.", "actions": [["The user opens the AZ Recovery app to start the data recovery process.", ["data recovery process", "device information", "type of data lost", "time of data loss"]], ["The user selects the type of file they want to recover, such as photos, videos, audio, documents, compressed files, or APK files.", ["file types selected"]], ["The user initiates a fast scan to search for recently deleted files on their mobile device.", ["deleted files", "mobile device"]], ["The user previews the recovered photos and videos before confirming the recovery process.", ["photos", "videos", "recovery process confirmation", "data recovery preferences"]], ["The user recovers deleted photos, videos, audio files, documents, compressed files, or APK files using the AZ Recovery app.", ["deleted photos", "videos", "audio files", "documents", "compressed files", "APK files"]]]}, {"summary": "The mobile app allows users to stay connected with Battle.net, keep up with friends and groups, explore games, manage account security, contact Blizzard Support, and access various features in multiple languages.", "actions": [["The user keeps up with friends and groups, sees what friends are playing, adds new friends, coordinates play time, discusses strategies, or stays in touch.", ["friends", "groups", "game activity", "friend requests", "play schedules", "strategies discussed", "communication history"]], ["The user explores games and finds their next adventure, reads patch notes, explores gaming communities and forums, and discovers something new to play through the Shop and Games tabs.", ["game preferences", "patch notes", "community interactions", "shop activity"]], ["The user contacts Blizzard Support, browses support articles, opens new tickets, and replies to ongoing tickets directly from the app.", ["contact information", "support ticket details"]]]}, {"summary": "The mobile app is a comprehensive field guide for birdwatchers, featuring over 700 European species with illustrations, detailed information, search filters, and a listing tool, along with songs and calls for identification, available in multiple languages and incorporating mapping data.", "actions": [["The user reads detailed text covering habitat, range, identification, and voice by Lars Svensson.", ["reading habits", "interest in nature", "reading preferences"]], ["The user records sightings, location, and date with the listing tool.", ["sightings", "location", "date"]], ["The user uses the powerful search filter to identify a species quickly.", ["search filters", "species data", "search history"]], ["The user swipes through species quickly and easily due to the intuitive design.", ["species preferences", "swiping patterns", "interaction behavior"]], ["The user selects species names from 18 languages.", ["species names", "language preferences"]], ["The app incorporates British Trust for Ornithology/BirdWatch Ireland/Scottish Ornithologists' Club Bird Atlas 2007–11 mapping data.", ["location data", "bird sightings", "bird species of interest"]], ["The app offers curated lists of confusable species.", ["species interests", "location", "preferred language", "inferred age"]], ["The app includes over 750 carefully selected songs and calls for species identification.", ["song preferences", "species identification data"]]]}, {"summary": "The mobile app provides convenient banking operations, from account opening to daily payments, with an easy-to-use interface.", "actions": [["The user opens a bank account using the app.", ["name", "address", "date of birth", "identification documents", "financial information"]], ["The app provides convenience for banking operations.", ["financial transactions", "account details", "transaction history", "personal identification information"]]]}, {"summary": "The mobile app transforms your smartwatch into a festive winter wonderland with a customizable snow globe, offering 20 color themes, essential timekeeping features, health monitoring tools, and battery level display for a cheerful and functional holiday experience.", "actions": [["The user personalizes the snow globe with festive backgrounds.", ["festive backgrounds", "holiday preferences", "decorating style"]], ["The user selects one of the 10 different festive backgrounds.", ["festive backgrounds"]], ["The user customizes the watch face with one of the 20 unique color themes.", ["watch face", "color themes"]], ["The user chooses vibrant reds and greens for a classic Christmas look.", ["color preferences", "holiday preferences"]], ["The user tracks time using both 12 and 24-hour formats.", ["time preferences"]], ["The user keeps an eye on the current date displayed in English.", ["location", "language preference"]], ["The user checks the step counter for fitness motivation.", ["step count", "fitness goals"]], ["The user recharges the Wear OS device when the battery level is low.", ["device usage data", "battery level", "charging habits"]]]}, {"summary": "The mobile app consolidates employee benefits for lunch, wellness, sport, and culture, and commuting into one convenient platform, allowing users to make payments using their benefits or Finnair Plus points at various merchants while also offering a multi-wallet solution for easy transactions beyond benefit limits.", "actions": [["The user downloads the Epassi app to access their employee benefits.", {"Personal data": []}], ["The user loads MyMoney balance to pay for services exceeding benefit limits.", ["MyMoney balance", "services", "benefit limits"]], ["The user keeps track of benefit balances and payment receipts on the app.", ["benefit balances", "payment receipts"]]]}, {"summary": "The mobile app is a compact 4-track recorder with audio effects and import/export capabilities, designed as a tool for songwriters and creative musicians to capture ideas and demos on-the-go.", "actions": [["The user records song ideas, demos, and sound-sketches using the 4-track recorder.", ["song ideas", "demos", "sound-sketches", "music preferences"]], ["The app provides audio effects such as Fuzz, Chorus, Delay, Equalizer, Reverb, Phaser, Compressor.", ["audio preferences", "music interests"]], ["The user imports and exports their own music in MP3/WAV formats.", ["music files", "imported music", "exported music", "MP3 format", "WAV format"]], ["The user edits their tracks within the app.", ["music tracks", "editing preferences", "preferred genres"]], ["The app supports live monitoring for devices with Android 10 or higher.", ["device information", "operating system version"]]]}, {"summary": "The mobile app is the official driver theory test preparation tool for car drivers and motorcyclists, offering unlimited access to learning materials, progress tracking, and sample tests to ensure full preparation for the theory test.", "actions": [["The user accesses unlimited Official Driver Theory Test learning material for categories AM and BW.", ["driver theory test categories AM", "driver theory test categories BW"]], ["The user's progress is tracked as they learn.", ["learning progress"]], ["The user completes Official Driver Theory Test sample tests.", {"Personal data": ["name", "address", "driver license number", "date of birth", "nationality"]}]]}, {"summary": "The mobile app offers a comprehensive 4 in 1 solution for UK learners preparing for their Driving Theory Test, with a pass guarantee, lifetime access for £4.99, and exclusive content including DVSA revision questions, mock tests, video clips, personalized learner plans, hazard perception clips, Highway Code revision, road signs practice, practical driving lessons, and a range of awards and accolades.", "actions": [["The user revises DVSA revision questions, answers, and explanations for the Theory Test.", ["DVSA revision questions", "answers", "explanations", "Theory Test"]], ["The app provides unlimited timed mock theory tests, including video clip scenarios.", ["mock theory test results", "video clip preferences"]], ["The user follows the 4 in 1 Learner Plan to guide them through Theory Test revision.", ["learner plan", "theory test topics", "revision progress", "study habits"]], ["The app offers English voiceover for Theory Test questions and The Highway Code.", ["language preferences", "learning preferences"]], ["The user revises the latest UK Highway Code and takes an interactive quiz on the A-Z topics.", ["UK Highway Code", "interactive quiz results"]], ["The user learns official UK road signs with illustrations, descriptions, and photos.", ["location (UK)", "learning activity", "interest in driving", "visual preferences"]], ["The user accesses over 160 virtual Practical Driving Lesson videos to prepare for the Driving Test.", ["driving test preparation", "learning style", "driving knowledge", "video viewing history"]], ["The user gets exclusive offers and rewards through the app.", ["email address", "name", "purchase history", "location"]]]}, {"summary": "The mobile app is a Headunit Receiver emulator for Android Auto that can be used via USB, WiFi, or self mode on compatible Android powered head units like Joying, Xtrons, and others.", "actions": [["The user installs WiFi Launcher app on the phone and selects the car's BT.", {"Personal data": ["phone model", "installed apps", "car's bluetooth device"]}], ["The user looks for a setting on their Android powered headunit that allows Video Playback during drive if they get a black screen.", ["device type", "operating system", "location", "search history"]], ["The user checks for more FAQs, hardware key support, intent support, and troubleshooting on the forum link provided.", ["FAQs", "hardware key support", "intent support", "troubleshooting"]]]}, {"summary": "The mobile app provides comprehensive earthquake information, including early warnings and user reports, utilizing smartphone technology to detect earthquakes in real-time and alert users in advance.", "actions": [["The app provides earthquake early warnings.", ["location data", "device information"]], ["The user submits reports on felt earthquakes.", ["location of earthquake", "date and time of earthquake", "intensity of shaking felt", "personal impact of the earthquake"]], ["The Earthquake Network research project develops a smartphone-based earthquake early warning system.", {"Personal data": []}]]}, {"summary": "The mobile app allows users to stream webvideos, online movies, livestreams, and live TV shows directly to their Amazon Fire TV or Fire TV Stick, with support for various video formats and features like remote playbar, ad-blocker, and bookmarks.", "actions": [["The user upgrades their Fire TV to watch webvideos, online movies, livestreams, and live-tv shows directly on the biggest screen.", ["device information", "watching preferences", "content preferences"]], ["The app only works with Amazon Fire TV or Fire TV Stick.", ["device information", "Amazon account details"]], ["The Pro app version has no ads and the Ad-Blocker feature blocks ads & popups on most websites that the user visits. The user can enable/disable it at any time in the settings.", {"Personal data": ["app version", "ads preferences", "websites visited"]}], ["The user can add and manage bookmarks in the bookmarks menu or directly in the browser.", ["bookmarks", "website URLs"]], ["After purchasing, the user can set their personal homepage in the settings.", ["purchased items", "homepage preferences"]]]}, {"summary": "The mobile app is designed for old school photographers or advanced amateurs shooting analog photography, offering features such as reflected and incident light metering, ISO range from 3 to 6400, low light alert, and more.", "actions": [["The developer creates an app for old school photographers and advanced amateurs.", {"Personal data": ["photography skills", "preferred camera models", "editing techniques", "interest in film photography"]}], ["The app displays Exif and sensor info on the screen.", {"Personal data": ["location data", "device information"]}], ["The app allows holding incident light readings.", ["location data", "time of day", "light intensity", "device information"]], ["The app supports an alternative ISO selector.", ["location", "language preferences", "keyboard settings"]], ["The app supports spot measure if the camera has zoom capabilities.", ["camera type", "zoom capabilities"]]]}, {"summary": "The mobile app allows users to chat with ChatGPT technology securely and conveniently without the need for an account or password, providing comprehensive answers and suggestions on various topics for knowledge and leisure.", "actions": [["The user downloads the ChatBot mobile app to their phone.", ["device information", "phone number", "app usage data"]], ["The user uses ChatBot without needing to create an account or remember a password.", {"Personal data": ["conversation history", "preferences", "location data"]}], ["The user chats with ChatGPT to know the latest news, weather, entertainment, sports, health, food, or any other topics.", ["news interests", "weather preferences", "entertainment preferences", "sports interests", "health concerns", "food preferences", "other topics of interest"]], ["ChatBot helps the user gain more knowledge and have fun in their leisure time.", ["interests", "leisure activities", "knowledge level", "preferred topics"]], ["The user enjoys chatting easily with ChatBot and experiencing the app.", ["chat logs", "user interactions", "app usage data"]]]}, {"summary": "The mobile app allows users to connect with friends, share moments through photos and videos, explore a diverse community, express themselves with creative tools, discover new content and products, and engage with favorite creators and brands.", "actions": [["The user connects with friends and shares updates on their activities.", ["friend connections", "activity updates", "location"]], ["The user adds photos and videos to their story with creative tools.", ["photos", "videos", "creative tools", "user preferences"]], ["The user messages friends using Messenger.", ["messages", "contacts", "chat history"]], ["The user creates and watches short, entertaining videos on Instagram with Reels.", ["videos", "watch history", "entertainment preferences", "Reels interactions"]], ["The user posts photos and videos on their feed for others to see.", ["photos", "videos", "user's feed", "audience preferences"]], ["The user watches videos from favorite Creators and explores new content on Instagram Video and Reels.", ["videos", "favorite Creators", "explore history", "likes and interests"]], ["The user gets inspired by photos and videos from new accounts in Explore.", ["photos", "videos", "Explore accounts"]], ["The user discovers brands, small businesses, and shops for products relevant to their style.", ["style preferences", "shopping habits", "location", "purchase history"]]]}, {"summary": "The mobile app allows users to take notes, annotate and edit PDFs with features such as digital planning, customizable handwriting, importing PDF files, creating hyperlinks, managing documents, and syncing between Android devices.", "actions": [["The user takes notes, annotates, and edits PDFs.", ["notes", "annotations", "edited PDFs"]], ["The user customizes pen color, thickness, and style.", ["pen color", "pen thickness", "pen style"]], ["The user highlights and underlines with the snap straight highlighter pen.", ["highlighted text", "underlined text"]], ["The user adds photos and images to documents.", ["photos", "images", "document content"]], ["The user imports custom fonts.", ["font preferences"]], ["The user uses handwriting to text conversion feature.", ["handwriting samples", "converted text"]], ["The user moves, resizes, rotates, and groups objects.", ["user interactions", "object positions", "object sizes", "object rotations", "object grouping"]], ["The user interacts with digital planners included in the app.", ["planner data", "schedule", "tasks", "reminders"]], ["The user imports PDF files and planners into the app.", ["PDF files", "planners"]], ["The user creates hyperlinks in documents.", ["documents", "hyperlinks"]], ["The user manages documents by creating folders and subfolders.", ["documents", "folder structure"]], ["The user duplicates, moves, renames, or deletes files.", ["files", "file names", "file locations"]], ["The user syncs documents between Android devices using Google Drive.", ["documents", "Android devices", "Google Drive account"]], ["The user requests a refund within 7 days via email.", ["email address", "purchase details", "refund request details"]]]}, {"summary": "The mobile app is a keymapper for gamepads that allows users to run games directly without cloning, supports Google Play login, and works with a variety of keyboards and mice, as well as most apps and games, offering gamepad calibration and activation on different Android versions.", "actions": [["actions", {"Personal data": []}]]}, {"summary": "The mobile app offers interactive English lessons, educational games, and activities for kids aged 3-8, helping them learn first words, ABC's, numbers, colors, and shapes through speech practice and fun cartoons, with cutting-edge speech technology providing personalized learning opportunities and essential communication skills.", "actions": [["The user interacts with Buddy to learn first words, ABC's, numbers, colors, and shapes.", ["child's age", "learning progress", "interest in words", "ABC's knowledge", "number recognition", "color preferences", "shape recognition"]], ["The app provides interactive English lessons with speech practice, fun cartoons, and preschool learning games for kids.", ["English language proficiency", "age of child", "speech practice data", "cartoon preferences", "preschool learning game preferences"]], ["Buddy teaches essential communication skills and key early education concepts through a mix of cartoons, educational activities, and English learning games for kids.", ["communication skills", "early education concepts", "cartoons", "educational activities", "English learning games", "age of the child"]], ["The app is designed by an expert team of educators and engineers with Ph.Ds in Education Science, Psychology of Learning, and Computer Science.", {"Personal data": []}], ["Buddy challenges children to use words and phrases correctly in conversation and helps them improve their pronunciation.", ["children", "words and phrases", "pronunciation"]], ["Parents can track their child's progress with weekly reports and learning stats on the app.", ["child's progress", "weekly reports", "learning stats"]]]}, {"summary": "The mobile app offers a personalized feed of short-form videos across various categories, provides tools for creating original videos with special effects and music, and allows users to engage with a global community of creators.", "actions": [["The user watches short-form videos on TikTok.", ["watch history", "liked videos", "engagement duration"]], ["The user engages with videos they like on TikTok.", {"Personal data": ["liked videos", "viewing habits", "interaction history"]}], ["The user skips videos they do not like on TikTok.", ["videos", "video preferences"]], ["The user discovers and creates their own original videos on TikTok.", ["videos", "music interests", "creative preferences", "interaction history"]], ["The user uses tools provided by TikTok to capture daily moments.", ["videos", "captured moments", "location data", "device information"]], ["The user adds special effects, filters, music, and more to their videos on TikTok.", ["videos", "special effects", "filters", "music", "video preferences"]], ["The user explores various video categories on TikTok.", ["video categories"]], ["The user pauses and resumes video recording multiple times on TikTok.", ["videos", "recording duration", "pausing frequency"]], ["The user is entertained and inspired by a global community of creators on TikTok.", ["user preferences", "liked videos", "following list", "engagement data"]], ["The user adds their favorite music or sound to their videos on TikTok for free.", ["favorite music", "sounds", "videos"]], ["The user expresses themselves with creative effects on TikTok.", ["creative effects", "user-generated content", "interests", "preferences"]], ["The user edits their own videos using integrated editing tools on TikTok.", ["videos", "editing preferences", "music choices", "creative style"]]]}, {"summary": "The mobile app offers ad-free torrent downloads directly to your Android device, featuring battery-saving and auto-shutdown capabilities, integrated media libraries, and special introductory pricing for the Pro version.", "actions": [["The user upgrades to the Pro version of the uTorrent app.", ["payment information", "device type", "usage data"]], ["The app provides a Battery Saver feature for users.", ["battery level", "device type", "app usage patterns"]], ["The user benefits from lower pricing for a limited time.", {"Personal data": ["purchase history", "shopping preferences", "location"]}], ["The user accesses their media through integrated music and video libraries.", ["music library", "video library"]], ["The user chooses the download location for added torrents.", ["download location", "torrents"]], ["The user plays multiple music files in a torrent as a playlist.", ["music files", "playlist preferences"]], ["The user gives feedback by emailing utandroidpro@bittorrent.com.", ["email address"]]]}, {"summary": "The mobile app enhances internet privacy and security by encrypting data, protecting against security threats, and offering WARP+ for faster performance.", "actions": [["The user subscribes to WARP+ on a monthly basis for unlimited data.", ["subscription details", "payment information", "usage data"]], ["The user cancels the subscription in settings in the Google Play Store at least 24 hours prior to the end of the current period.", {"Personal data": []}]]}, {"summary": "The mobile app offers a wide range of high-quality car parts and tires from trusted brands, with detailed product descriptions, compatibility checks, customer reviews, professional customer service, promotions, and discounts, as well as video tutorials for car repairs, available 24/7 for various makes and models of cars.", "actions": [["The user selects their car make, model, and engine.", ["car make", "car model", "engine type"]], ["The user looks for the parts their car needs using filters for better search results.", ["car make", "car model", "car year", "car parts needed", "search filters"]], ["The user checks users' reviews or similar items to find the perfect match.", ["reviews", "preferences", "search history"]], ["The user asks for professional technical support via chat in case they have doubts.", {"Personal data": ["chat conversations", "technical questions", "device information"]}], ["The user adds the chosen spare parts to their basket.", ["spare parts", "chosen items"]], ["The user chooses the most suitable payment method and delivery method.", ["payment methods", "delivery methods", "billing address", "shipping address"]], ["The user tracks their order.", {"Personal data": ["order details", "delivery address", "payment information"]}], ["The user enjoys their new car part.", ["car model", "car part", "purchase history", "location"]], ["The user checks video tutorials for easy repair.", {"Personal data": ["repair topics", "device type", "level of expertise", "previous repair attempts"]}]]}, {"summary": "The mobile app is a sporty analog, military, hybrid watch face designed for Wear OS devices, featuring various customization options and compatibility with round watches from multiple brands.", "actions": [["The user installs the BALLOZI VERO watch face on their Wear OS device.", ["Wear OS device information", "watch face preferences"]], ["The user checks their watch face list on their watch after installing the watch face.", ["watch faces", "installed watch faces"]], ["The user checks the Galaxy Wearable app on their phone for Samsung watches to apply the newly installed watch face.", ["phone usage data", "Samsung watch preferences", "installed watch faces"]], ["The user can email the developer for support or requests at balloziwatchface@gmail.com.", ["email address"]]]}, {"summary": "The mobile app allows travelers to easily plan and book tickets for buses, trains, flights, and ferries in Europe and beyond, offering a comprehensive travel booking platform with a trip planner feature, exclusive offers, and trusted transport companies, as well as 24/7 customer support and secure payment options, catering to over 27 million monthly users.", "actions": [["Customers can use the app as a handy travel planner.", ["travel plans", "itinerary", "destination preferences"]], ["Customers can save time and money by choosing Omio for booking tickets.", {"Personal data": []}], ["The journey planner helps customers find the best bus, train, or flight ticket for their journey.", ["starting location", "destination", "travel date", "preferred mode of transportation", "number of travelers"]], ["Customers can compare and book travel tickets in 35 countries using the app.", ["travel preferences", "payment information", "location data", "booking history"]], ["Users can store most of their train and bus tickets directly on their phone for easier travel around Europe.", ["train tickets", "bus tickets", "travel history", "location data"]], ["Customers can explore different ways to travel through the trip planner feature.", ["travel preferences", "destination preferences", "budget", "time constraints", "transportation preferences"]], ["Customers can benefit from exclusive travel offers and discounts available through the app.", ["travel preferences", "location data", "purchase history", "payment information"]], ["Customers have access to a customer service team that speaks their language and offers support.", ["language spoken", "support inquiries", "customer details"]], ["Customers receive live trip updates and platform information for certain train services.", ["location data", "train service details", "travel preferences"]], ["Users can book bus and coach tickets with various bus companies listed in the app.", {"Personal data": ["travel itinerary", "payment information", "contact details", "seating preferences"]}], ["Users can book flight tickets with various airlines listed in the app.", ["flight preferences", "payment information", "travel dates", "personal identification details"]], ["Customers can now book ferry tickets through Omio for select ferry companies.", ["booking information", "travel dates", "passenger names", "payment details"]], ["Customers can access answers to their questions by visiting the provided contact link.", ["questions", "contact information"]]]}, {"summary": "The mobile app aims to simplify finance by offering transactional banking, physical and virtual cards, instant payments, access to investments, competitive exchange rates for spending abroad, 24/7 customer service, real-time notifications, easy signup, low fees, and community involvement.", "actions": [["The user creates an account in minutes.", ["email address", "password", "username"]], ["The user receives real-time notifications of card transactions and money received.", ["financial transactions", "transaction amounts", "transaction dates", "sender/receiver information"]], ["The user takes control of their spending by viewing past transactions.", ["financial transactions"]], ["The user sets up customized permissions and restrictions for their card.", ["financial information", "card usage preferences", "location data"]], ["The user generates a virtual card instantly.", ["name", "email", "credit card information", "billing address"]], ["The user saves money on exchange rates when spending abroad.", ["location", "currency preferences", "transaction history"]], ["The app invites users to join the community to shape the financial platform.", {"Personal data": ["financial information", "demographic information", "community activities", "interests"]}]]}, {"summary": "The mobile app allows fans with tickets to securely manage and transfer them on their mobile devices.", "actions": [["Fans transfer tickets to others through the app.", ["ticket information", "transfer recipient's information"]], ["Fans keep their tickets on their mobile device with the app.", ["tickets", "mobile device"]], ["Fans assign a guest a ticket using the app.", ["guest's name", "event details", "ticket assignment"]]]}, {"summary": "The mobile app creates invite-only spaces with topic-based channels for text, voice, and video chat, allowing users to stay connected with friends and communities through various interactive features like image sharing, video streaming, and custom emojis.", "actions": [["The user creates an invite-only place for their community or friends.", ["community members", "invite list", "shared content", "location data"]], ["The user sends messages directly to friends or calls them using voice chat.", ["messages", "voice chat", "friends list"]], ["The user joins voice channels to hang out with friends and watch videos together.", ["voice channels", "friend connections", "watched videos"]], ["The user engages in low-latency voice and video chat to stay close with friends.", ["voice data", "video data", "chat messages", "friend list"]], ["The user talks with friends while gaming and shares images easily.", ["conversation history", "gaming activity", "shared images"]], ["The user communicates with friends using text, video, and voice chat options.", ["text messages", "video calls", "voice calls", "friends list"]], ["The user waves hello over video, watches friends stream games, and shares stories over voice calls.", ["video calls", "friends' game streams", "voice calls", "personal stories"]], ["The user snaps photos to create custom emojis and shares them with friends.", ["photos", "custom emojis", "friend list"]], ["The user shares funny videos, stories, and group photos with friends.", ["videos", "stories", "group photos"]], ["The user hangs out in group channels or engages in private conversations through direct messages.", ["group channel messages", "direct messages"]], ["The user zooms through conversations with friends using topic-specific channels.", ["conversations", "friends", "topics of interest", "channel preferences"]], ["The user utilizes custom moderation tools and permission levels to manage their community or group effectively.", ["moderation tools", "permission levels", "community/group management preferences"]]]}, {"summary": "The mobile app requires installation steps including connecting your watch to your phone, downloading the companion app, and following instructions on your watch for installation, with additional options for installing the watch face via different methods and compatibility with Wear OS devices.", "actions": [["The user installs, downloads, and opens the companion app on their phone.", ["device information", "operating system", "app usage data"]], ["The user installs the watch face via the Galaxy Wearable app on their phone.", {"Personal data": ["watch face preferences", "phone model", "app usage data"]}], ["The user can install the watch face using the phone web browser if a PC/laptop is not available.", ["device type", "location data", "IP address"]]]}, {"summary": "The mobile app allows users to create, edit, and mix multi-track music projects on their Phone, Tablet, or Chromebook, featuring audio recording, a variety of effects and instruments, MIDI controller support, and the ability to share songs via Wi-Fi or Cloud.", "actions": [["The user records, sequences, edits, mixes, and renders complete songs.", ["audio recordings", "song compositions", "editing preferences", "music genres"]], ["The user imports and exports MIDI files (Single-track or Multi-track).", ["MIDI files", "music preferences", "musical skills"]], ["The user edits notes or captures recorded performances using the Piano roll.", ["notes", "recorded performances", "editing history"]], ["The user saves and loads WAV, MP3, AAC, FLAC, MIDI files.", ["audio files", "music preferences", "file storage"]], ["The user shares songs via Wi-Fi or Cloud to other Mobile 3 installations.", ["songs", "Wi-Fi data", "Cloud data"]], ["The user experiences touch to audio output latency depending on the device.", ["device type", "audio output latency"]], ["The user makes in-app purchases for the DirectWave sample player.", {"Personal data": ["payment information", "purchase history", "device information"]}], ["The user utilizes all included Instrument modules: Drum Sampler, DirectWave Sample Player, GMS, Transistor Bass, MiniSynth & SuperSaw.", ["music interests", "preferred instruments", "level of music production skills"]], ["The user accesses included Drum Samples and DirectWave Instruments.", ["music preferences", "instrument preferences", "audio samples used"]], ["The user grants Location permission required for Bluetooth Low Energy (BTLE) connectivity.", ["location data", "Bluetooth device information"]], ["The user registers FL Studio Mobile and visits the support forums for assistance.", ["FL Studio Mobile registration details", "support forum interactions"]], ["The user downloads the demo version of the FL Studio Desktop PC version and uses the FL plugin version of FL Studio Mobile.", ["device information", "downloaded apps", "FL Studio usage"]]]}, {"summary": "The mobile app allows users to automate various tasks on their Android devices, such as changing settings, sending SMS, creating notifications, and more, without requiring root access for most functions.", "actions": [["The user sets up automations on their phone based on various contexts and events.", ["phone settings", "location data", "calendar events", "app usage data"]], ["The user creates custom actions to customize their phone settings and perform tasks.", ["phone settings", "task preferences", "custom actions"]], ["The user configures Tasker to automatically backup files to different locations.", ["files", "backup locations", "backup schedule"]], ["The user designs custom user interfaces (Scenes) to display information or trigger tasks.", ["user interface designs", "information preferences", "task preferences"]], ["The user creates standalone apps using the Tasker App Factory.", ["app projects", "preferences", "device information"]]]}, {"summary": "The mobile app offers a customizable widget pack with over 200 designs to enhance your Android homescreen using Kustom KWGT Pro.", "actions": [["The user installs Kustom KWGT app on their Android device.", ["device information", "location data", "app usage data"]], ["The user chooses a widget design they like and saves it.", ["widget design choice", "saved widget designs"]], ["The user experiments with combining various widgets to create a new look for their homescreen.", ["widgets", "homescreen layout", "color preferences"]], ["The app allows for easy color customization of any widget with just a few taps.", ["color preferences", "widget usage data"]]]}, {"summary": "The mobile app's Pro Edition unlocks all features of NFC Tools, allowing users to read, write, and program tasks on NFC tags and other compatible chips with additional exclusive features, such as a profile management system, shortcut execution, and conditional blocks for creating complex actions.", "actions": [["The user reads, writes, and programs tasks on NFC tags and other compatible NFC chips with a simple and lightweight user interface.", ["tasks", "NFC tags data", "NFC chips data", "user interface preferences"]], ["The user unleashes the power of their imagination to create fun and useful routines.", ["imagination", "routines", "interests", "personality traits"]], ["The user saves profiles (records and tasks) using the profile management system.", ["profiles", "records", "tasks"]], ["The user imports from existing NFC tags to edit records or tasks quickly.", ["NFC tag data", "records", "tasks"]], ["The user creates complex actions with conditions using conditional blocks.", ["user-defined actions", "conditions", "block configurations"]]]}, {"summary": "The mobile app offers a range of features, including color customization, Shared Theme functionality, and privacy benefits, while encouraging support for the developers through installation and usage.", "actions": [["The user supports the app in some way.", {"No personal data": "processed for this action"}], ["The app unlocks every feature when installed.", ["device information", "location data", "usage data"]], ["The app allows color customization.", ["color preferences", "design choices"]], ["The app prevents displaying a 'Donate please' dialog in free apps.", ["app usage data", "purchase history", "payment information"]], ["Changing a color in one app updates all other apps with the same color.", ["color preferences"]], ["Newly installed apps from the suite automatically receive shared colors.", ["shared colors"]], ["The app comes with material design and dark theme by default.", {"Personal data": []}], ["The app provides a great user experience for easy usage.", ["usage patterns", "device information", "preferences"]], ["The lack of internet access provides more privacy, security, and stability.", {"personal_data": ["location", "online activity", "device information"]}], ["The app contains no ads or unnecessary permissions.", ["none"]], ["The app is fully opensource.", ["None"]]]}, {"summary": "The mobile app serves as a comprehensive travel companion for booking and managing regional and long-distance transportation, offering digital tickets, real-time information, best price search, and a user-friendly interface.", "actions": [["The user books long-distance and local transport for themselves, their bike, or their dog.", ["transport booking details", "location data", "travel companions", "pet information"]], ["The user finds the lowest prices using the Best Price Search feature.", ["search queries", "product preferences", "location data"]], ["The user receives real-time information with push notifications and the travel preview.", {"personal data": ["location", "travel preferences", "device information"]}], ["The user views their favorite connection at a glance with the commuter widget.", ["connection information", "location data", "relationship status"]], ["The user boards trains more easily with train information on the current coach sequence.", ["train information", "current coach sequence", "location data"]], ["The user utilizes the self check-in service 'Komfort Check-in' to travel without disturbance.", ["travel itinerary", "personal identification details", "seating preferences", "preferred services"]]]}, {"summary": "The mobile app allows users to easily create photo books, wall art, prints, photo cards, calendars, and various personalized photo gifts with automatic grouping, smart design assistance, and eco-friendly production.", "actions": [["The user creates and saves projects using the CEWE app.", ["photos", "project titles", "project content", "chosen designs"]], ["The user uploads photos to create photo books, prints, wall art, canvas prints, photo cards, photo calendars, and photo gifts.", ["photos", "photo books", "prints", "wall art", "canvas prints", "photo cards", "photo calendars", "photo gifts"]], ["The app automatically groups top events from the user's images for easier photo book design.", ["images", "events", "location data"]], ["The app provides a smart design assistant to quickly design a CEWE PHOTOBOOK based on the user's favorite photos.", ["favorite photos", "design preferences", "book theme choices"]], ["The app offers various paper types and binding options for photo books, including up to 202 pages.", ["photo books", "paper types", "binding options", "page count"]], ["The user selects and orders photo prints in different sizes and paper finishes.", ["photos", "print sizes", "paper finishes", "shipping address"]], ["The user designs and orders phone cases for various smartphone models.", ["phone case designs", "smartphone models", "shipping address"]], ["The user prints photos on different materials for wall art such as canvas, acrylic, aluminium, or wood.", ["photos", "printing material preferences"]], ["The app offers a variety of finishes for photo posters, including Glossy, Matte, Pearl, Silk, Semi Gloss, and Fine Art Matte.", ["photo posters", "preferred finishes"]], ["The user designs and orders photo cards for different occasions in single or pack formats.", ["photos", "occasions", "card design preferences", "shipping address"]], ["The user creates and orders photo calendars in wall or desk formats with different paper options and styles.", ["photos", "calendars", "paper options", "styles"]], ["The app provides support for personalized jigsaw puzzles, photo snowglobes, photo magnets, and personalized tote bags as photo gifts.", ["photos", "jigsaw puzzle preferences", "snowglobe preferences", "magnet preferences", "tote bag preferences"]], ["The app promotes being a UK manufacturer and part of Europe's leading photo company, offering climate-neutral products and 100% satisfaction guarantee.", {"Personal data": []}], ["The user can contact customer service for questions or support via email or phone, available 24/7.", {"personal_data": ["contact details", "questions", "support inquiries"]}]]}, {"summary": "The mobile app allows users to purchase high-quality, unsold food from various food service providers at a discounted price while helping to combat food waste.", "actions": [["The user purchases unsold high-quality food at a discount on the Munch platform.", ["food preferences", "location", "payment information", "purchase history"]], ["The user takes action against food waste by buying food from restaurants, bakeries, and other food service providers on Munch.", ["location", "purchase history", "food preferences", "participating restaurants and bakeries"]]]}, {"summary": "The mobile app facilitates the installation and customization of a festive Wear OS watch face featuring an animated Christmas tree, snow, and magic sparkle, with compatibility for various Wear OS devices and customization options available.", "actions": [["The user checks compatibility of their watch with WEAR OS before installing the app.", ["type of watch", "operating system (WEAR OS) compatibility"]], ["The user can contact support@recreative-watch.com before rating the app unfairly.", ["email address", "app rating"]], ["The user can follow the official installation tutorials provided by Samsung on YouTube.", ["device brand preference", "learning preferences", "YouTube activity"]], ["The user can customize the watch face by touching and holding the display and tapping on the Customize option.", ["watch face design preferences"]], ["The app provides links to their Instagram and Facebook profiles for users to follow.", ["Instagram profile", "Facebook profile"]]]}, {"summary": "The mobile app is a powerful all-in-one video editor and maker with professional features, allowing users to easily create vlogs, edit photos, add music and text, apply filters and effects, and share their content on various social media platforms.", "actions": [["The user adds music, text, and transition effects to videos.", ["music preferences", "text content", "transition preferences", "videos"]], ["The user makes smooth slow motion videos.", ["videos", "preferred speed", "editing preferences"]], ["The user creates video collages.", ["videos", "photos", "music preferences"]], ["The user blurs the background of videos.", ["videos", "privacy preferences"]], ["The user edits pictures and selfies.", ["pictures", "selfies", "editing preferences"]], ["The user removes backgrounds from photos/videos.", ["photos", "videos"]], ["The user adds filters and adjusts HSL to pictures.", ["pictures", "editing preferences"]], ["The user experiences AI Body Effects with instant presets.", ["photos", "videos", "body measurements", "chosen presets"]], ["The user utilizes Auto Captions powered by AI for speech-to-text.", ["audio recordings", "speech data"]], ["The user removes backgrounds of videos/photos with AI.", ["videos", "photos", "backgrounds"]], ["The user trims/merges video clips.", ["video clips", "editing preferences"]], ["The user reverses videos.", {"Personal data": ["videos"]}], ["The user adds text, emoji, and stickers to videos.", ["text", "emoji", "stickers", "videos"]], ["The user adds music, sound effects, and voice-overs to videos.", ["music preferences", "sound effects preferences", "voice preferences"]], ["The user adjusts video and photo ratios.", ["videos", "photos", "aspect ratios"]], ["The user controls video speed and adds speed ramping.", ["videos", "speed settings", "speed ramping preferences"]], ["The user edits keyframes for custom animations.", ["animation keyframes", "animation styles", "design preferences"]], ["The user edits green screen videos with Chromakey.", ["videos", "green screen footage", "editing preferences"]], ["The user creates multi-layered videos with Picture-in-Picture.", ["videos", "editing preferences", "preferred layout", "content selection"]], ["The user blends videos with mixtures.", ["videos", "mixtures", "editing preferences"]], ["The user picks colors on the screen and applies them.", ["color preferences", "design choices"]], ["The user applies cinematic filters and adjusts video effects.", ["videos", "cinematic filters", "video effects"]], ["The user uses unique effects like Glitch, Fade, Noise, etc.", {"Personal data": ["preferred effects", "creativity preferences"]}], ["The user applies AI effects such as Clone and stroke.", ["images", "AI effects used", "preferences"]], ["The user adds backgrounds to photos.", ["photos", "backgrounds"]], ["The user adds stickers and memes to photos.", ["photos", "stickers", "memes"]], ["The user creates photo collages with stylish layouts.", ["photos", "collages", "stylish layouts"]], ["The user adjusts video ratios for different social media posts.", {"Personal data": ["social media platforms used", "video ratios preference", "video content preferences"]}], ["The user exports videos in custom resolutions.", ["videos", "custom resolutions"]], ["The user shares daily life on social media platforms.", ["photos", "videos", "location information", "activities", "interests"]], ["The user creates basic and advanced videos like collages and slow motion.", ["videos", "editing preferences", "video styles"]], ["The user shares vlogs on social media.", ["vlogs", "personal experiences", "interests", "social media platform"]], ["The user subscribes to the InShot YouTube channel for tutorials and tips.", ["YouTube channel subscriptions", "video editing interests"]]]}, {"summary": "The mobile app is designed to cater to citizens' health needs, offering access to a wide range of health information and services, including vaccine records, prescriptions, allergy information, exam requests, health measurements tracking, teleconsultations, and medication renewal requests.", "actions": [["The user accesses a wide range of health information through the app.", ["health information", "search history", "symptoms", "medical conditions"]], ["The user can view their Vaccination Record, Prescriptions, Allergies, and Examination requests.", ["vaccination record", "prescriptions", "allergies", "examination requests"]], ["The user can record specific health measurements such as Blood Sugar, Blood Pressure, and Body Mass Index.", ["health measurements", "Blood Sugar", "Blood Pressure", "Body Mass Index"]], ["The user can participate in Teleconsultations through the app.", ["health information", "appointment details", "medical history", "contact information"]], ["The user can request the renewal of their Regular Medication via the app.", ["type of medication", "prescription details", "health condition", "doctor's information"]]]}, {"summary": "The mobile app allows users to download, install, and activate to receive a virtual Moja Biedronka card, higher discounts, and plenty of fun, making grocery shopping easier with faster access to promotions, including features such as virtual card scanning at checkout, browsing digital flyers, personalized offers based on previous purchases, Shakeomat for special discounts, price scanning, store selection, quick BLIK payments, purchase history tracking, and customer service contact.", "actions": [["The user downloads, installs, and activates the app to receive a virtual Moja Biedronka card, higher discounts, and lots of fun.", ["location data", "email address", "phone number", "payment information"]], ["The app makes grocery shopping easier and faster by providing support for promotions.", ["shopping preferences", "location data", "purchase history", "preferences for certain brands"]], ["The user scans the virtual Moja Biedronka card at the checkout to activate discounts and save more.", ["loyalty card information", "purchase history", "discounts applied"]], ["The app remembers the user's previous grocery purchases and prepares attractive proposals based on those preferences.", ["grocery purchases", "preferences"]], ["Users can scan product barcodes with the app to check prices and product availability instantly.", ["product barcodes", "purchase history", "location data"]], ["The user selects their preferred Biedronka store using the 'My Store' feature to check product availability and store hours.", ["location", "preferred store", "product preferences", "store hours"]], ["The app stores the user's purchase history with the Moja Biedronka card for easy tracking and monitoring.", ["purchase history", "Moja Biedronka card information", "tracking data"]], ["Users can quickly contact the Customer Service Department through the app for complaints, questions, or suggestions.", ["contact information", "complaints", "questions", "suggestions"]]]}, {"summary": "The mobile app is a versatile all-in-one remote control that can operate multiple devices, including various smart TVs and other home entertainment systems, offering convenience and simplicity for controlling TV functions through wifi, infrared, or Bluetooth connections, as well as providing customizable features and a voice control option.", "actions": [["The user sets up their favorite channels and features on the programmable remote control.", ["favorite channels", "preferred features"]], ["The user customizes the remote control to fit their specific needs and preferences.", ["settings", "preferred channels", "volume control preferences", "button layout preferences"]], ["The user controls the TV using voice commands with the voice remote control feature.", ["voice commands", "TV usage habits"]], ["The user casts video, Youtube, photo, and online images to the smart TV using special functions like Screen Mirroring, Smart Sharing, and Screencast.", ["videos", "YouTube account information", "photos", "online images", "smart TV details"]], ["The user controls the TV from anywhere using the universal remote control app on their smartphone or tablet.", ["TV preferences", "device type (smartphone/tablet)", "location data"]]]}, {"summary": "The mobile app helps users find and navigate to parking lots in various cities, providing information on occupancy, amenities, pricing, and payment options, allowing for convenient payment and remote session extension, with plans to expand to more cities and add new features over time.", "actions": [["The user stores their car plate number and payment card securely in their user profile on the app.", ["car plate number", "payment card information"]], ["The user pays for parking directly from their mobile using the stored payment card details.", ["payment card details", "location data"]], ["The app notifies the user about the expiring parking session 15 minutes before, allowing them to prolong it remotely.", ["location data", "parking session details"]], ["The user scans their paper parking ticket at selected off-street parking lots and pays the parking fee using the app.", ["parking ticket information", "location data", "payment information"]]]}, {"summary": "The mobile app is Europe's leading train and bus app where you can easily book train tickets, compare fares for various European rail lines, buy bus tickets, and plan international trips across 45 countries.", "actions": [["The user books train tickets and cheap bus travel for their journey.", ["travel itinerary", "payment information", "travel dates", "preferred seats"]], ["The user compares train and bus options from 260 companies to find the right tickets.", ["travel preferences", "location", "payment information"]], ["The user checks live train times to ensure they don't miss their train.", ["location", "train schedules", "travel plans"]], ["The user buys tickets using various payment methods such as Amex, Apple Pay, and PayPal.", ["payment methods", "transaction details"]], ["The user adds loyalty and discount cards to get benefits on cheap tickets for rail services.", ["loyalty cards", "discount cards", "rail services", "travel preferences"]], ["The user books tickets in advance or on the day of travel up to 15 minutes before departure.", ["travel dates", "departure times", "destination", "payment information"]], ["The user downloads the Trainline app to access live train times and book tickets.", {"Personal data": []}], ["The user follows Trainline on social media platforms like Facebook, Twitter, and Instagram.", ["social media platforms", "followed accounts"]]]}, {"summary": "The mobile app allows users to explore billions of Pins from around the world, save, organize, and share ideas, shop for products, access daily DIY tutorials, find home decor inspiration, discover tattoo ideas, connect with a worldwide creative community, and offers business features for brands to engage with customers.", "actions": [["The user explores billions of Pins from around the world to discover new ideas every day.", ["interests", "location data", "search history", "device information"]], ["The user saves, organizes, and shares their favorite Pins to easily find and revisit them.", ["saved Pins", "organization preferences", "sharing preferences"]], ["The user sends Pins to friends or shares them in messages to spread inspiration.", ["Pins", "shared inspiration", "friend connections"]], ["The user uploads images to the Pinterest app to create their own Pins.", ["images", "interests", "creative preferences"]], ["The user browses through a daily discovery feed filled with their favorite things.", ["interests", "preferences", "search history"]], ["The user connects with stores and innovators that match their aesthetic preferences.", ["aesthetic preferences", "shopping habits", "product interests", "preferred brands"]], ["The user shops for various items like house plants, fashion pieces, and kitchenware directly from their feed.", ["shopping preferences", "interest in house plants", "fashion style", "kitchenware preferences"]], ["The user discovers quick DIY video tutorials in their feed to learn something new daily.", ["DIY video tutorials", "interests in learning new skills", "preferred learning methods"]], ["The user organizes videos into boards and saves DIY ideas for future projects.", ["videos", "DIY ideas", "projects", "interests"]], ["The user explores home decor ideas to inspire their next DIY project and learns how to transform their space with design and storage solutions.", ["home decor ideas", "DIY projects", "design solutions", "storage solutions"]], ["The user finds tattoo inspiration for various styles and follows famous tattoo artists.", ["tattoo inspiration", "tattoo styles", "famous tattoo artists"]], ["The user connects with a worldwide creative community and takes inspiration from creators worldwide.", ["location", "creative interests", "inspiration sources"]], ["The user searches for people or businesses that inspire them and collaborates with others on Pinterest to grow their creative network.", ["search queries", "collaborations", "creative interests"]], ["The user explores using Pinterest for business purposes, setting up shop, and engaging with customers.", ["business information", "products or services offered", "customer engagement data", "marketing strategies"]], ["The user syncs information from their website to image and video Pins to provide customers with more product details.", ["website information", "image and video Pins", "product details", "customer preferences"]], ["The user creates image and video Pins to showcase their brand and stand out from competitors.", ["images", "videos", "brand identity", "competitors' strategies"]]]}, {"summary": "The mobile app inCarDoc Pro is a comprehensive car diagnostics tool that reads real-time and stored diagnostics parameters from ECU of OBD-II compliant cars, offering features such as fault codes scanning, fuel economy tracking, and GPS parameters recording.", "actions": [["The user reads Check Engine codes and diagnostics parameters from their car's ECU using the app.", ["vehicle information", "engine diagnostics data"]], ["The app supports multiple OBD-II compliant cars and OBD scanner compatibility.", ["car make", "car model", "car year", "OBD-II scanner compatibility"]], ["The app records and displays multiple parameters in real time.", ["location data", "health data", "activity data", "device information"]], ["The user can track their car's fuel economy and consumption using the Trip Computer mode.", ["car make and model", "fuel consumption data", "driving habits", "location data"]], ["The app allows users to store and share diagnostics data for professional service/repair assistance.", ["diagnostics data", "vehicle information", "location", "contact information"]]]}, {"summary": "The mobile app offers a personalized feed of short videos in various categories, allowing users to engage with content, create their own videos with effects and music, and be entertained by a global community of creators.", "actions": [["The user watches short-form videos on TikTok.", ["watched videos", "liked videos", "interaction history"]], ["The user engages with videos they like on TikTok.", {"Personal data": ["liked videos", "engagement history", "preferences", "device information"]}], ["The user skips videos they don't like on TikTok.", ["video preferences", "content preferences"]], ["The app provides a personalized video feed based on the user's preferences.", ["video preferences", "watch history"]], ["The user explores different types of videos on TikTok.", ["videos", "viewing preferences", "engagement levels", "trending content"]], ["The user can pause recording multiple times in one video on TikTok.", ["videos", "recording habits", "preferred editing style", "usage patterns"]], ["The user is entertained and inspired by a global community of creators on TikTok.", ["videos", "user interactions", "preferences", "location data"]], ["The user adds their favorite music or sound to their videos for free on TikTok.", ["favorite music", "sounds", "videos", "music preferences"]], ["The user expresses themselves with creative effects on TikTok.", ["videos", "creative effects", "filters", "music preferences"]], ["The user edits their own videos using integrated tools on TikTok.", {"Personal data": ["videos", "editing preferences", "engagement with specific features", "device information"]}]]}, {"summary": "The mobile app is a multifunctional security and account management application with features such as Scan QR 2FA, Backup & Sync, Password Manager, Autofill, Unlock with Master Password and Touch ID, Dark Mode, Credit Card Note, Vital Identification, Import and Export Data, and Data Storage on Cloud, ensuring safe protection and efficient management of accounts.", "actions": [["The user scans QR codes to enable two-factor authentication for their accounts.", ["account information", "QR codes"]], ["The user unlocks the app using a Master Password or Touch ID to prevent unauthorized access.", ["Master Password", "Touch ID"]], ["The user imports data from various Authenticator apps for flexibility in managing accounts.", ["account information", "authentication codes", "app usage data"]], ["The user utilizes the Dark Mode feature for comfortable usage in low-light environments.", ["Dark Mode preference", "usage environment", "device type"]], ["The user stores sensitive information like credit card details and vital identification securely.", ["credit card details", "vital identification"]]]}, {"summary": "The mobile app helps manage diabetes by adjusting insulin doses based on carb intake through targeting, estimating, and knowing the carb content of various foods.", "actions": [["The user uses the tool to manage their diabetes.", ["blood sugar levels", "insulin dosage", "dietary habits", "exercise routine"]], ["The app helps the user target carbohydrate-rich foods.", ["dietary preferences", "health goals", "food interests", "activity level"]], ["The app assists the user in estimating the weight of foods.", ["food items", "weight estimates", "dietary preferences"]]]}, {"summary": "The mobile app offers smart shopping features such as voice search, product scanning, sharing product links, and saving shopping ideas, with access to over 60,000 products, secure payment options, and the ability to find nearby shopping centers with their contact information and opening hours.", "actions": [["The user searches for desired products quickly and conveniently.", ["search queries", "purchase history", "location data", "device information"]], ["The user scans products to find out the prices in Senukai.", {"Personal data": ["scanned products", "location", "purchase interests"]}], ["The user shares a product link via Facebook or SMS message.", ["product link", "social media activity", "contact information"]], ["The user saves ideas for future shopping.", {"Personal data": ["shopping preferences", "wish list items", "budget constraints"]}], ["The user shops among more than 60,000 products.", ["shopping history", "product preferences", "purchase history", "payment information"]], ["The user searches for the nearest shopping centers.", ["location data", "search query", "shopping preferences"]]]}, {"summary": "The mobile app serves as a digital administration assistant, allowing users to receive, manage, and securely store important documents from various companies, as well as enabling easy payment, signing, and sharing of documents, all while offering free services and convenience.", "actions": [["The user creates a personal Doccle account.", ["name", "email", "address", "phone number", "identification documents"]], ["The user adds companies whose documents they want to receive digitally.", ["company names", "document preferences"]], ["The user uploads their own documents.", ["documents"]], ["The user receives, manages, and stores documents from different companies together.", ["documents", "company names", "financial information", "contact details"]], ["The user receives notifications every time a new document is available.", ["notifications", "new documents"]], ["The user has permanent access to all their important documents.", ["important documents"]], ["The user receives payment reminders when the due date approaches.", ["due dates", "amounts owed", "payment history"]], ["The user adds important documents themselves by uploading from mail, cloud, or internal storage.", ["documents", "email address", "cloud storage account", "device internal storage"]], ["The user forwards documents to other people or to their accountant.", {"Personal data": ["documents", "email addresses"]}]]}, {"summary": "The mobile app is a comprehensive office suite that includes word processing, PDF viewing and editing, spreadsheet capabilities, AI features like content generation and rewriting, as well as cloud storage options and collaborative tools for seamless document management on Android devices.", "actions": [["The user edits slides on their Android device.", ["slides", "Android device information"]], ["The user converts spreadsheets on their Android device.", ["spreadsheets", "device type"]], ["The user views documents anytime, anywhere.", ["documents", "viewing habits", "device information"]], ["WPS AI provides AI-generated content like meeting summaries and event planning.", ["meeting summaries", "event planning", "work-related data"]], ["WPS AI provides insights for any scanned document.", ["scanned documents"]], ["The user uses templates to edit various types of files.", ["file types", "editing preferences"]], ["The user converts and processes documents, PDFs, and images.", ["documents", "PDFs", "images"]], ["The user creates, edits, shares files, and collaborates in real-time with others.", ["files", "collaborators", "edits", "shared content"]], ["The user scans, views, edits, and converts PDFs on their Android device.", ["PDFs", "scanned documents", "edited documents"]], ["The user annotates, signs, extracts/splits, merges PDFs.", ["PDFs", "signatures", "annotations"]], ["The user adds and deletes watermarks in PDFs.", ["PDFs", "watermarks"]], ["The user manages documents using WPS Cloud, synchronizes on mobile phones and computers, and accesses/edit office documents.", ["documents", "synced devices", "office documents"]], ["The user saves documents to third-party clouds like Dropbox, Google Drive, Box, Evernote, and OneDrive.", ["documents", "cloud storage preferences"]], ["The user utilizes 1G free cloud storage, supports online editing and sharing of files, and builds/joins cloud teams.", {"personal_data": ["files", "cloud storage usage", "online editing activities", "cloud team memberships"]}], ["The user shares office documents via various methods like WIFI, NFC, DLNA, email, instant messaging, and social media.", ["office documents"]]]}, {"summary": "The mobile app inCarDoc Pro is a comprehensive diagnostics tool for OBD-II compliant cars, offering real-time and stored diagnostics parameters, fault code reading and clearing, fuel economy tracking, GPS parameters, and more, with features including real-time parameter recording, extended widgets, and the ability to upload data to a server.", "actions": [["The user views recorded parameters traces and GPS traces for their car.", {"Personal data": ["car model", "car performance data", "GPS location data"]}], ["The app allows for real-time engine and vehicle OBD2 parameters readings from car's sensors.", ["location", "vehicle identification number (VIN)", "engine temperature", "fuel level", "speed", "engine RPM", "odometer reading"]], ["The user tracks their car's fuel economy and consumption using the Trip Computer mode.", ["car make and model", "fuel consumption data", "driving habits", "location data"]], ["The app enables the user to store and share diagnostics data when seeking professional service/repair assistance.", ["device information", "error logs", "location data", "service/repair history"]], ["The app supports logbook notes for fueling, service records, car maintenance, and diagnostics.", ["vehicle information", "fueling history", "service records", "maintenance activities", "diagnostic information"]], ["The user can use custom configurations for non-standard parameters and protocols for their car.", ["car make and model", "preferences for custom configurations", "location data"]], ["The app warns against running multiple OBD-II reading apps simultaneously to avoid connection issues.", ["OBD-II reading apps", "connection issues"]]]}, {"summary": "The mobile app offers hundreds of top films and series without ads, the best Slovak programs before TV, attractive live and recorded sports, and exclusive VOYO Originals.", "actions": [["The user enjoys hundreds of top movies and series without ads.", ["movie preferences", "series preferences", "watch history", "age range"]], ["The user watches the best Slovak programs before they air on TV.", ["viewing habits", "TV program preferences", "watch history", "time zone"]], ["The user experiences live and recorded attractive sports content.", ["sports preferences", "viewing history", "device information"]]]}, {"summary": "The mobile app is a painting simulator for gaming and tabletop miniatures, offering photorealistic results with a four-step painting process, built-in miniatures and colour palettes, complement recommendation mode, shopping list generator, colour mixer and creator tools, and a randomiser feature.", "actions": [["The user selects a miniature image to paint from a variety of options.", ["painting preferences", "artistic style", "color preferences"]], ["The user paints the selected miniature image using colors they own or wish to purchase.", ["miniature image", "colors owned", "colors wished to purchase"]], ["The system simulates a four-step painting process: base coloring, layering, shading, and highlighting.", ["artistic preferences", "painting techniques", "color preferences", "skill level"]], ["The app provides access to built-in miniatures from Artel 'W'.", ["art preferences", "miniature preferences"]], ["The user can access miniature template and color palette downloadable content (DLCs) that update with new content for free.", ["template preferences", "color palette preferences"]], ["The app features a complement recommendation mode that automatically applies harmonizing layer, shade, and highlight paints based on a selected base color.", ["selected base color"]], ["The user can customize the automatically applied harmonizing paints.", ["color preferences", "painting style", "room decor preferences"]], ["The app provides a photorealistic simulation of the applied paints.", ["paint colors", "painting techniques", "artistic preferences"]], ["The app generates a shopping list of applied colors with corresponding shop page links.", ["applied colors", "shop page links"]], ["The app includes a color mixer tool for mixing predefined paints in multiple steps.", ["color preferences", "mixing ratios", "paint choices"]], ["The app features a color creator tool for creating and collecting custom colors.", ["custom colors", "color preferences"]], ["The app offers a randomizer tool to randomly distribute colors across a model.", ["color preferences", "model type"]]]}, {"summary": "The mobile app allows users to create and save multi-track music projects on their Phone, Tablet, or Chromebook, featuring audio recording, sample browsing, effects modules, synthesizers, drum kits, MIDI controller support, mixer functions, and various included content for music production.", "actions": [["The user creates and saves complete multi-track music projects on their Phone, Tablet, or Chromebook.", ["music projects", "device information"]], ["The user records, sequences, edits, mixes, and renders complete songs.", ["music creations", "preferred genres", "instruments used", "mixing preferences"]], ["The app provides audio recording and track-length stem/wav import features.", ["audio recordings", "track-length stems/wav files"]], ["The user browses samples and presets with previews.", ["sample preferences", "preset preferences", "audio previews"]], ["The app includes effects modules for various audio effects.", ["audio preferences", "usage of audio effects"]], ["The app includes instrument modules.", ["musical instrument preferences"]], ["The user can save and load WAV, MP3, AAC, FLAC, and MIDI files.", ["audio files", "music preferences"]], ["The user can share their songs via Wi-Fi or Cloud to other Mobile 3 installations.", ["songs", "Wi-Fi network information", "Cloud account details"]], ["The app allows the user to configure the user interface with all screen resolutions and sizes.", ["screen resolutions", "screen sizes"]], ["The app has a virtual piano-keyboard and Drumpads for music creation.", ["music interests", "instrument preferences"]], ["The app includes in-app purchases for the DirectWave sample player.", ["purchase history", "payment information", "device type", "app usage data"]], ["The user can install their own samples without needing to buy additional content.", ["user-generated samples", "purchased content"]], ["Included MiniSynth presets in the app are Bass, Keys, Leads, Pads, SFX, and Synths.", {"Personal data": []}], ["The app requires Location permission for Bluetooth Low Energy connectivity.", ["location data"]], ["Users can register and visit the FL Studio mobile forum for support and bug reporting.", ["email address", "username", "IP address", "device information"]], ["The app notes the popularity of the 'FL Studio' desktop PC version and its availability on Windows, Android, and iOS.", ["music production software preferences", "operating system preferences"]], ["Custom ROMS and Rooted Devices are not supported by the app.", {"Personal data": []}]]}, {"summary": "The mobile app allows users to check the PKP train timetable, purchase tickets easily and securely from various Polish railway operators without additional fees, and access purchased tickets offline with no need to wait in line.", "actions": [["The user checks ticket prices for various railway operators in Poland.", ["location (Poland)", "travel interests", "search history"]], ["The user accesses purchased tickets offline and receives copies via email.", ["purchased tickets", "email address"]], ["The user selects from various payment methods like KOLEO account, card, BLIK, and GPay.", ["payment methods", "financial information"]], ["The app ensures tickets are sold at the same price as at ticket offices.", ["ticket prices"]]]}, {"summary": "The mobile app is a gamified tool designed to help sailors of all levels learn about buoys and includes detailed information on various types of buoys for maritime education.", "actions": [["The user learns about buoys through gamification.", ["knowledge about buoys", "game progress", "learning preferences"]], ["The user can use the app for maritime education and as a refresher for experienced sailors.", ["nautical knowledge", "level of experience"]], ["The app contains an index with detailed information on buoys including appearance, light, and chart abbreviations.", {"personal_data": []}], ["The app can be used in real-time while sailing to check a buoy.", ["location data", "sailing route", "buoy locations", "weather conditions"]]]}, {"summary": "The mobile app allows you to search, download, and play high-quality music offline for free, offering a wide variety of songs and a stylish music player for a seamless listening experience.", "actions": [["The user searches for music to download for offline listening.", ["music preferences", "offline listening habits"]], ["The user downloads high-quality music for free.", ["music preferences", "device information"]], ["The user listens to music online and offline.", ["music preferences", "listening history", "device information"]], ["The user searches, listens to, and downloads free music without internet connection.", ["music preferences", "downloaded music", "search history", "device information"]], ["The user enjoys using the music downloader app.", ["music preferences", "downloaded music", "listening habits"]], ["The user finds and listens to music online and offline with the music downloader app.", ["listening history", "music preferences", "device information"]], ["The user downloads music with high sound quality using the fastest song download app.", ["music preferences", "download history", "device information"]], ["The user uses the app to browse, play, and download mp3 music freely.", ["music preferences", "download history"]], ["The user uses the music player offline to listen to downloaded music.", ["music preferences", "downloaded music"]], ["The user streams online music with the music player app.", ["music preferences", "listening history", "device information"]]]}, {"summary": "The mobile app features a watch face design inspired by the A-10 Thunderbolt aircraft, incorporating elements such as twin engines, cockpit hints, steps dial, watch battery dial, date, day dial, multifunctional outer bezel, and customizable color theme.", "actions": [["The user customizes the watch face color theme by pressing and holding the watch face.", ["watch face color theme", "user preferences"]], ["The user gives feedback or reports issues by sending an email to support@facer.io.", ["email address", "feedback", "reported issues"]], ["The user appreciates the watch faces by leaving a positive review if they are enjoying them.", ["watch faces", "review feedback", "enjoyment level"]]]}, {"summary": "The mobile app offers exclusive deals on a wide selection of products including fashion, home decor, beauty, and more, with free delivery and returns within 90 days.", "actions": [["The user shops for exclusive offers on Temu.", ["shopping preferences", "purchase history", "location", "payment information"]], ["The user enjoys free delivery on Temu.", ["location", "purchase history", "delivery address"]], ["The user enjoys free shipping and returns within 90 days on Temu.", ["purchase history", "shipping address", "return history"]]]}, {"summary": "The mobile app serves as a virtual birth partner, offering coaching through breathing techniques, guided meditation, positive affirmations, and visualizations to help you relax and track your surges during labor, while also providing support in pregnancy and post-birth.", "actions": [["The user uses the Freya app to track and log their surges during labor.", ["surge data", "labor progress", "medical history", "health data"]], ["The user listens to coaching audio provided by Freya to focus on breathing through each surge.", ["coaching audio", "breathing techniques", "focus practices"]], ["The user engages in a gentle expanding visualization to synchronize breathing with Freya's guidance.", ["breathing patterns", "guided visualization preferences", "mental state"]], ["The user accesses a detailed log of their surges over time to monitor progress through labor.", ["surges", "progress", "labor"]], ["The user shares the surge log with their birth partner, midwife, or doula.", ["birth partner", "midwife", "doula", "surge log"]], ["The user listens to guided relaxations, positive affirmations, and soothing visuals to stay calm and relaxed during labor, making birth easier and quicker.", ["guided relaxations", "positive affirmations", "soothing visuals", "labor process", "birth experience"]], ["The user has the option to share their birth story via a personalized birth announcement.", ["birth story", "personalized birth announcement", "baby's name", "baby's birth date"]], ["The user can customize the guided relaxation playlist by skipping, reordering, or removing tracks to listen to their preferred content.", ["guided relaxation playlist", "skipped tracks", "reordered tracks", "removed tracks", "preferred content"]], ["The user downloads the Freya app to benefit from hypnobirthing-friendly features and prepare for childbirth.", ["expecting a child", "interest in hypnobirthing", "childbirth preparation", "health information"]], ["The user feels supported and guided by Freya throughout the birthing process.", ["emotional state", "medical history", "support preferences", "birthing plan"]]]}, {"summary": "The mobile app serves as an all-in-one health and fitness companion, offering features such as activity tracking for over 100 sports, route mapping for running, sharing workout journeys with friends and family, and detailed health statistics displayed in dynamic graphs.", "actions": [["The user keeps track of their health journey by using the Huawei Health app.", ["health data", "fitness activities", "medical conditions", "sleep patterns"]], ["The user shares their outdoor workout routes with friends and family by generating videos with music through the app.", ["workout routes", "videos", "music preferences", "location data"]], ["The user sees detailed health stats, including heart rate, weight, sleep quality, and step count, in clear graphs using the Huawei Health app.", ["heart rate", "weight", "sleep quality", "step count"]], ["The app synchronizes weight data with healthkit when using healthy weight data from Huawei mobile phones.", ["weight data", "health data", "device information"]], ["The app automatically synchronizes exercise data recorded in Huawei Health with healthkit.", ["exercise data", "health data", "device information", "synchronization preferences"]], ["The user can review more information about the app on the official website or contact support through email.", {"Personal data": ["email address"]}]]}, {"summary": "The mobile app provides support for CHROMECAST, XTREAM-CODES API, automatic live stream reconnection, EPG XMLTV format, parental control, multiple themes, built-in player for various formats, and dynamic language switching among 31 languages, catering to advanced IPTV solutions for live and non-live TV/stream.", "actions": [["The app supports XTREAM-CODES API for automatic live and VOD playlist including EPG and movie info.", {"personal data": []}], ["The app supports automatic live stream reconnection.", ["user ID", "IP address", "location data", "device information"]], ["The app supports parental control.", {"Personal data": ["parental preferences", "child's age", "content restrictions", "usage restrictions"]}], ["The app supports multiple themes.", ["theme preferences"]], ["The app's built-in player supports embedded subtitle and external subtitle formats.", ["subtitle preferences"]], ["The app supports dynamic language switching with 31 languages.", ["preferred language", "language settings"]]]}, {"summary": "The mobile app offers a personalized fashion experience with a wide range of brands and exclusive collections, allowing users to shop anytime, anywhere, receive vouchers and offers, and keep track of their wishlist across all devices.", "actions": [["The user gets their personalised fashion experience in the ABOUT YOU app.", ["clothing preferences", "style preferences", "size measurements", "favorite brands"]], ["The user discovers a wide range of brands and exclusive collections and content.", ["brand preferences", "shopping habits", "interests in exclusive content"]], ["The user shops from anywhere and anytime in the app.", ["shopping history", "payment information", "shipping address", "product preferences"]], ["The user never misses out on vouchers and offers in the app.", ["location", "shopping preferences", "purchase history", "email address"]], ["The user is inspired by their favorite brands' fashion updates in the discovery area.", ["favorite brands", "fashion updates", "discovery preferences"]], ["The user finds all the brand new trends, offers, and stars that interest them.", ["interests", "trends", "offers", "celebrities"]], ["The user follows current styles and trends of their favorite brands to always stay up to date.", ["favorite brands", "current styles", "trends", "fashion preferences"]], ["The user finds styles that suit them with just one click.", ["preferred styles", "body measurements", "shopping preferences"]], ["The user receives vouchers and offers automatically on their smartphone.", ["location data", "purchase history", "shopping preferences", "device information"]], ["The user discovers new fashion trends for women, men, and kids from a big assortment of top brands.", ["fashion trends", "gender", "age group", "brand preferences"]], ["The user never again misses out on current offers from popular brands.", ["shopping preferences", "brand preferences"]], ["The user keeps track of things and adds products to their wishlist.", ["products", "wishlist items"]], ["The user shops flexibly by syncing their shopping bag across all their devices.", ["shopping bag items", "device information"]], ["The user receives free returns in case they want to send back an item.", ["purchase history", "item details", "return reasons", "refund preferences"]], ["The user is impressed by the high-quality workmanship and the best materials of all the bargains they buy online at ABOUT YOU.", ["shopping habits", "product preferences", "impression towards quality", "online shopping history"]], ["The user is guaranteed to find their favorite brand and individual favorite pieces from various brands in the app.", ["favorite brand", "favorite pieces", "brand preferences"]]]}, {"summary": "The mobile app offers a variety of small, single-task tools designed to assist neurodivergent individuals with overwhelming or difficult tasks, with features such as a Magic Todo list, The Formalizer, The Judge, The Estimator, The Compiler, The Chef, and more, with proceeds supporting the free and ad-free website goblin.tools.", "actions": [["The user utilizes the Formalizer tool to transform their language to be more formal, sociable, concise, or other options.", ["language style preferences"]], ["The user engages with the Judge tool to interpret tone.", ["text input", "tone interpreted"]], ["The user interacts with the Compiler tool to turn braindumps into actionable tasks.", ["braindumps", "actionable tasks"]], ["The user engages with the Chef tool to turn descriptions of ingredients and tools in their kitchen into recipes.", ["ingredient descriptions", "kitchen tools", "recipe preferences"]], ["The app offers various tools designed to help neurodivergent individuals with overwhelming or difficult tasks.", ["neurodivergent status", "specific challenges", "preferred tools or strategies", "sensory sensitivities"]], ["The app provides support for multiple tools and functionalities to assist users in various tasks.", ["usage data", "device information", "preferences", "user settings"]]]}, {"summary": "The mobile app lets you explore life on the farm, from tending to animals and crops to turning your harvest into food, all while creating original videos of your farm stories.", "actions": [["The user tends to the animals in the barn by feeding them and cleaning up their poop.", ["animal feeding habits", "barn location", "types of animals", "cleaning preferences"]], ["The user heads to the house to have a meal and then grabs their banjo for an impromptu jam session.", ["meal preferences", "musical instrument preferences"]], ["The user goes out to the field to tend to their crops and harvest their produce.", ["location", "crop types", "harvested produce"]], ["The user plants seeds and learns how to make them grow.", ["gardening interests", "plant types", "growth techniques", "learning progress"]], ["The user uses the food machine to magically turn raw ingredients into food.", ["food preferences", "allergies", "dietary restrictions"]], ["The user creates an original video using the in-app recording feature.", ["videos", "audio recordings", "visual content", "location data"]], ["The user helps the vet check the animals and cleans up different types of animal poop.", ["animal types", "health status of animals", "types of animal poop", "volunteer activity"]], ["The user uses the tractor's different functions to farm faster and turns their harvest into food using the food machine.", ["location data", "agricultural data", "food preferences"]]]}, {"summary": "The mobile app is a comprehensive tool to track blood pressure trends, provide lifestyle tips, and offer information on blood pressure ranges, helping users monitor their health effectively.", "actions": [["The user tracks their blood pressure information using the app.", ["blood pressure information"]], ["The user views their blood pressure trends and ranges.", ["blood pressure data", "health trends"]], ["The user receives lifestyle tips for their health from the app.", ["health information", "lifestyle habits", "fitness goals", "dietary preferences"]], ["The user exports their blood pressure trends for medical appointments.", ["blood pressure trends", "medical appointments"]], ["The user contacts support for more information about blood pressure.", ["blood pressure information", "contact details"]]]}, {"summary": "The mobile app is a watch face supporting Wear OS devices with API Level 28+, featuring various customizable options and features such as color change, animation, custom widgets, and more, with additional news and promotions available on multiple platforms.", "actions": [["The user installs the watch face by following the provided instructions.", ["watch face preferences", "installation data"]], ["The user customizes the watch face settings and recommendations.", ["watch face settings", "recommendations"]], ["The user turns off the Christmas tree image display option.", ["display preferences"]], ["The user interacts with the watch face elements like analog time, digital time, date, day of the week, month, step counter, heart rate, and battery charge.", ["analog time", "digital time", "date", "day of the week", "month", "step counter", "heart rate", "battery charge"]], ["The user follows news and promotions through various social media platforms like Facebook, Instagram, and Telegram.", ["news", "promotions", "social media platforms used", "interests"]]]}, {"summary": "The mobile app is an all-in-one solution for syncing contacts, calendars, and tasks using CalDAV, CardDAV, and WebDAV, compatible with various servers such as Nextcloud, iCloud, and Synology, with secure and private functionality.", "actions": [["The user can access their WebDAV files and work with remote storages seamlessly through the app.", ["files", "storage locations", "file interactions", "device information"]], ["The user can manage options within the app such as creating and deleting new calendars, address books, and to-do lists.", ["calendars", "address books", "to-do lists"]]]}, {"summary": "The mobile app allows users to easily book beauty, health, and fitness treatments with over 14,000 specialists across Sweden, providing options to filter by popularity, distance, and more, manage and pay for bookings, and access verified customer reviews.", "actions": [["The user books a treatment through the app.", ["treatment type", "booking date/time", "location preference", "payment information"]], ["The user finds specialists in beauty, health, and fitness.", ["location", "beauty preferences", "health concerns", "fitness goals"]], ["The user reads customer reviews to make decisions.", ["customer reviews", "purchase decisions"]], ["The user searches for treatments based on location.", ["health conditions", "location"]], ["The user manages and pays for bookings within the app.", ["booking details", "payment information", "contact information"]], ["The user pays for treatments using Klarna.", ["payment information", "treatment details", "transaction history"]], ["The user receives directions, contacts specialists, and writes reviews.", ["location data", "contact information", "reviews"]], ["The user saves favorite places for future bookings.", ["favorite places", "booking preferences"]]]}, {"summary": "The mobile app is the ultimate tool for seeing the Northern Lights, providing real-time information on aurora visibility, solar winds, best viewing locations, and tour recommendations, all with a sleek design and push notifications for high auroral activity.", "actions": [["The user finds the current KP index and likelihood of seeing the Northern Lights.", ["location", "interest in astronomy"]], ["The user views a list of the best locations to view the Northern Lights from right now.", ["location preferences", "travel interests"]], ["The user accesses forecasts for the next hour, several hours, and several weeks to plan Northern Lights viewing.", ["location", "time preferences", "interest in Northern Lights", "weather forecasts"]], ["The user views solar wind statistics and sun imagery.", ["solar wind statistics", "sun imagery"]], ["The user accesses tour information for locations like Iceland, Alaska, or Canada.", ["travel interests", "destinations", "search history"]], ["The user purchases the Pro version to enjoy the app without advertisements.", ["payment information", "email address"]]]}, {"summary": "The mobile app allows users to find and book hotels, flights, rental cars, and more, offering free cancellation, 24/7 customer service, mobile-only discounts, paperless confirmation, and the ability to manage bookings on the go, all while accessing millions of accommodations, filtering options, and exclusive deals, making it a convenient and flexible tool for planning and enjoying trips.", "actions": [["The user finds great hotel or apartment deals and books in just a few minutes.", ["location", "travel dates", "number of guests", "payment information"]], ["The user books flights, rental cars, and more through the app.", ["travel dates", "destination locations", "payment information", "contact details"]], ["The user accesses 24/7 customer service in more than 40 languages.", {"personal data": ["preferred language", "location", "customer service inquiries"]}], ["The user chats directly with their property in the app.", ["messages", "property details"]], ["The user enjoys mobile-only discounts.", {"Personal data": ["location", "device type", "purchase history"]}], ["The user uses filters to easily find the perfect place out of millions of available accommodations.", ["location preferences", "budget range", "amenities preferences", "travel dates"]], ["The user manages their bookings on the go, making changes whenever and wherever they want.", ["booking details", "location information", "payment details"]], ["The user discovers local attractions and makes the most of their trip.", ["location data", "travel itinerary", "preferences for activities", "budget information"]], ["The user shares their experience and gets local advice on the Travel Communities forums.", ["travel experience", "location", "travel preferences", "local advice received"]], ["The user accesses millions of accommodations from cozy country homes to funky city apartments.", {"Personal data": ["location preferences", "accommodation preferences", "travel interests"]}], ["The user filters hotels by price, review score, WiFi quality, and other important criteria.", ["price preferences", "review score preferences", "WiFi quality preferences", "other important criteria preferences"]], ["The user searches for cheap hotels by city, attraction, landmark, or hotel name.", ["location preferences", "budget constraints"]], ["The user discovers daily accommodation deals and saves on their next booking.", ["location", "budget preferences", "booking history", "travel interests"]], ["The user stays flexible with free cancellation.", ["booking details", "contact information", "payment information", "travel dates"]], ["The user quickly books hotels at the last minute or far in advance.", ["booking history", "travel preferences", "payment information"]], ["The user books domestic or international flights on the go.", ["flight details", "payment information", "contact information", "travel preferences"]], ["The user searches thousands of airfare deals per day.", ["search history", "travel preferences", "payment information"]], ["The user books car rentals from all major companies.", ["car rental bookings", "travel dates", "pickup locations", "drop-off locations", "preferred car types"]], ["The user books great experiences online in minutes.", ["booking history", "payment information", "location data", "preferences"]], ["The user connects with fellow travelers, shares experiences, and gets local advice.", ["travel experiences", "location data", "travel preferences", "personal interests"]]]}, {"summary": "The mobile app Smart Switch allows users to transfer contacts, music, photos, messages, and more from various devices to new Galaxy devices, supporting Android, iOS, and Windows systems with specific requirements outlined for each.", "actions": [["The user downloads the Smart Switch app from the Google Play Store.", ["device information", "Google account information"]], ["The user tries to download the app again.", ["device information", "IP address", "location data"]], ["The app Smart Switch helps users transfer various data from their old device to a new Galaxy device.", ["device data", "contacts", "messages", "photos", "videos"]], ["Data that can be transferred includes contacts, calendar, messages, photos, music, videos, call logs, memos, alarms, Wi-Fi, wallpapers, documents, app data, and home layouts.", ["contacts", "calendar", "messages", "photos", "music", "videos", "call logs", "memos", "alarms", "Wi-Fi", "wallpapers", "documents", "app data", "home layouts"]], ["App data and home layouts can be sent by upgrading the Galaxy device to M OS.", {"personal_data": ["app data", "home layouts"]}], ["Smart Switch supports recent Galaxy devices and tablets from Galaxy S2 onwards.", ["device information", "Galaxy devices owned"]], ["Smart Switch also supports various other Android devices from different manufacturers.", ["device information", "manufacturer information", "Android device compatibility"]], ["Users may need to adjust Wi-Fi settings on non-Samsung devices to prevent disconnections during wireless transfers.", ["Wi-Fi settings", "non-Samsung devices", "wireless transfers"]], ["The app requires certain permissions including access to phone, call logs, contacts, calendar, SMS, storage, microphone, Bluetooth, and location.", ["phone information", "call logs", "contacts", "calendar", "SMS", "storage", "microphone", "Bluetooth", "location"]]]}, {"summary": "The mobile app offers app-only benefits to enhance the shopping experience on Amazon, providing features such as real-time tracking, 360° product views, price drop alerts, live chat support, and convenient search options like scanning items or barcodes.", "actions": [["The user browses, searches, and views product details on the app.", ["search history", "viewed products", "purchase history"]], ["The user reads reviews and purchases millions of products.", ["product reviews", "purchase history"]], ["The user receives real-time tracking and delivery notifications for their packages.", ["tracking information", "delivery notifications", "package details"]], ["The user views products from every angle with the 360° product view feature.", ["viewed products", "product preferences", "shopping habits", "device used"]], ["The user uses the 'View in your room' feature to see how items fit in their space.", ["room dimensions", "furniture items", "decor items", "room layout"]], ["The user saves items to 'Your Lists' and receives alerts for price drops.", ["saved items", "price alerts"]], ["The user accesses live chat support 24 hours a day, 7 days a week.", {"Personal data": ["name", "contact information", "conversation history"]}], ["The user uses the scan icon to find items by taking pictures or scanning barcodes.", ["photos", "scanned barcodes", "item preferences"]]]}, {"summary": "The mobile app is an innovative ad blocker for Android devices, offering a comfortable and secure browsing experience by blocking ads, malware, and trackers across all browser apps, with features like one-tap ON/OFF switch, auto switch, real-time ad block count display, and privacy protection, recommended for those seeking faster browsing, enhanced security, and reduced data usage.", "actions": [["The user toggles ad blocking on or off using the one-tap switch in the notification area, quick panel, widget, or floating switch.", ["ad blocking preferences"]], ["The user saves data usage as unnecessary ad data loading is prevented by the app.", ["data usage", "unnecessary ad data loading"]], ["Those looking to save on data usage are recommended to use Ad Blocker Pro.", ["data usage", "Ad Blocker Pro usage"]], ["Those frequently visiting ad-heavy websites are recommended to use Ad Blocker Pro.", ["browsing history", "frequency of website visits"]], ["Those seeking a simple and user-friendly ad blocking app are recommended to use Ad Blocker Pro.", {"Personal data": []}], ["The user sends a refund request via the 'Refund Request' option in the app within 8 days of purchase for a no-questions-asked refund if not satisfied.", ["purchase details", "refund request details"]]]}, {"summary": "The mobile app helps parents track and understand their baby's mental development through 10 leaps, offering personalized schedules, insights, milestones, and optional extras like a baby monitor and e-books.", "actions": [["The user tracks their baby's mental development from 0-20 months.", ["baby's age", "developmental milestones", "parent's interaction with baby"]], ["The user learns about the 10 mental leaps with tips and insights.", ["mental leaps", "tips", "insights"]], ["The user keeps a diary to monitor their baby's development and milestones.", {"personal_data": ["baby's development", "milestones"]}], ["The user gains insight into their baby's perception of the world.", ["baby's behaviors", "baby's reactions", "baby's environment"]], ["The user experiences the world through their baby's eyes.", {"Personal data": ["baby's perspective", "parenting style", "family activities"]}], ["The user purchases optional extras like additional milestones, baby monitor, E-Book, Audiobook, and music.", ["purchase history", "preferred payment method", "email address"]], ["The user manages and cancels their subscriptions in the Google Play Store settings.", ["subscription details", "payment information", "purchase history"]]]}, {"summary": "The mobile app is a customizable watch face for Wear OS devices with API Level 28+ that features 3 preset app shortcuts, 1 customizable shortcut, and 4 customizable complications for displaying various data like weather, steps, barometer, and UV index.", "actions": [["The user installs the watch face on their Wear OS device.", ["device type", "installed apps", "settings preferences"]], ["The user customizes the watch face by selecting their preferred data for complications.", ["watch face", "preferred data", "complications"]], ["The user manually measures their heart rate by tapping on the heart rate display area.", ["heart rate"]], ["The app allows the user to change the theme colors of various elements on the watch face.", ["color preferences", "watch face elements"]], ["The user explores the customizable complications feature for adding desired data to the watch face.", ["watch face complications", "desired data"]], ["The user follows the instructions to enable sensor usage for heart rate measurement on the watch face.", ["heart rate data", "physical activity data", "watch settings"]], ["The user can sign up for the newsletter to receive updates on new watch faces and promotions.", ["email address", "name", "watch face preferences"]]]}, {"summary": "The mobile app is the perfect preparation tool for the theoretical driving test, offering all official questions from TÜV | DEKRA, multiple language options, AI-based learning, exam simulation, comprehensive statistics, and various features for different driving license classes.", "actions": [["The user prepares for their theoretical driving test using the 'Führerschein GOLD' app.", ["driving test preparation", "app usage data", "personal identification information"]], ["The app guarantees access to all official questions from the currently valid question catalog.", ["question catalog", "user's interaction with questions"]], ["The app provides official translations in multiple foreign languages for the exam.", ["exam content", "foreign languages", "preferred languages"]], ["The user practices with the AI-based compilation of questions for fast learning.", ["learning preferences", "knowledge gaps", "performance data"]], ["The app offers comprehensive statistics to track learning progress.", ["learning progress", "performance data", "time spent on tasks"]], ["The user utilizes the read-aloud function for all questions, answers, and explanations in German.", ["text content in German", "preferred language settings"]], ["The user gives feedback by providing a positive rating in the Google Play Store or contacting the developers for criticism or suggestions.", ["user rating", "feedback", "contact information"]]]}, {"summary": "The mobile app offers a versatile note-taking experience with fluid handwriting, PDF annotation, audio recording, handwriting recognition, Evernote integration, dark mode, and a variety of features to enhance organization and productivity.", "actions": [["The user creates beautiful handwritten notes, checklists, annotates PDFs, and types documents in one place.", ["handwritten notes", "checklists", "annotated PDFs", "typed documents"]], ["The user experiences fluid handwriting with an array of pens and highlighters in different sizes, colors, shapes, and images.", ["handwriting style", "pen preferences", "highlighter preferences"]], ["The user chooses from many styles and formatting options for typing in the app.", ["typing styles", "formatting options"]], ["The user annotates PDFs and images by highlighting, underlining, and marking up with formatting tools.", ["PDFs", "images", "highlighted text", "annotations", "formatting preferences"]], ["The user searches handwritten notes and converts handwriting to text with handwriting recognition in 65 different languages.", ["handwritten notes", "text", "handwriting recognition data", "language preferences"]], ["The user records audio notes while taking handwritten notes, allowing for playback anytime.", ["audio notes", "handwritten notes"]], ["The app auto-publishes notes to Evernote for easy access.", ["notes", "Evernote account information"]], ["The user accesses 100s of beautifully crafted paper templates and notebook covers through the Noteshelf Club.", ["paper templates", "notebook covers", "preferences"]], ["The user auto-backs up notes to Google Drive & Dropbox.", ["notes"]], ["The user shares notes with colleagues, friends, and family over email, Google Drive, Dropbox, and other supported cloud services.", ["notes", "email addresses", "colleagues' information", "friends' information", "family's information"]], ["The user organizes personal and business notes by dragging and dropping notebooks into groups or categories quickly.", ["personal notes", "business notes", "notebooks", "groups or categories"]], ["The user creates bookmarks on Noteshelf to better organize notes.", ["bookmarks", "notes", "organizational preferences"]]]}, {"summary": "The mobile app is a tool for installing and customizing festive-themed watch faces on compatible Wear OS devices, with features such as digital time, date, battery level, steps count, and customizable complications and shortcuts.", "actions": [["The user checks compatibility of their watch with WEAR OS before installing the app.", ["watch model", "operating system (WEAR OS)"]], ["The user may receive instructions on how to install the watch face from support@recreative-watch.com.", ["email address", "watch model", "technical support interaction"]], ["The user looks for the watch face in the 'Downloaded' section on their watch.", ["watch faces"]], ["The user customizes their Wear OS watch face by choosing a character for the festive season.", ["watch face design", "festive season preferences", "character preferences"]], ["The user may write to support@recreative-watch.com for further assistance.", ["email address"]], ["The user uses the phone app to facilitate installation and locate the watch face on their Wear OS watch.", ["location data", "device information"]], ["The user customizes the display on their Wear OS watch by touching and holding the display and tapping on the Customize option.", ["display customization preferences", "touch interactions", "tap interactions"]], ["The user customizes complications on the watch face by opening the customization mode and selecting data fields like weather, time zone, sunset/sunrise, etc.", ["location", "weather", "time zone", "sunset/sunrise"]]]}, {"summary": "The mobile app is a quiz-based application designed to help 6th and 8th grade students prepare for the Hungarian language entrance exam by providing grammar and literature practice questions, tips, and extra content, all accessible for a one-time fee on Android devices.", "actions": [["The app assists middle and high school students in preparing for the Hungarian language entrance exam.", ["age group", "education level", "language proficiency level", "study habits"]], ["The app aims to make learning interesting and enjoyable for students by providing practice through everyday language examples and song lyrics.", ["age", "learning preferences", "language proficiency level", "favorite music genres"]], ["The app provides tips and advice for comprehension and composition tasks in the entrance exam, as well as general guidance for the application process.", ["educational background", "exam subjects", "application process", "academic interests"]]]}, {"summary": "The mobile app is a feature-rich GPS locator and offline maps tool that allows users to view, analyze, record, and navigate trips and outdoor activities with support for various file formats, detailed trip stats, online maps, simple navigation tools, offline maps, track editing, recording, weather forecasts, and customizable settings.", "actions": [["The user views tracks, routes, and waypoints from gpx, kml, kmz, and loc files.", ["location data", "places visited", "travel history"]], ["The user accesses a file browser to open multiple files and manage favorite files and history.", ["file names", "file paths", "favorite files", "file history"]], ["The user analyzes information and statistics for tracks and routes.", ["tracks", "routes", "statistics"]], ["The user views graphs like elevation profile and speed profile for tracks and routes.", ["location data", "activity data", "speed data", "elevation data"]], ["The user views graphs of other track data like cadence, heart rate, power, and air temperature.", ["cadence data", "heart rate data", "power data", "air temperature data"]], ["The user analyzes information for waypoints and adjusts their icons.", ["location data", "icon preferences"]], ["The user changes track and route color.", ["track color", "route color"]], ["The user colorizes track and route line by elevation, speed, cadence, heart rate, or air temperature.", ["elevation data", "speed data", "cadence data", "heart rate data", "air temperature data"]], ["The user adds custom online TMS or WMS maps.", ["location data", "custom map preferences"]], ["The user uses the simple navigation tool to show current GPS position on a map and follow GPS position continuously.", ["GPS position"]], ["The user rotates the map according to device orientation sensor or movement direction data from GPS.", ["location data", "device orientation data"]], ["The user receives a notification when GPS position is near a waypoint with adjustable distance.", ["GPS position", "waypoint location", "adjustable distance"]], ["The user synchronizes tracks and waypoints created on Trackbook.", ["tracks", "waypoints"]], ["The user creates new tracks or edits existing tracks and routes.", ["location data", "track preferences", "route history", "editing history"]], ["The user splits a track or route into two or merges two tracks or routes into one.", ["location data", "activity history"]], ["The user adds waypoints on the map and sets their name and icon.", ["location data", "user name", "selected icon"]], ["The user records elevation and speed statistics.", {"Personal data": ["location data", "elevation data", "speed data"]}], ["The user receives distance or time voice notification during recording.", ["location data", "recording preferences", "time preferences"]], ["The user accesses weather forecast for the next 7 days.", ["location", "time preference"]]]}, {"summary": "The mobile app offers text translation between 108 languages, tap to translate in any app, offline translation for 59 languages, instant camera translation for 94 languages, photo translation for 90 languages, bilingual conversation translation for 70 languages, handwriting input for 96 languages, phrasebook for saving translations, and cross-device syncing.", "actions": [["The user translates text between 108 languages by typing.", ["text", "source language", "target language"]], ["The user copies text in any app and taps the Google Translate icon to translate.", ["copied text", "translated text", "language detected"]], ["The user translates with no internet connection in 59 languages.", ["translated text", "source language", "target language"]], ["The user translates text in images instantly by pointing the camera in 94 languages.", ["images", "text", "languages"]], ["The user takes or imports photos for higher quality translations in 90 languages.", ["photos", "language preferences", "geolocation data"]], ["The user translates bilingual conversations on the fly in 70 languages.", ["spoken words", "language pair", "translation history"]], ["The user draws text characters instead of typing in 96 languages.", ["text characters", "language preferences"]], ["The user stars and saves translated words and phrases for future reference in all languages.", ["translated words", "phrases", "saved items", "language preferences"]], ["The user logs in to sync phrasebook between app and desktop for cross-device syncing.", ["log-in credentials", "phrasebook data", "device information"]], ["The user continuously translates someone speaking a different language in near real-time in 8 languages.", ["spoken language", "translated language", "audio input", "translated text"]]]}, {"summary": "The mobile app is a private instant messaging application that prioritizes user control, does not require personal data, and ensures secure and private communication through end-to-end encryption and authentication.", "actions": [["The app Olvid allows users to choose who they want to discuss with.", ["contacts", "conversation topics", "communication preferences"]], ["The app Olvid creates safe spaces for users to communicate without external aggression.", ["user messages", "user interactions", "user preferences"]], ["The app Olvid allows users to create groups with family, friends, and collaborators.", ["family relationships", "friendships", "collaborators"]], ["The app Olvid is designed to be a secure place to exchange on important subjects.", ["important subjects", "secure place", "exchanged information"]]]}, {"summary": "The mobile app allows users to easily record and monitor their blood pressure and blood sugar data, offering insights into trends and history while also providing educational information on blood pressure-related topics.", "actions": [["The user records their blood pressure data using the app.", ["blood pressure data"]], ["The user views trends and history of their blood pressure data.", {"Personal data": ["blood pressure data"]}], ["The user records their blood sugar data in the app.", ["blood sugar levels", "health condition", "dietary habits"]]]}, {"summary": "The mobile app is a powerful sheet music viewer for Android tablets that allows musicians to access, organize, and annotate their sheet music files with features such as multiple viewing modes, hands-free page turns, audio player integration, metronome, annotations, and more.", "actions": [["The user views sheet music files on their Android tablet.", {"Personal data": ["sheet music files", "Android tablet"]}], ["The user organizes sheet music files by creating custom setlists and collections.", ["sheet music files", "setlists", "collections"]], ["The user can annotate sheet music by adding markings, text, and stamps.", ["sheet music", "markings", "text", "stamps"]], ["The user can play audio tracks along with their sheet music.", ["audio tracks", "sheet music"]], ["The user can import CSV index files to manage large PDF songbooks.", ["CSV index files", "PDF songbooks"]], ["The user can transpose chords in text and chord pro files.", ["chords", "music preferences"]], ["The user can manually or automatically crop sheet music files to eliminate unnecessary margins.", ["sheet music files", "cropping preferences"]], ["The user manages their sheet music library with various metadata fields for organization.", ["sheet music", "metadata fields", "music preferences", "organization preferences"]], ["The user accesses a companion PC application to create and edit songs.", ["music projects", "song lyrics", "preferred music genres"]], ["The app supports multiple file types including images, PDFs, text files, and chord pro files.", ["images", "PDFs", "text files", "chord pro files"]]]}, {"summary": "The mobile app allows you to discover ideas, connect with people and communities, shop on Marketplace, watch reels for inspiration, personalize your feed, and share your world creatively.", "actions": [["The user explores and expands their interests by shopping on Marketplace and taking hobbies to the next level.", ["shopping history", "hobbies", "interests", "preferred activities"]], ["The user personalizes their Feed to see more of what they like and less of what they don't.", ["interests", "preferences", "dislikes"]], ["The user watches reels for quick entertainment and inspiration.", ["watched reels", "interests", "inspirations"]], ["The user discovers creators, small businesses, and communities to dive deeper into their interests.", ["interests", "location", "demographics"]], ["The user joins groups to learn tips and tricks from real people and catch up with friends, family, and influencers.", ["group memberships", "interests", "relationship connections", "influencer preferences"]], ["The user shares things that matter to them with easy in-app access to Messenger chats.", ["shared items", "Messenger chats"]], ["The user lets their creativity shine by making reels with trending audio and editing tools.", ["reels", "trending audio", "editing tools"]], ["The user customizes their profile to choose how they show up and who they share their posts with.", ["profile information", "privacy settings", "shared posts"]], ["The user turns their hobby into a side hustle by becoming a creator or selling things on Marketplace.", ["hobby", "products/services being sold", "payment information", "business details"]], ["The user celebrates everyday candid moments with stories that disappear in 24 hours.", ["stories", "candid moments"]]]}, {"summary": "The mobile app MX Player Pro offers an ad-free video playback experience with advanced features like 8K/4K Ultra HD support, gesture controls, multitasking capabilities, customization options, superior subtitle support, an HD music player, night mode, equalizer/bass booster, video cutter, MP3 converter, local network access, and video downloader.", "actions": [["The user downloads and installs the MX Player Pro app for uninterrupted video experience without ads.", ["user ID", "device information", "app download history", "payment information"]], ["The user controls various functions like volume, brightness, video seeking, and playback speed adjustment using gestures.", ["gestures", "volume preferences", "brightness preferences", "video seeking preferences", "playback speed preferences"]], ["The user customizes the MX Player Pro experience from User Interface to fine-tuning playback controls.", ["UI preferences", "playback settings"]], ["The user saves favorite videos from social media channels using the Video Downloader feature.", ["saved videos", "social media channels", "preferences"]], ["The user grants necessary permissions like Storage / All Files Access, and optional permissions like Microphone and Bluetooth for various functionalities.", ["storage data", "files access", "microphone data", "bluetooth data"]]]}, {"summary": "The mobile app is a tool for recording blood pressure and blood sugar data, allowing users to track trends and history, as well as providing health information without measuring blood pressure or blood sugar levels.", "actions": [["The user records their blood pressure data in the app.", ["blood pressure data"]], ["The user views their blood pressure data trends and history.", ["blood pressure data"]], ["The user records their blood sugar data in the app.", ["blood sugar data"]], ["The app reminds users to consult a professional medical provider or physician for health professional guidance.", {"Personal data": ["health information", "medical history", "location data", "device information"]}]]}, {"summary": "The mobile app makes ordering cosmetic products easier than ever with simplified and personalized digital shopping, allowing users to collect loyalty points from Marionnaud purchases with a loyalty card.", "actions": [["The user orders cosmetic products using the simplified and customized digital shopping experience.", ["cosmetic products", "shopping preferences", "billing information", "shipping address"]], ["The user collects loyalty points with Marionnaud loyalty card when making purchases through the app.", ["loyalty points", "purchase history", "location data", "email address"]]]}, {"summary": "The mobile app helps photographers unlock their creative potential by providing tools and information to plan and capture stunning photos of Sun, Moon, Milky Way, and more, with features like 2D map-centric planner, augmented reality views, calculators, widgets, and the opportunity to win cash prizes for submitted photos.", "actions": [["The user goes out to capture unique moments in the great outdoors.", ["location data", "photos", "activity preferences", "outdoor interests"]], ["The user creates a To-Do list of planned photos to never miss a scene.", ["photos", "locations", "time schedules"]], ["The user saves locations of interest as Points of Interest in a personal database.", ["location data", "name of the point of interest", "notes about the location", "categories/tags"]], ["The user explores, discovers great places, and creates a personal database of locations.", ["locations", "favorite places", "travel history", "preferences"]], ["The user reads How-To articles and watches videos for assistance when needed.", ["How-To articles", "videos"]]]}, {"summary": "The mobile app offers a wide range of AI-powered photo editing tools, including face filters, neural photo art styles, realistic photo effects, face photo montages, photo background editor, photo filters, and photo collages, allowing users to enhance their photos with creativity and originality.", "actions": [["The user edits photos with face filters and stylish effects.", ["photos", "facial features", "preferred filters", "editing preferences"]], ["The user chooses from over 50 pre-set styles to turn photos into artworks.", ["photos", "art styles", "preferred styles"]], ["The user adds diverse photo frames to their images.", ["images", "photo frames", "editing preferences"]], ["The user applies realistic photo effects to transform images.", ["images", "photo effects", "edit preferences"]], ["The user swaps faces to create cartoon characters or unique looks.", ["photos", "facial features"]], ["The user uses the advanced editor to erase and change backgrounds in photos.", ["photos", "editing preferences", "background preferences"]], ["The user applies various photo filters like 3d, cartoon, vintage, etc., to create different moods.", ["photos", "photo filters", "moods"]], ["The user creates photo collages by combining multiple images.", ["photos", "image editing preferences", "collage layouts"]], ["The user sets edited images as profile pictures, shares them on social networks, or sends them as virtual postcards.", ["images", "edited images", "profile pictures", "social networks", "virtual postcards"]], ["The user enhances photos and adds originality with face filters and effects using the app.", ["photos", "face", "filters", "effects"]]]}, {"summary": "The mobile app offers brokerage services and day trading options for investing in stocks, shares, Forex, and other trading options with a variety of features and educational resources available in multiple languages, but involves high risks as stated in the risk disclosure.", "actions": [["The user invests in stocks and shares using the Admirals broker trading app.", {"Personal data": ["financial information", "investment preferences", "trading activities"]}], ["The user engages in forex trading with 212 options for investing in the stock market.", ["financial data", "investment preferences", "trading history", "risk tolerance"]], ["The user trades and invests in all stock market conditions by going long or short.", ["market data", "investment history", "trading strategy", "financial goals"]], ["The user watches 212 trading and investing videos.", {"Personal data": ["trading interests", "investing interests", "videos watched"]}], ["The user trades stocks to get to the peak of the olymp.", ["stock trading activity", "financial information", "investment preferences"]], ["The app provides support for trading in multiple languages.", ["language preferences", "trading activities", "location data"]], ["The app offers trading and investing options in various financial instruments.", ["financial transaction history", "investment preferences", "income level", "risk tolerance"]], ["The app displays a risk disclosure about investing with Admiral Markets and the associated risks.", {"Personal data": ["investment interests", "risk tolerance", "financial goals"]}]]}, {"summary": "The mobile app provides a quick search engine for finding various contraventions specified by Romanian laws, along with corresponding articles, penalty values, and complementary measures, offering a convenient alternative to traditional methods of research.", "actions": [["The user searches for various contraventions specified by different laws using the app.", ["search queries", "legal terms", "location"]], ["The user views details such as the article provisions, sanctioning articles, fine amounts, and complementary measures provided by the app.", ["article provisions", "sanctioning articles", "fine amounts", "complementary measures"]]]}, {"summary": "The mobile app is a collection of small, simple, single-task tools designed to help neurodivergent individuals with overwhelming or difficult tasks, with features like a Magic Todo list, The Formalizer, The Judge, The Estimator, The Compiler, The Chef, and more.", "actions": [["The user accesses the Magic Todo list to automatically break down tasks into steps.", ["task lists", "tasks", "task steps", "time estimates"]], ["The user utilizes the Formalizer to transform their language to be more formal, sociable, or concise.", ["language style", "communication preferences"]], ["The user engages with the Judge to help interpret tone.", ["tone of conversations", "communication context", "interaction history"]], ["The user engages with the Chef to turn descriptions of ingredients and tools into real recipes.", ["ingredient descriptions", "tool descriptions", "recipes"]]]}, {"summary": "The mobile app allows users to access exclusive offers, earn rewards through a loyalty program, view weekly flyers, manage digital receipts, and benefit from environmental sustainability by avoiding paper receipts at Netto France stores.", "actions": [["The user downloads the Netto France application.", ["device type", "location", "IP address"]], ["The user prepares their shopping list and checks for deals in the dedicated section.", ["shopping list items", "shopping preferences", "discounts and deals preferences"]], ["The user accesses and downloads their Netto brochures and catalogs on their mobile device.", ["Netto brochures", "catalogs", "mobile device information"]], ["The user views and manages their digital receipts from purchases.", ["purchase history", "payment methods", "shipping addresses"]], ["The app provides exclusive offers on everyday products for earning rewards and vouchers.", ["shopping preferences", "purchase history", "reward preferences", "geolocation data"]], ["The app adds euros earned from purchases at participating Netto stores to the user's digital card for future use.", ["purchase history", "earned euros", "participating Netto stores"]]]}, {"summary": "The mobile app offers smart banking features such as online account opening, intuitive interface, secure authentication options, instant payments, saving box, smart search, card management, loyalty rewards, future payments scheduling, access to various banking products, push notifications, utility bill payments, personal data updates, and more.", "actions": [["The user easily finds anything they need using the intuitive interface.", {"Personal data": []}], ["The user uses PIN, fingerprint, or FaceID for secure authentication and authorization when registering their device.", ["biometric data", "device registration information"]], ["The user personalizes the Dashboard using a simple 'drag & drop' feature, optionally hiding the balance for their accounts or changing their username.", ["dashboard layout", "account balance", "username"]], ["The user automatically saves money with every card payment and earns interest using Saving Box, choosing how much to save for each payment.", ["card payments", "savings amounts", "interest earned", "saving preferences"]], ["The user easily finds and repeats past payments with Smart Search.", ["payment history", "payment amounts", "recipient names", "payment dates"]], ["The user blocks, reissues, or views their card PIN with just one touch, maintaining control over their cards.", ["card information", "PIN", "control preferences"]], ["The user gets rewards such as cashback, discounts, vouchers, and loyalty points through direct access to the Smart Market loyalty app.", ["purchase history", "shopping preferences", "location data", "payment information"]], ["The user schedules future payments, sets up direct debit bill payments, or saves them as templates with future payments.", ["payment schedule", "direct debit details", "payment templates"]], ["The user opens current accounts, savings accounts, and term deposits with ease, and gets a personal loan, Flexicredit, 100% online in about 10 minutes for their daily needs.", ["financial information", "personal details", "identity verification data"]], ["The user purchases Raiffeisen Asset Management unit funds if they have already signed a contract and have the required documents for smart investments.", ["financial data", "contract information", "investment preferences", "required documents"]], ["The user receives instant updates on money going in or out of their current accounts or payments made with their card through push notifications.", ["financial transactions", "current account balances", "payment card activity"]], ["The user pays utility bills through multiple convenient ways, including quick payment, barcode scanning, direct debit, and pre-filled payment forms, and tops up their prepaid mobile plan.", ["utility bill information", "payment methods", "prepaid mobile plan"]]]}, {"summary": "The mobile app is a versatile multi-protocol stream receiver that allows for seamless streaming of various media content from devices to TVs, with features like support for YouTube videos, audio sync, and background streaming.", "actions": [["The user streams screen, photos, music, and videos from their phones and laptops to their TV using AirReceiver.", ["screen content", "photos", "music", "videos"]], ["AirReceiver works in the background, streaming media to the user's Android device.", ["media files", "device type", "IP address"]], ["The user can configure the network name for AirReceiver.", ["network name"]]]}, {"summary": "The mobile app is a powerful offline music player for Android with a built-in equalizer, support for various audio formats, personalized music library features, and a stylish user interface for a premium audio-visual experience.", "actions": [["The app organizes music library based on listening habits and playlists.", ["listening habits", "playlists", "music preferences"]], ["The user customizes their music library by creating playlists and managing songs.", ["music library", "playlists", "songs"]], ["The user sets a sleep timer and customizes playback duration.", ["sleep schedule", "preferred bedtime", "audio preferences"]], ["The user interacts with the music player through home screen widgets and notification center.", ["music preferences", "device information", "interaction history"]], ["The app offers support for lyrics display while playing music.", ["music preferences", "lyrics display settings"]], ["The user can control music playback using Bluetooth or wired headphones.", ["music preferences", "listening habits", "device usage"]]]}, {"summary": "The mobile app is a user-friendly health tracker that helps you monitor and analyze your blood pressure, blood sugar, and heart rate, providing personalized advice and reminders to promote healthy habits.", "actions": [["The user downloads and installs the Health Tracker app on their mobile phone.", ["mobile phone type", "health data", "location data", "device information"]], ["The user records data for blood pressure, blood sugar, and heart rate measurements.", {"Personal data": ["blood pressure measurements", "blood sugar measurements", "heart rate measurements"]}], ["The user analyzes and tracks historical records of blood pressure, blood sugar, and heart rate.", ["blood pressure", "blood sugar levels", "heart rate"]], ["The user receives health advice and personalized reports.", ["health data", "medical history", "lifestyle habits", "location data"]], ["The user checks their health data analysis report and learns about healthy lifestyles.", ["health data analysis report", "healthy lifestyles"]], ["The app automatically reminds the user to take medication and measure health indicators.", ["medication schedule", "health indicators", "medical conditions"]]]}, {"summary": "The mobile app offers a digital and modern watchface with customizable settings for Wear OS, currently running a promotion where users can buy one and get the second one for free by contacting the developer at srt48rus@gmail.com.", "actions": [["The app offers a digital and modern watchface with various settings for Wear OS.", ["device information", "watchface preferences", "location data"]], ["The app promotes a 1+1 deal where users can buy one watchface and get the second one for free.", ["purchase history", "product preferences", "payment information"]], ["Users can contact srt48rus@gmail.com for inquiries regarding the promotion.", ["email address"]]]}, {"summary": "The mobile app automates tasks on your Android device, offering over 350 customizable actions and the ability to create your own standalone apps, with a 7-day trial available before a one-time payment to unlock the full features.", "actions": [["The user can automate tasks based on various contexts like app usage, time of day, location, Wi-Fi network, received SMS or calls, and more.", ["app usage", "time of day", "location", "Wi-Fi network", "received SMS", "received calls"]], ["The user can request Tasker to check a website for updated APK files, receive them, and initiate the installation process.", ["websites visited", "requested APK files", "device information"]], ["The user can use Join to remotely trigger tasks from another Android device or PC.", ["device information", "location data", "user preferences"]], ["The user can design custom UI scenes to display information or trigger tasks.", ["design preferences", "information display preferences", "task triggers"]], ["The user can create standalone apps to share or sell using the Tasker App Factory.", {"Personal data": ["created apps", "sharing preferences", "sales data"]}], ["The user can interact with various third-party developers' apps and events through Tasker.", ["user profile information", "app usage data", "events participation data"]], ["The user can access a 7-day trial of Tasker before making a one-time payment to unlock all features.", ["payment information", "usage data"]]]}, {"summary": "The mobile app allows users with BALTA health insurance to access a contactless e-card, make and track claims, receive notifications, purchase insurance services, claim indemnity in other insurance types, and view relevant information by logging in through their internet bank and creating a PIN code for authentication.", "actions": [["The user uses a health insurance contactless e-card.", {"Personal data": ["health insurance information", "name", "photo", "policy number"]}], ["The user makes a claim for themselves or another insured person.", {"Personal data": ["insurance policy information", "medical records", "personal identification information"]}], ["The user views and keeps track of claims.", ["claims", "viewed claims", "saved claims"]], ["The user adds additional information if necessary.", ["additional information"]], ["The user quickly and conveniently purchases insurance services.", ["name", "contact information", "payment information", "insurance preferences"]], ["The user views relevant information such as policies, invoices, indemnity cases, etc.", ["policies", "invoices", "indemnity cases"]], ["The user logs in through their internet bank.", {"Personal data": ["bank account information", "login credentials", "transaction history", "personal details"]}], ["The user creates a PIN code for accessing the app.", ["PIN code"]], ["The user substitutes the PIN code with biometric authentication (Touch ID, Face ID) for faster and easier access to information.", ["biometric data", "access information"]]]}, {"summary": "The mobile app provides fast and secure access to essential items, such as payment options, tickets, and passes, with convenient features like quick access methods, smart suggestions, and seamless integration across Google services, all while prioritizing safety and privacy with advanced security measures in place.", "actions": [["The user accesses their everyday essentials using quick settings on their phone.", ["location", "preferences", "usage habits"]], ["The user accesses Google Wallet using Google Assistant.", ["financial information", "Google account information", "transaction history"]], ["The user carries cards, tickets, passes, and more in their digital wallet.", ["payment information", "loyalty cards", "tickets", "identification cards"]], ["The user keeps track of receipts in Wallet.", {"Personal data": ["purchase details", "transaction amounts", "store names", "payment methods"]}], ["The user finds transaction details in Wallet, including smart details like location from Google Maps.", ["transaction details", "location"]], ["The user syncs their Wallet to keep their Calendar and Assistant up to date with the latest info.", ["calendar events", "personal assistant preferences", "financial transaction data"]], ["The user shops smarter by seeing their point balances and loyalty benefits in Maps, Shopping, and more.", ["purchase history", "loyalty program membership", "location data"]], ["The user sets up Google Wallet by importing cards, transit passes, loyalty cards, and more saved on Gmail.", ["credit/debit card information", "transit pass information", "loyalty card information", "email addresses"]], ["The user makes boarding flights easier with information from Google Search through Google Wallet.", ["flight information", "Google Search data", "Google Wallet data"]], ["The user taps to pay with their Android phone to keep their card secure.", {"Personal data": ["payment information", "device information", "transaction history"]}], ["The user controls their data with privacy controls in Google Wallet.", ["financial information", "personal information", "data sharing preferences"]]]}, {"summary": "The mobile app offers a diverse range of popular movies and series from major studios such as Paramount+, Universal, DreamWorks, and more, allowing users to stream content on multiple devices, create profiles, and download ad-free favorites.", "actions": [["The user enjoys the latest and most popular movies and series from various studios.", ["movie preferences", "series preferences", "favorite genres", "watching history"]], ["The user creates up to 5 profiles, including childproof profiles.", ["names", "ages", "gender", "parental status"]], ["The user downloads favorite content for offline viewing.", ["downloaded content", "favorite content", "viewing preferences"]], ["The app provides a unique catalogue of new and exclusive TV series and movies.", ["watching preferences", "favorite genres", "viewing history"]], ["The app brings handpicked, quality entertainment to suit every moment.", ["entertainment preferences", "watching habits", "mood preferences"]], ["The app allows users to watch exclusive shows like Poker Face, Yellowstone, Star Trek: Strange New Worlds, and Yellowjackets.", ["watching habits", "entertainment preferences"]]]}, {"summary": "The mobile app is a customizable watch face designed for Wear OS devices with API Level 30+, featuring high resolution, optimization, low battery consumption, multilingual support, and a variety of customizable elements such as colors, bezels, frames, and complications, with additional features including animated highlights, customizable AOD mode, and various social media channels for news and promotions.", "actions": [["The user takes advantage of the promotion 'Buy 1 - Get 1 free' at https://samsung-watchface.com/buy1-get1.", ["purchase history", "location data"]], ["The app is designed for low battery consumption.", ["device battery level", "power-saving settings"]], ["The user can customize colors on the watch face.", ["color preferences"]], ["The watch face has animated highlights that can be disabled.", ["watch face preferences", "animation preferences"]], ["The user can choose different frames for sensors on the watch face.", ["watch face frames", "sensor preferences"]], ["The user can add custom complications and widgets to the watch face.", ["watch face design preferences", "fitness data", "calendar events", "weather information"]], ["The user can stay updated on news and promotions by following the app on various platforms: WEB at https://samsung-watchface.com, TELEGRAM at https://t.me/SamsungWFP, FACEBOOK at https://www.facebook.com/groups/wearoswatchfaces, INSTAGRAM at https://instagram.com/wearos_watchfaces?igshid=MzRlODBiNWFlZA==.", ["following app", "news", "promotions", "WEB platform", "TELEGRAM platform", "FACEBOOK platform", "INSTAGRAM platform"]]]}, {"summary": "The mobile app offers a wide range of features including AI photo editing, face filters, photo effects, photo frames, neural photo art styles, realistic effects, face photo montages, background editing, filters, and collage creation to enhance and add originality to your photos.", "actions": [["The user joins the AI photo editor Photo Lab.", ["photos", "editing preferences", "location data"]], ["The user edits photos with face filters for pictures, stylish photo effects, and pic art ideas.", ["photos", "face filters", "photo effects", "pic art ideas"]], ["The app provides neural photo art styles to turn any photo into an artwork.", ["photos", "art styles"]], ["The user chooses from over 50 pre-set styles and experiences advanced photo editing with the emergence of AI photo styles.", ["photos", "photo editing preferences", "AI usage data"]], ["The app provides a diverse collection of exquisite photo frames for the user to choose from and add a final touch to their favorite picture.", ["favorite picture", "photo frames preferences"]], ["The user applies realistic photo effects to transform ordinary images into extraordinary visual creations.", ["images", "personal photos", "photo effects used", "artistic preferences"]], ["The user swaps faces easily and turns themselves or their friend into a cartoon character, a doll, or any other look.", ["photos", "face images", "cartoon character preferences", "doll preferences"]], ["The app handles the most complicated photo montages automatically using a face detection algorithm to create unusual selfies.", ["photos", "facial features", "selfies"]], ["The user uses the advanced picture editor to easily and quickly erase and change backgrounds of their selfie with creative background templates.", ["selfies", "backgrounds", "creative templates"]], ["The user applies various photo filters such as 3D photo, cartoon, vintage, anime, black&white, oil painting, and many more to create different moods and atmospheres in their photos.", ["photos", "photo filters", "moods", "atmospheres"]], ["The user creates a wonderful pic collage by seamlessly combining multiple images to craft captivating visual narratives.", ["images", "collage", "visual storytelling", "design preferences"]], ["The user makes their image look creative in seconds without using a professional picture editor and sets it as a profile pic, shares it to any social network, or sends a signed virtual postcard to friends.", ["images", "profile picture setting", "social network sharing", "virtual postcard sending"]]]}, {"summary": "The mobile app is a GPS camera that overlays and stamps photos with location, direction, altitude, date, and time taken, catering to various industries and professionals globally, with additional features available through an Industry Pack in-app purchase.", "actions": [["The user overlays and stamps photos with location, direction, altitude, date & time taken.", ["photos", "location data", "direction data", "altitude data", "date & time taken"]], ["The user captures field notes such as project name, photo description, company or username.", ["project name", "photo description", "company or username"]], ["The user selects the information needed to capture & stamp on photos.", ["captured information", "stamps", "photo metadata"]], ["The user takes and autosaves two photos at once: one stamped with selected overlays and one original photo with no overlays.", ["photos", "selected overlays", "location data"]], ["The user sorts photos by time, location, distance from current location, and project name.", ["photos", "time", "location", "distance from current location", "project name"]], ["The user shares photos individually or as a zip file via the share sheet.", ["photos", "file format", "shared recipients"]], ["The user emails photos including Exif metadata, compass direction, GPS position, altitude, tilt & roll, date & time taken, street address, and elevation of building face viewed.", ["photos", "Exif metadata", "compass direction", "GPS position", "altitude", "tilt & roll", "date & time taken", "street address", "elevation of building face viewed"]], ["The user edits notes overlay by stamping photos with 'Project name', 'Description', and 'Watermark'.", ["notes", "photos", "Project name", "Description", "Watermark"]], ["The user defines the photo export filename from a selection of fields.", ["photos", "export filename", "selected fields"]], ["The user selects multiple photos from the library and edits Project Name, Description & Watermark fields in one go.", ["photos", "Project Name", "Description", "Watermark"]], ["The user adds street address to overlay or uses UTM/MGRS coordinate formats instead of Lat/Long.", ["street address", "UTM/MGRS coordinate formats", "Lat/Long coordinates"]], ["The user autosaves original and stamped photos to Google Drive, Dropbox, and OneDrive.", ["photos", "location data"]], ["The user emails or exports photo data and notes in KML, KMZ, or CSV formats.", ["photos", "notes"]], ["The user views photos by direction, the distance between photos, and the area of photos taken.", ["location data", "direction", "distance between photos", "area of photos taken"]], ["The user refines & locks GPS location, especially for those working in and around buildings.", ["GPS location", "work location", "building details"]]]}, {"summary": "The mobile app offers a convenient shopping experience for a wide range of fashion items, including clothing, shoes, accessories, and sportswear, with a focus on sustainability, personal style inspiration, and up-to-date trends from fashion experts and brands in Europe.", "actions": [["The user shops for clothing, shoes, accessories, and sportswear from popular brands and designer labels.", ["clothing preferences", "shoe sizes", "accessory preferences", "preferred brands"]], ["The user explores options with a focus on sustainability.", ["interest in sustainability", "products or services related to sustainability", "purchase behavior"]], ["The user follows fashion experts to see how they style their outfits.", ["fashion experts", "outfit styles", "fashion preferences"]], ["The user follows brands to see new items and collections.", ["brand preferences", "shopping interests"]], ["The user stays up to date with news and trends from fashion experts and brands.", ["fashion news", "trends", "brands", "fashion experts"]], ["The user discovers collections and lines from a wide range of designer brands.", ["designer brands", "fashion preferences", "browsing history"]], ["The user stays up to date with sales, discounts, promotions, and discount codes.", ["purchase history", "shopping preferences", "email address"]], ["The user browses a wide range of affordable and designer fashion items for all occasions.", ["fashion preferences", "budget", "shopping habits"]], ["The user selects the latest shoes from popular brands for women, men, and kids.", ["shoe preferences", "gender", "age groups"]], ["The user browses fashion accessories including handbags, backpacks, jewelry, hats, scarves, watches, smartwatches, and textile masks.", ["fashion accessories", "handbags", "backpacks", "jewelry", "hats", "scarves", "watches", "smartwatches", "textile masks"]], ["The user connects with Zalando on social media platforms like Facebook, Instagram, and Pinterest.", ["social media platforms", "user profile information"]], ["The user leaves reviews or contacts Zalando via email to provide feedback about the app.", ["reviews", "email address", "feedback", "app usage"]], ["The app sends personalized notifications to users for vouchers, sale alerts, and more.", ["purchase history", "shopping preferences", "location data", "notification preferences"]], ["The app loads product images faster by accessing photos/media/files, ensuring privacy protection.", ["product images", "photos", "media", "files"]], ["The app utilizes the camera for photo search and barcode scanner functionalities.", ["photos", "barcode information"]]]}, {"summary": "The mobile app helps you remember your round of drinks and offers additional features like creating multiple bars, changing glass shapes, and showing prices in its PRO version.", "actions": [["The user creates multiple bars in the app.", {"Personal data": ["user-created bars", "drink preferences", "location data"]}], ["The user changes the shape of glasses in the app.", ["face shape", "glasses preferences", "visual preferences"]], ["The user views prices in the app.", ["location", "currency preferences", "purchase history"]], ["The app provides support for both PRO and LITE versions.", ["user type"]]]}, {"summary": "The mobile app offers a simple and secure way to send and request money, discover cashback offers, track orders, pay in 4 interest-free payments, access your PayPal balance with a debit card, and ensure secure transactions.", "actions": [["The user sends money or gets paid back by friends and family in the US on PayPal for free.", ["financial transactions", "names of friends and family", "email addresses", "transaction history"]], ["The user requests money securely from friends or family and personalizes their payments.", ["financial information", "contacts", "payment history"]], ["The user finds cashback offers from brands they love in the app.", ["brand preferences", "purchase history", "location"]], ["The user tracks their packages to their doorstep, receiving live updates each step of the way.", ["package tracking information", "home address"]], ["The user accesses their PayPal balance with the PayPal debit card, transferring funds from their bank balance and using it for purchases and cash withdrawals.", ["PayPal balance", "debit card information", "bank balance", "purchase history", "cash withdrawal history"]], ["The user trusts PayPal for secure transactions, with encryption and fraud protection.", ["financial information", "name", "contact information", "transaction history"]]]}, {"summary": "The mobile app is the official journey planner for train travels within Hungary, providing train information, ticket purchasing, real-time train tracking, and a chat feature with fellow passengers.", "actions": [["The user plans train travel by setting the date, departure and destination stations, and available discounts.", ["travel dates", "departure station", "destination station", "available discounts"]], ["The user pays for train tickets with a credit card.", ["credit card information"]], ["The user saves purchase settings and data for future transactions.", ["purchase settings", "transaction data"]], ["The user engages in real-time chat with fellow passengers on the same train.", ["messages", "location data", "train route information", "profile information"]]]}, {"summary": "The mobile app helps users track their blood pressure, record daily logs, identify ranges, understand factors affecting blood pressure, and offers advice on maintaining healthy levels, with features including practical knowledge, fast data processing, and easy input of blood pressure information with just one touch.", "actions": [["The user tracks their blood pressure using the app.", ["blood pressure readings"]], ["The user records a daily blood pressure log.", ["blood pressure readings", "timestamp", "health condition"]], ["The user identifies blood pressure ranges with the app.", ["blood pressure ranges"]], ["The user understands factors affecting their blood pressure with the app.", ["blood pressure data", "health conditions", "age", "weight", "height", "medical history"]]]}, {"summary": "The mobile app offers a personalized fashion experience with a wide range of brands, exclusive collections, and content, allowing users to shop anytime, anywhere, receive vouchers and offers, stay updated on trends, and create wishlists across all devices.", "actions": [["The user gets a personalised fashion experience in the ABOUT YOU app.", ["clothing preferences", "size measurements", "style preferences", "shopping habits"]], ["The user discovers a wide range of brands and exclusive collections and content.", ["browsing history", "purchase history", "brand preferences", "interest in exclusive content"]], ["The user shops from anywhere and anytime.", ["purchase history", "payment information", "shipping address", "shopping preferences"]], ["The user never misses out on vouchers and offers.", {"Personal data": ["location", "shopping preferences", "purchase history", "email address"]}], ["The user is inspired by favourite brands' fashion updates in the discovery area.", ["favorite brands", "fashion updates", "discovery preferences"]], ["The user finds all the brand new trends, offers, and stars that interest them.", ["interests", "trends", "offers", "celebrities"]], ["The user follows current styles and trends of favourite brands to always stay up to date.", ["favorite brands", "style preferences", "trend interests"]], ["The user finds styles that suit them with just one click.", ["clothing sizes", "style preferences", "color preferences", "body measurements"]], ["The user receives vouchers and offers automatically on their smartphone.", ["location data", "purchase history", "preferences", "device information"]], ["The user keeps track of things and adds products to their wishlist.", ["products", "wishlist"]], ["The user shops flexibly by syncing their shopping bag across all their devices.", ["shopping bag items", "device information"]], ["The user benefits from a diverse range of brands, well-priced fashion pieces, and varying offers in the app.", ["shopping preferences", "brand preferences", "budget", "purchase history"]], ["The user orders at ABOUT YOU and receives high-quality fashion in just a few working days at their doorstep.", ["order details", "delivery address", "payment information", "preferred fashion styles"]], ["The user is impressed with high-quality workmanship and the best materials in the bargains they buy online at ABOUT YOU.", ["purchase history", "product preferences", "online shopping habits"]], ["The user finds their favourite brand and individual favourite pieces from various brands in the online fashion shop ABOUT YOU.", ["favorite brand", "favorite pieces", "online shopping history", "clothing preferences"]]]}, {"summary": "The mobile app allows users to quickly create beats and tracks by recording samples with their phone's mic, adding effects, and utilizing a high-resolution sequencer, with features such as resampling, importing own samples, and MIDI control available.", "actions": [["The user records sounds using their phone's mic or loads their own sounds.", {"personal_data": ["audio recordings", "sound files"]}], ["The user creates beats using recorded samples and adds effects to them.", ["recorded samples", "beats", "effects", "music preferences"]], ["The user exports loops or entire tracks as professional quality WAV files.", ["audio loops", "tracks", "professional quality WAV files"]], ["The user copies, pastes, or merges sequences by dragging them.", ["sequences", "dragging interactions"]], ["The user imports their own samples into the app.", ["audio samples", "photos", "video clips"]], ["The user uses AI to separate samples into individual instruments like drums, bass, and vocals.", ["audio samples", "instrument separation preferences", "music genre preferences"]], ["The user plays samples chromatically or with 9 different scales in keyboard mode.", ["musical preferences", "keyboard playing habits"]], ["The user quantizes and adds swing to achieve the right feel in their beats.", {"Personal data": ["music production techniques", "musical preferences", "beat adjustments"]}], ["The user mutes or solos individual samples.", ["audio samples", "sound settings"]], ["The user adds any of the 16 effects to the entire mix.", ["audio mix", "preferred effects"]], ["The user applies built-in microphone effects like More Bass, More Treble, Fuzz, Robot, and others.", ["audio data", "microphone input", "selected effects"]], ["The user purchases SAMURAI In-App features for pro-quality Timestretch, Piano roll editor, and Auto-chop functionality.", {"Personal data": ["purchase history", "app usage data", "payment information"]}]]}, {"summary": "The mobile app offers access to millions of songs, albums, podcasts, and audiobooks for free, with the option to subscribe to Spotify Premium for ad-free listening, offline downloads, and other premium features.", "actions": [["The user plays millions of songs, albums, and podcasts for free.", ["music preferences", "listening habits", "favorite genres", "podcast interests"]], ["The user subscribes to Spotify Premium to download and listen offline.", {"Personal data": ["payment information", "music preferences", "device information"]}], ["The user searches for favorite songs or artists by typing a lyric.", {"Personal data": ["favorite songs", "favorite artists", "lyrics typed"]}], ["The user creates and shares their own music playlists.", ["music playlists", "music preferences", "mood", "genre preferences"]], ["The user listens to daily music mixes made just for them.", ["music preferences", "listening habits", "mood preferences"]], ["The user explores top songs from different genres, countries, or decades.", ["music preferences", "favorite genres", "favorite countries", "favorite decades"]], ["The user listens to music and podcasts on various devices like mobile, tablet, desktop, etc.", ["music preferences", "podcast preferences", "listening history", "device information"]], ["The user subscribes to favorite podcasts to never miss an episode.", ["podcasts", "listening preferences", "interests", "email address"]], ["The user bookmarks individual podcasts into playlists.", ["podcasts", "playlist selections"]], ["The user listens to music from popular artists like Bad Bunny, Billie Eilish, etc.", ["music preferences", "favorite artists"]], ["The user listens to music artists via the Popular Radio playlist feature.", ["music artists", "listening habits", "favorite genres"]], ["The user listens to over 40 category genres like Pop, Workout, Hip-Hop, etc.", ["music genres", "listening habits"]], ["The user listens to popular and exclusive podcasts like The Joe Rogan Experience, Modern Wisdom, etc.", ["listening history", "podcast preferences"]], ["The user listens to audiobooks on Spotify and easily switches between music, podcasts, and stories.", ["audiobooks", "music preferences", "podcast genres", "listening habits"]], ["The user searches, discovers, and plays music, podcasts, and audiobooks from all over the world.", ["music preferences", "podcasts interests", "audiobook interests", "search history"]], ["The user likes Spotify on Facebook and follows on Twitter.", ["social media accounts", "music preferences", "likes/follows"]]]}, {"summary": "The mobile app offers digital planning, note-taking, and PDF editing capabilities with features such as smooth handwriting, customizable pens, digital planners, PDF import, hyperlink creation, stickers functionality, document organization, and Google Drive syncing.", "actions": [["The user takes notes, annotates, and edits PDFs digitally.", ["notes", "annotations", "edited PDFs"]], ["The user customizes pen color, thickness, and style.", ["pen color", "pen thickness", "pen style"]], ["The user highlights and underlines with the snap straight highlighter pen.", ["highlighted text", "underlined text"]], ["The user adds photos and images to documents.", ["photos", "images", "documents"]], ["The user imports custom fonts.", ["font styles"]], ["The user uses the handwriting to text feature for automatic conversion.", ["handwriting samples", "text conversions"]], ["The user uses the smart eraser tool to erase specific objects.", ["images", "smart eraser tool usage data", "object positions"]], ["The user moves, resizes, rotates, and groups objects.", ["object positions", "object sizes", "object rotations", "object groupings"]], ["The user creates hyperlinks in any document.", ["documents", "hyperlinks"]], ["The user organizes images using the stickers panel.", ["images", "stickers"]], ["The user creates sticker collections.", ["stickers", "preferred themes", "design preferences"]], ["The user adds stickers to any document.", ["documents", "sticker choices"]], ["The user creates folders and subfolders to organize documents.", ["folders", "subfolders", "documents"]], ["The user duplicates, moves, renames, or deletes files.", ["file names", "file locations", "file content"]], ["The user links Google Drive to enable syncing between Android devices.", ["Google Drive account", "Android devices", "syncing preferences"]]]}, {"summary": "The mobile app allows you to stream web videos, online movies, livestreams, and live TV shows directly to your Amazon Fire TV, supporting various video formats and offering premium features such as remote playbar control, ad-blocker, bookmarks, and desktop mode.", "actions": [["The user upgrades their Fire TV to watch webvideos, online movies, livestreams, and live-tv shows directly on their biggest screen.", ["device information", "watching preferences", "content preferences"]], ["The user tests the basic features in the FREE app edition before considering the PRO edition.", {"Personal data": []}], ["The user browses through the web and streams or casts any video they want on their Fire TV.", ["browsing history", "video preferences"]], ["The user sends the embedded video from their favorite website to their Fire TV with a single tap.", ["favorite website", "Fire TV device information"]], ["The user checks the FAQ or reports issues to info@video-tv-cast.com if a specific web-video, online-movie, livestream, or live-tv show does not cast.", ["email address", "specific web-video", "online-movie", "livestream", "live-tv show"]], ["The user adds and manages bookmarks in the bookmarks menu or directly in the browser.", ["bookmarks", "bookmark categories", "favorite websites"]], ["The user sets their personal homepage in the settings after purchasing the app.", ["personal homepage", "settings", "purchase history"]]]}, {"summary": "The mobile app PeakFinder allows users to explore mountains worldwide with a 360° panorama display, offline functionality, and over 1 million peak names, recommended by various sources and offering features like real-time rendering, digital telescope, and solar/lunar orbit information.", "actions": [["The user explores mountains and peaks using PeakFinder app.", ["location data", "user preferences", "hiking interests"]], ["PeakFinder functions offline and worldwide.", {"Personal data": []}], ["PeakFinder includes more than 1'000'000 peak names.", ["location data", "user preferences", "inferred interests"]], ["Users can mark mountains and places they like within the app.", ["favorite mountains", "favorite places"]], ["PeakFinder shows the solar and lunar orbit with rise and set times.", ["location data", "date and time preferences", "device settings"]]]}, {"summary": "The mobile app from eMAG.bg offers easy access to a wide range of products for spontaneous and convenient shopping, with quick delivery, extended warranty options, online payment, and a user-friendly account interface for tracking orders and invoices.", "actions": [["The user orders a variety of products through the eMAG.bg app.", ["order history", "product preferences", "shipping address", "payment information"]], ["The user accesses a wide range of categories such as electronics, appliances, toys, books, music, movies, clothing, shoes, and accessories.", ["shopping preferences", "interests", "preferred categories"]], ["The user benefits from fast delivery, extended warranty, cash on delivery, online payment, 30-day return policy, and package inspection before payment.", ["delivery address", "payment information"]], ["The user can view their order history, invoices, warranties, favorite products list, and billing information in their eMAG account.", ["order history", "invoices", "warranties", "favorite products list", "billing information"]]]}, {"summary": "The mobile app offers easy taxi bookings, cashless payments, airport transfers, pre-booking options, in-app chat, and business travel solutions across multiple European countries.", "actions": [["The user pays for taxi rides using the app with various payment methods.", ["payment methods"]], ["The user books airport transfers 24/7 using FREENOW.", ["location", "payment information", "travel schedule"]], ["The user prebooks taxis up to 4 days in advance.", ["location", "travel dates", "contact information"]], ["The user communicates with drivers using the in-app chat feature.", ["messages", "location", "pickup/drop-off points", "user profile information"]], ["The user shares their taxi location with friends and family.", ["location data", "travel itinerary", "contact information"]], ["The user rates drivers and saves their favorite drivers.", ["driver ratings", "favorite drivers"]], ["The user saves their favorite addresses for quicker booking.", ["favorite addresses"]], ["The user uses FREENOW for Business to streamline expense reporting.", ["business trips", "expense reports", "payment methods", "corporate email"]]]}, {"summary": "The mobile app allows users to stream web-videos, online movies, livestreams, and live TV shows directly on LG Smart TVs without the need for an additional streaming box, with features such as multitasking, Full HD casting, and support for various video formats.", "actions": [["The user upgrades their LG TV to watch web-videos, online-movies, livestreams, and live-tv shows.", ["TV model", "watching preferences", "viewing history"]], ["The user browses through the web and streams any web-video, online-movie, livestream, or live-tv show on their LG Smart TV.", ["browsing history", "video preferences", "device information"]], ["The user sends the embedded video to their LG TV with a single tap.", ["video content", "device information"]], ["The user scans the QR Code shown on their TV or enters the IP Address of their Android device to connect.", ["IP Address", "Android device information"]], ["The user submits the Google Purchase ID for refunds within 24 hours after purchase.", ["Google Purchase ID", "refunds", "purchase timestamp"]], ["The user adds and manages bookmarks in the bookmarks menu or directly in the browser.", ["bookmarked websites", "interests", "reading preferences"]]]}, {"summary": "The mobile app allows users to plan and book tickets for buses, trains, flights, and ferries across Europe, the United States, and Canada, offering a convenient travel booking platform with a trip planner feature and support for various transportation companies.", "actions": [["The user buys tickets for buses, trains, and flights in Europe and beyond using the Omio app.", ["travel itinerary", "payment information", "location data", "email address"]], ["The user compares tickets for trains, buses, flights, and ferries in one simple search.", ["travel dates", "preferred departure locations", "preferred arrival locations"]], ["The user stores most of their train and bus tickets directly on their phone using the Omio app.", ["travel tickets", "travel preferences", "location data"]], ["The user explores different ways to travel and finds meaningful new journeys using the trip planner in the Omio app.", ["travel preferences", "destinations of interest", "travel history", "budget"]], ["The user books all their tickets in one place, including train, bus, flight, and ferry options.", ["travel tickets", "travel preferences", "payment information"]], ["The user interacts with the customer service team for support, including English customer service available 24/7.", ["language preferences", "time zone", "communication history"]], ["The user receives live trip updates and platform information for trains in Great Britain, SNCF trains, and National Express coaches.", ["location", "travel plans", "transportation preferences"]], ["The user books train tickets with various train companies such as National Rail, Eurostar, and Deutsche Bahn using Omio.", ["travel plans", "payment information", "email address", "location data"]], ["The user books bus and coach tickets with companies like Flixbus, Eurolines, and ALSA using Omio.", ["travel plans", "payment information", "location data"]], ["The user books flight tickets with airlines like Ryanair, EasyJet, and British Airways using Omio.", ["flight details", "payment information", "travel dates", "passenger names"]], ["The user books ferry tickets with companies like Balearia, Blue Star Ferries, and Stena Line using Omio.", ["travel destination", "payment information", "itinerary details", "contact information"]]]}, {"summary": "The mobile app offers an official uTorrent® Pro version for Android with ad-free torrent downloads, battery saving features, and the ability to manage and play media on the go.", "actions": [["The user upgrades to the Pro version of the uTorrent app.", ["payment information", "device information"]], ["The user can access media content from integrated music and video libraries.", ["music preferences", "video preferences"]], ["The user chooses the download location for added torrents.", ["download location", "torrents"]], ["The user downloads torrents and magnet links.", {"Personal data": ["downloaded torrents", "magnet links"]}], ["The user plays multiple music files from a torrent as a playlist.", {"Personal data": ["music preferences", "listening habits", "device information"]}], ["The user provides feedback via email to the uTorrent Mobile Team.", ["email address", "feedback content"]]]}, {"summary": "The mobile app offers Sports Betting, Slots, Bonuses, Live Tables, Virtuals, and more, with features like Cash Out, Bet Mentor, and Smart Notifications, while promoting Responsible Gaming practices.", "actions": [["The user places sports bets and plays slots on the app.", ["betting history", "gambling preferences", "payment information"]], ["The user participates in Betano's loyalty programme by completing missions and challenges.", ["user profile information", "completed missions", "challenges", "loyalty points earned"]], ["The user gets suggestions for football bets through the Bet Mentor feature.", ["betting preferences", "team preferences", "bet history", "bet outcomes"]], ["The user shares their bets with friends using the 'Share Your Bet' feature.", ["bet selections", "bet amounts", "bet outcomes", "friend list"]], ["The user receives smart notifications for match updates and bet settlements.", ["sports preferences", "betting activity", "match updates", "bet settlements"]], ["The user creates custom bets by combining different markets of the same match using the Bet Builder feature.", ["betting preferences", "bet history", "selected markets", "bet stake"]]]}, {"summary": "The mobile app offers a game where players can navigate obstacles by bouncing money, earn credits to unlock new games, and view current exchange rate equivalents of the earned credits, all for entertainment purposes only.", "actions": [["The user buys new games with the credits earned.", ["credits earned", "games purchased"]], ["The user sees the current exchange rate equivalents of the loan earned.", ["loan amount", "currency type", "exchange rates"]], ["The app clarifies that it is not a real money-making app.", {"Personal data": []}], ["The app declares that credits earned can only be used in-game.", ["earned credits", "in-game use only"]]]}, {"summary": "The mobile app offers all VTM channels in one convenient, free app for live or on-demand viewing, with the ability to watch up to 30 days back and access a kids' section.", "actions": [["The user downloads the VTM GO app.", ["device type", "IP address", "location", "time of download"]], ["The user watches missed episodes of their favorite programs.", ["favorite programs", "watch history"]], ["The user accesses a separate kid's world within VTM GO.", ["age", "parental consent status", "viewing preferences", "interactions within the kid's world"]], ["The user starts watching content on their preferred screen.", ["preferred screen", "watched content"]]]}, {"summary": "The mobile app provides core anatomy reference content with interactive 3D models of the human body, including organs, muscles, bones, and more, along with additional in-app purchases for physiology content and study tools.", "actions": [["The user accesses core anatomy reference content on their Android phone and tablet.", ["anatomy reference content", "device type"]], ["The user checks out in-app purchases for additional anatomy and physiology content.", ["in-app purchases", "anatomy and physiology content"]], ["The user views full female and male 3D models to study gross anatomy.", ["gender", "interest in anatomy", "preferred learning method"]], ["The user studies 3D views of key organs at multiple levels.", ["medical interests", "study habits", "organ anatomy", "levels of anatomy understanding"]], ["The user learns muscle actions, bone landmarks, attachments, innervations, and blood supply.", {"Personal data": ["muscle actions", "bone landmarks", "attachments", "innervations", "blood supply"]}], ["The user explores and educates with patient education animations covering key physiology and common pathologies.", ["medical conditions", "physiology knowledge", "educational interests"]], ["The user accesses 3D Dental Anatomy content including cusps, fossae, surfaces, and cross-sectional views.", ["dental anatomy", "cusps", "fossae", "surfaces", "cross-sectional views"]], ["The user organizes content by browsing or searching by topic and region.", ["search history", "browsing history", "topics of interest", "preferred regions"]], ["The user dissects models on screen, in augmented reality (AR), and in cross-sections.", {"Personal data": ["3D models", "augmented reality usage", "cross-sectional views", "interests in models"]}], ["The user takes 3D dissection quizzes and checks their progress.", ["anatomy knowledge", "quiz results", "learning progress"]], ["The user makes interactive 3D presentations linking sets of models to explain and review a topic.", ["3D presentations", "models", "topic of explanation", "reviewed topic"]], ["The user labels structures with tags, notes, and 3D drawings in presentations.", ["presentation content", "tagged structures", "notes", "3D drawings"]], ["The user shares content with patients, classmates, students, and colleagues.", ["content", "patient data", "classmate data", "student data", "colleague data"]]]}, {"summary": "The mobile app is a watch face for Wear OS devices with customizable colors, animations, multilanguage date, and always on display mode.", "actions": [["The user customizes the watch face with different colors.", ["watch face colors"]], ["The user sets the date to display in multiple languages.", ["preferred languages", "timezone", "cultural preferences"]], ["The user enables the always-on display mode.", ["display settings"]], ["The user leaves feedback and wishes for the app.", ["feedback", "wishes", "user preferences"]]]}, {"summary": "The mobile app is a powerful scanner application that allows you to easily digitize documents, optimize scan quality, extract text, manage files securely, search documents, and edit scans and PDFs efficiently.", "actions": [["The user scans and digitizes various paper documents using the device's camera.", ["documents", "personal information", "financial records", "identifying information"]], ["The app optimizes the scan quality by applying intelligent clipping and automatic enhancement functions.", ["scanned documents", "image quality preferences", "clipping preferences", "enhancement preferences"]], ["The user creates PDFs, shares, prints, and adds text, watermark, mosaic, graffiti, etc. to scanned documents.", ["scanned documents", "PDFs", "text added", "watermark added", "mosaic added", "graffiti added"]], ["The app extracts text from scans/PDFs using Optical Character Recognition (OCR) technology.", ["scans", "PDFs", "extracted text"]], ["The user manages and protects important files using the app's portable filing cabinet feature.", ["important files", "security settings", "file organization preferences"]], ["The user performs full-text searches on scanned copies and documents through keywords.", ["scanned copies", "documents", "search keywords"]], ["The user edits scanned copies by adding text, watermark, mosaic, texture, and signature.", ["scanned copies", "text", "watermark", "mosaic", "texture", "signature"]], ["The user utilizes the powerful PDF editing tool in the app for tasks like conversion, image clipping, signatures, printing, and merging.", ["PDF files", "images", "signatures", "printing preferences"]]]}, {"summary": "The mobile app enables easy and secure sign-ins for all online accounts using multi-factor authentication, passwordless login, and password autofill, supporting Microsoft as well as non-Microsoft accounts, and offering additional account management options for personal, work, or school accounts.", "actions": [["The user signs in to their online accounts using multi-factor authentication, passwordless, or password autofill.", ["login credentials", "authentication method preferences", "device information"]], ["The user sets up multi-factor authentication to provide an additional layer of security for their accounts.", ["account information", "authentication method", "device information"]], ["The user approves notifications sent to the Microsoft Authenticator app for verification.", ["verification notifications", "Microsoft Authenticator app usage"]], ["The user adds multiple accounts to the app, including non-Microsoft accounts like Facebook, Amazon, Dropbox, Google, LinkedIn, GitHub, and more.", ["email addresses", "usernames", "account information", "profile pictures"]], ["The user logs in to their Microsoft account using their phone for passwordless authentication.", ["phone number", "Microsoft account", "authentication method"]], ["The user uses their fingerprint, face ID, or PIN for two-step verification in the authentication process.", ["biometric data", "PIN"]], ["The user accesses Microsoft products and services after signing in with two-factor authentication.", ["Microsoft account information", "authentication method", "device information"]], ["The user autofills passwords using the Microsoft Authenticator app.", {"Personal data": ["passwords"]}], ["The user syncs passwords, including those saved in Microsoft Edge, by signing in with their personal Microsoft account.", {"Personal data": ["passwords", "Microsoft account"]}], ["The user makes Microsoft Authenticator the default autofill provider on their mobile device.", ["mobile device information", "authentication preferences", "usage data"]], ["The user imports passwords from Google Chrome and other password managers into the app.", ["passwords", "login credentials", "website names"]], ["The user registers their device to their organization through the app and adds their work or school account.", ["device information", "work/school account", "organization information"]], ["The user accesses additional Microsoft apps and services seamlessly and securely without needing to log in each time.", {"Personal data": []}], ["The user grants optional access permissions to the Microsoft Authenticator app for services that require such permissions.", ["access permissions", "Microsoft Authenticator app"]], ["The user uses the Accessibility Service option to support Autofill on more apps and sites.", ["apps used", "websites visited", "Autofill preferences", "device settings"]], ["The user allows location access when required by their organization for accessing certain resources.", ["location data"]], ["The user scans QR codes using the camera feature when adding accounts.", ["QR codes", "account information"]], ["The user reports technical problems through the app settings, allowing information from storage to be collected for diagnosis.", ["device information", "app settings", "storage data"]]]}, {"summary": "The mobile app is an interactive digital watch face for Wear OS that features customizable data fields, interactive character animations based on step count, weather information, and various customization options.", "actions": [["The user installs the Platinum Digital Watch Face app on their Wear OS device.", ["Wear OS device information", "app installation data"]], ["The user invokes the customization mode to select 'WEATHER' for custom data.", ["location", "weather preferences", "custom data settings"]], ["The user interacts with the interactive character animation that changes based on their step count.", ["step count", "physical activity level", "animation preferences"]], ["The user customizes the watch face by selecting data fields like weather, time zone, sunset/sunrise, and more.", ["location", "time zone", "weather preferences", "sunset/sunrise times"]], ["The user purchases the watch face to receive a free coupon code for another watch face.", ["purchase history", "watch faces preferences", "coupon code preferences"]], ["The user writes a comment on the Play Store to qualify for the free coupon code.", ["opinions", "feedback", "email address"]], ["The user sends a screenshot and desired watch face to the specified email address to receive the coupon code.", ["screenshot", "desired watch face", "email address"]], ["The user signs up for the newsletter to stay updated with new watch faces and promotions.", ["email address", "name", "watch preferences"]]]}, {"summary": "The mobile app provides core anatomy reference content, including 3D interactive visual models of the human body, key organs, muscles, bones, and additional physiology and pathology education animations, with tools for study, presentations, and sharing.", "actions": [["The user views female and male 3D models to study gross anatomy.", ["3D models", "gender identity", "study interests"]], ["The user studies the lungs, bronchi, and alveoli using 3D views of key organs.", ["medical interests", "anatomy knowledge"]], ["The user learns muscle actions and bone landmarks using muscle and bone models that can be moved.", ["muscle actions", "bone landmarks", "muscle models", "bone models"]], ["The user explores and educates with more than 100 patient education animations covering key physiology and common pathologies.", ["health information", "medical conditions", "learning preferences"]], ["The user studies 3D Dental Anatomy, including cusps, fossae, and surfaces, with cross-sectional views of various teeth.", ["dental anatomy", "cusps", "fossae", "surfaces", "teeth", "study habits"]], ["The user takes 3D dissection quizzes to check their progress.", ["quiz results", "learning progress", "user actions"]], ["The user makes interactive 3D presentations linking sets of models to explain and review a topic.", ["3D presentations", "models", "topic of interest"]]]}, {"summary": "The mobile app allows you to conveniently access various functionalities such as mobile payment for fuel and products/services, using VITAY points for discounts, navigation to the nearest station, browsing transaction history, and staying updated on ORLEN events and promotions.", "actions": [["The user finds their VITAY card in the app on their phone.", ["VITAY card", "personal identification number"]], ["The user can use VITAY points to get discounts in the online ORLEN VITAY store.", ["VITAY points", "discounts", "online purchases", "shopping preferences"]], ["The user can collect points faster for desired products with attractive coupons.", ["shopping preferences", "desired products", "collected points", "coupon usage"]], ["The user can view their VITAY transaction history, including current balance and point changes.", ["transaction history", "current balance", "point changes"]], ["The user can benefit from KDR and Biznes Tank discounts.", ["membership status", "purchase history", "user preferences"]], ["The user can stay up-to-date with events and promotions organized by ORLEN through the news section.", ["location", "interests", "promotions preferences"]], ["The user can explore the Stop Cafe offer and current promotions in the store.", ["location", "purchase history", "preferences", "current location"]]]}, {"summary": "The mobile app is a versatile QR and Barcode Scanner that offers fast, easy scanning, QR code generation, and additional features like scanning WiFi QR codes, all for free on Android devices.", "actions": [["The user generates their own QR codes with the app.", ["generated QR codes"]], ["The user compares prices by scanning product barcodes.", ["product names", "prices", "barcode data"]], ["The user scans WiFi QR codes to connect to wireless networks.", ["WiFi network information"]], ["The user exports scanned data as .csv or .txt files.", {"Personal data": ["scanned documents", "file format preference"]}], ["The user adds scanned QR codes to favorites for easy access.", ["scanned QR codes", "favorite items"]], ["The user shares contact information via QR codes.", ["name", "phone number", "email address", "social media profiles"]], ["The user changes the color and theme of the app.", ["color preferences", "theme preferences"]], ["The user uses dark mode in the app.", ["user interface preference"]], ["The user scans multiple QR codes at once using Batch scan mode.", ["scanned QR codes"]], ["The user scans QR codes from images in the gallery.", ["images", "location data"]], ["The user shares images from other apps to scan with the QR code scanner.", ["images", "scanned QR codes", "device information"]], ["The user imports .csv files for scanning QR codes.", [".csv files", "QR codes"]]]}, {"summary": "The mobile app allows users to explore a virtual school environment, featuring five locations, 34 characters, and various activities such as teaching classes, engaging in food fights, and playing in the youth club.", "actions": [["The user picks a locker in the school building.", ["school building location", "locker number"]], ["The user has a food fight in the cafeteria.", ["food preferences", "physical location"]], ["The user mixes colorful liquids in the chem lab.", ["chemicals used", "experiment results"]], ["The user plays pool, ping-pong, or instruments in the youth club.", ["activities in the youth club", "preferred games or instruments"]], ["The user learns to play the epic keytar and starts a band in the youth club.", ["music instrument preferences", "band participation", "youth club membership"]]]}, {"summary": "The mobile app allows users to track deliveries, process returns, contact customer service, and browse various webshops and products to find deals from favorite brands.", "actions": [["The user views information about their deliveries.", ["delivery status", "delivery location", "tracking numbers"]], ["The user handles returns for their deliveries.", ["delivery orders", "purchase history", "return reasons"]], ["The user contacts the customer service team.", ["contact information", "previous interactions", "issue details"]], ["The user finds great deals from their favorite brands.", ["favorite brands", "purchase history", "shopping preferences"]]]}]