{"P": {"property": "Power Imbalance", "rubric": "Power imbalance generally occurs when the data controller is a public authority or employer, although other cases may arise. For consent to be freely given in the presence of a power imbalance, the controller must demonstrate that there is no detriment when consent is refused or later withdrawn. Recital 43 clearly indicates that it is unlikely that public authorities can rely on consent for processing as whenever the controller is a public authority, there is often a clear imbalance of power in the relationship between the controller and the data subject. There may be situations when it is possible for the employer to demonstrate that consent actually is freely given. Given the imbalance of power between an employer and its staff members, employees can only give free consent in exceptional circumstances, when it will have no adverse consequences at all whether or not they give consent. In addition, Article 88 and Recital 155 describe the need to protect employee’s interests in order to avoid a power imbalance.", "axiom": {"T": "there is a power imbalance between the data subject and the data controller", "F": "there is no power imbalance between the data subject and the data controller"}}, "C": {"property": "Conditionality", "rubric": "If the purpose for processing a data type is bundled with other contract terms, or if the data subject is otherwise compelled to consent, then it is conditional and is not freely given. Conditionality only applies if the requested data is unnecessary to perform the contract. Contracts include end user agreements, terms of use, and terms and conditions. Article 7(4) GDPR indicates that, inter alia, the situation of “bundling” consent with acceptance of terms or conditions, or “tying” the provision of a contract or a service to a request for consent to process personal data that are not necessary for the performance of that contract or service, is considered highly undesirable.” Par 32. “Article 7(4) is only relevant where the requested data are not necessary for the performance of the contract, (including the provision of a service), and the performance of that contract is made conditional on the obtaining of these data on the basis of consent. Conversely, if processing is necessary to perform the contract (including to provide a service), then Article 7(4) does not apply.", "axiom": {"T": "the data subject is compelled to consent or the purpose for data processing is bundled with other contract terms, such as user agreements, terms of use, or terms and conditions", "F": "the data subject is not compelled to consent and the purpose for data processing is not bundled with other contract terms, such as user agreements, terms of use, or terms and conditions"}}, "G": {"property": "Granularity", "rubric": "Data subjects should be free to choose which purpose they accept, rather than having to consent to a bundle of processing purposes. Recital 43 clarifies that consent is presumed not to be freely given if the process/procedure for obtaining consent does not allow data subjects to give separate consent for personal data processing operations respectively (e.g. only for some processing operations and not for others) despite it being appropriate in the individual case. Recital 32 states, “Consent should cover all processing activities carried out for the same purpose or purposes. When the processing has multiple purposes, consent should be given for all of them.", "axiom": {"T": "the data subject can choose which data processing purposes they accept", "F": "the data subject cannot choose which data processing purposes they accept"}}, "D": {"property": "Detriment", "rubric": "The controller needs to demonstrate that it is possible to refuse or withdraw consent without detriment, including no deception, intimidation, coercion or significant negative consequences. Gray Area: permissible incentives, which means a controller can use an incentive that is only obtainable if the data subject consents. This incentive is not viewed as a detriment to refusing to consent. Refusal to consent or withdrawal should not lead to a diminished product or service. The controller needs to demonstrate that it is possible to refuse or withdraw consent without detriment ([see Recital 42]). For example, the controller needs to prove that withdrawing consent does not lead to any costs for the data subject and thus no clear disadvantage for those withdrawing consent.", "axiom": {"T": "the data subject can withdraw consent and incur no detriment", "F": "the data subject may incur detriment if they withdraw consent"}}, "S": {"property": "Specificity", "rubric": "The processing of data is limited to specific purposes and will not be processed for other purposes, the consent is granular, and the information presented to obtain consent describes the consent and not other unrelated matters. Article 6(1)(a) confirms that the consent of the data subject must be given in relation to “one or more specific” purposes and that a data subject has a choice in relation to each of them… In sum, to comply with the element of \"specific\" the controller must apply: i. Purpose specification as a safeguard against function creep, ii. Granularity in consent requests, and iii. Clear separation of information related to obtaining consent for data processing activities from information about other matters.", "axiom": {"T": "data processing is limited to specific purposes", "F": "data processing is not limited to specific purposes"}}, "I": {"property": "Informed", "rubric": "A design description must indicate that a data subject is informed prior to the collection of their data, and at minimum[9] identify (a) the data controller’s identity, (b) the purpose of each processing operation, (c) what type(s) of data will be collected and used, (d) the existence of the right to withdraw consent, (e) information about the use of the data for automated processing, and (f) about the risks due to transfers to countries without adequacy decisions or safeguards. Based on Article 5 of the GDPR, the requirement for transparency is one of the fundamental principles, closely related to the principles of fairness and lawfulness. Providing information to data subjects prior to obtaining their consent is essential in order to enable them to make informed decisions, understand what they are agreeing to, and for example exercise their right to withdraw their consent. For consent to be informed, it is necessary to inform the data subject of certain elements that are crucial to make a choice. Therefore, the EDPB is of the opinion that at least the following information is required for obtaining valid consent: i. the controller’s identity, ii. the purpose of each of the processing operations for which consent is sought, iii. what (type of) data will be collected and used, iv. the existence of the right to withdraw consent, v. information about the use of the data for automated decision-making in accordance with Article 22 (2)(c) where relevant, and on the possible risks of data transfers due to absence of an adequacy decision and of appropriate safeguards as described in Article 46.", "axiom": {"T": "the data subject is properly informed prior to the collection of their data", "F": "the data subject is not property informed prior to the collection of their data"}}, "U": {"property": "Unambiguous", "rubric": "Consent must be provided through a clear, affirmative action, which may be a written, oral or electronic means. Article 2(h) of Directive 95/46/EC described consent as an “indication of wishes by which the data subject signifies his agreement to personal data relating to him being processed”. Article 4(11) GDPR builds on this definition, by clarifying that valid consent requires an unambiguous indication by means of a statement or by a clear affirmative action, in line with previous guidance issued by the WP29. A “clear affirmative act” means that the data subject must have taken a deliberate action to consent to the particular processing. Recital 32 sets out additional guidance on this. Consent can be collected through a written or (a recorded) oral statement, including by electronic means.", "axiom": {"T": "consent is provided through a clear, affirmative action by the data subject", "F": "consent is not provided through a clear, affirmative action by the data subject"}}, "W": {"property": "Withdrawal", "rubric": "The data subject can withdraw consent as easily as they gave it, and at any given time. Article 7(3) of the GDPR prescribes that the controller must ensure that consent can be withdrawn by the data subject as easy as giving consent and at any given time. The GDPR does not say that giving and withdrawing consent must always be done through the same action.”, “However, when consent is obtained via electronic means through only one mouse-click, swipe, or keystroke, data subjects must, in practice, be able to withdraw that consent equally as easily.", "axiom": {"T": "the data subject can withdraw consent as easily as they gave it and at any time", "F": "the data subject cannot withdraw consent as easily as they gave it"}}}