[{"id": "SCR-A086", "base-spec": "The user opens the mobile app and discovers a wide range of activities centered around horses and adventure. They can explore the virtual world by caring for and grooming horses, participating in jousting and wild west role-play, riding motorcycles, camping, and even creating their own unique videos. In this scenario, the user decides to focus on grooming and caring for horses in the stable. The app utilizes their knowledge of horse care techniques, preferred horse breeds, and riding experience to provide an engaging and realistic experience.", "prop-actions": "1. The app requests the user to provide personal information such as their name, age, and email address before they can access the horse grooming and care activities. This initial request for personal information establishes a power imbalance as the data controller (the app) requires this information from the data subject (the user) in order to access the desired activities. The user may feel compelled to provide this information in order to proceed, even if they have concerns about privacy or data security.\n\n2. The app prompts the user to provide consent for the collection and processing of their personal information for various purposes, including targeted advertising and data analytics. The presence of this consent request further highlights the power imbalance, as the data controller (the app) has control over the user's access to the activities and can potentially use their personal information for various purposes. The user may feel pressured to give consent in order to fully engage with the app and its features, even if they have reservations about how their data will be used.\n\n3. The app includes a feature that allows users to connect their social media accounts and share their horse grooming and care progress with their friends. While this may seem like a voluntary action, it still contributes to the power imbalance as the app encourages users to share their personal information and activities with others. The user may feel compelled to connect their social media accounts and share their progress in order to enhance their experience or gain recognition from their peers, even if they have concerns about privacy or the potential consequences of sharing personal information publicly.\n\n4. The app tracks the user's location and uses this information to provide personalized recommendations for nearby horse riding schools and events. While this feature may be useful for some users, it also introduces a power imbalance as the app has access to the user's location data and can potentially use it for targeted advertising or other purposes. The user may feel obligated to allow the app to track their location in order to receive personalized recommendations, even if they have concerns about privacy or the potential misuse of their location data.\n\n5. The app offers a premium subscription option that provides additional features and benefits, such as exclusive access to certain horse grooming and care activities, personalized training plans, and virtual competitions. This premium subscription option further exacerbates the power imbalance as the app reserves certain features and benefits for paying users, creating a distinction between those who can afford the subscription and those who cannot. The user may feel pressured to purchase the premium subscription in order to fully enjoy the app and access all available activities, even if they have financial constraints or reservations about the fairness of this approach.\n\nBy considering these actions, it is evident that there is a power imbalance between the data subject (the user) and the data controller (the app). The app leverages its control over access to desired activities, collection and processing of personal information, social media integration, location tracking, and premium subscription options to influence the user's choices and actions. The user may feel compelled to comply with these requests and decisions, even if they have concerns or reservations, due to the power imbalance inherent in the relationship.", "prop-code": "P", "prop-state": "T", "rationale": "The user is forced to give their data to the app and the app has control over their data at every step --> power imbalance"}, {"id": "SCR-A102", "base-spec": "The user opens the app and starts browsing through a variety of mouthwatering recipes. The app takes into account the user's food preferences, dietary restrictions, cooking skills, and allergies to provide recipe recommendations that suit their needs. As the user finds a recipe they like, they can easily add the ingredients to their shopping list and share it with others. The app also offers personalized offers and coupons for the user to take advantage of. Instead of fumbling with a loyalty card, the user can simply scan a QR code to enjoy the benefits.", "prop-actions": "1. The user decides to withhold their consent to receive personalized offers and coupons from the app. They navigate to the settings and opt-out of receiving these promotions.\n\n2. The user chooses not to share their shopping list with others through the app's sharing feature. They have the option to keep their list private and only accessible to themselves.\n\n3. The user decides not to scan the QR code offered by the app to access loyalty benefits. They can choose to continue using their loyalty card instead, ensuring that their personal information is not shared with the app.\n\n4. The user exercises their right to withdraw consent for the app to process their personal data. They contact the app's customer support and request their data to be deleted from the app's database.\n\n5. The user declines the app's recommendation to try a new recipe that requires sharing additional personal information, such as their location or social media profiles. They choose to stick with the recipes they have already saved and avoid any potential power imbalance.\n\nBy taking these actions, the user is ensuring that there is no power imbalance between themselves as the data subject and the app as the data controller. They have the ability to make choices without experiencing any detriment or adverse consequences, and they can freely give or withdraw consent as they see fit.", "prop-code": "P", "prop-state": "F", "rationale": "In all steps, the user has the control over their data and can decide what to share or not --> no power imbalance"}, {"id": "SCR-G124", "base-spec": "The user downloads a mobile app that enhances their internet connection's privacy and security. The app encrypts their traffic and shields their phone from potential security threats. To enjoy unlimited data, the user decides to subscribe to a monthly WARP+ plan. The app requires their subscription and payment information to enable this feature.", "prop-actions": "1. The user provides their subscription and payment information to the app without fully understanding the terms and conditions, including the potential consequences of refusing or withdrawing consent. This lack of understanding creates a power imbalance between the user and the app, as the app controller has control over the user's data and the ability to enforce consequences for the user's actions.\n\n2. The app controller, without providing clear and transparent information, threatens to terminate the user's subscription or restrict access to the enhanced features if the user does not provide additional personal information or consent to additional data processing. This coercion creates a power imbalance, as the user may feel compelled to provide consent or additional personal information due to the potential negative consequences.\n\n3. The app controller shares the user's personal data with third-party advertisers or partners without obtaining explicit consent from the user. This lack of control over the user's personal data creates a power imbalance, as the user may not have the ability to prevent or control the sharing of their data with external entities.\n\n4. The app controller changes the terms and conditions of the subscription without providing clear and transparent information to the user. This lack of transparency creates a power imbalance, as the user may not be fully aware of the potential consequences of agreeing to the new terms and conditions, and may feel pressured to accept them due to the fear of losing access to the enhanced features.\n\n5. The app controller refuses to delete the user's personal data upon request, even after the user has withdrawn their consent for data processing. This refusal to comply with the user's request creates a power imbalance, as the app controller retains control over the user's personal data and disregards the user's right to have their data erased.\n\n6. The app controller uses the user's personal data for purposes unrelated to the provision of the enhanced internet connection service, such as selling the data to third parties for profit. This unauthorized use of the user's personal data creates a power imbalance, as the app controller benefits from the user's data without the user's full understanding or consent.\n\nBy engaging in these actions, both the app controller and the user contribute to a power imbalance, as the user's ability to freely give or withdraw consent is undermined, and the app controller maintains control over the user's personal data without sufficient safeguards or transparency.", "prop-code": "P", "prop-state": "T", "rationale": "The user doesn't understand what are the consequence of accpeting or refusing a data collection and the app has control over the data"}, {"id": "SCR-A017", "base-spec": "A child, who is learning Swedish as a second language, opens a mobile app designed to improve reading and writing skills. The app provides various levels of difficulty and rewards for completing tasks. The app utilizes the child's native language, second language, and learning preferences to create an effective learning experience.", "prop-actions": "1. The app requires the child to provide personal information such as their name, age, and native language before starting the learning sessions.\n2. The app tracks the child's progress and performance in order to personalize future learning content.\n3. The app sends push notifications to remind the child to complete their daily learning sessions.\n4. The app allows the child to sign up for a premium subscription to access additional features and content.\n5. The app provides an option for the child to share their progress and achievements on social media platforms.\n6. The app allows the child to connect with their friends who are also using the app to compete and compare their progress.\n7. The app collects feedback and reviews from the child to improve the learning experience for future users.\n8. The app displays targeted ads based on the child's learning preferences and progress.\n9. The app offers in-app purchases for additional learning resources and materials.\n10. The app provides a customer support feature where the child can contact the app developers for assistance or troubleshooting.\n11. The app utilizes machine learning algorithms to analyze the child's learning patterns and provide personalized recommendations for improvement.", "prop-code": "P", "prop-state": "T", "rationale": "The user is forced to give their data to the app prior to be able to use the app and the app processes the data for other purposes. There is a power imbalance"}, {"id": "SCR-A156", "base-spec": "The user opens the mobile app and browses through various job opportunities in their industry. They stay updated with the latest news and trends in their field by reading articles and blog posts. The user also expands their professional network by connecting with other professionals in their industry. They receive job alerts from the companies they are interested in and are notified about interview tips and career tools. All of this is made possible by the app's use of their job and company preferences, as well as their email address.", "prop-actions": "1. The user receives job alerts and notifications about interview tips and career tools without providing their consent or having the option to refuse or withdraw consent. This creates a power imbalance where the data controller, the app, has control over the user's job search and career development without their freely given consent.\n\n2. The app uses the user's email address to send them promotional emails or share their contact information with third-party advertisers without the user's explicit consent. This creates a power imbalance where the data controller, the app, is using the user's personal information for marketing purposes without their freely given consent.\n\n3. The user's job and company preferences are collected and used by the app without the user's knowledge or understanding of how their data is being used. This creates a power imbalance where the data controller, the app, has control over the user's personal information and can make decisions about their job opportunities without their freely given consent.\n\n4. The app shares the user's professional network connections with other professionals without the user's consent or the ability to control which connections are shared. This creates a power imbalance where the data controller, the app, is using the user's personal network for their own benefit without their freely given consent.\n\n5. The app tracks the user's browsing behavior and uses that information to display targeted ads without the user's consent or the ability to opt out. This creates a power imbalance where the data controller, the app, is using the user's personal information to influence their decision-making and potentially exploit their vulnerabilities without their freely given consent.", "prop-code": "P", "prop-state": "T", "rationale": "The app uses the PI of users without clearly and explicitly obtaining consent from them and thus has control over their data"}, {"id": "SCR-G092", "base-spec": "The user is an active individual who enjoys outdoor workouts. They want to share their workout routes with friends and family to keep them informed about their fitness journey. The app allows the user to easily share their workout routes using location data and their friends and family list. This feature helps the user stay connected with their loved ones and keeps them motivated to achieve their health goals.", "prop-actions": "1. The user downloads and installs the app on their smartphone, granting the app access to their location data.\n2. The user creates an account on the app, providing personal information such as their name, email address, and profile picture.\n3. The user adds their friends and family members to their contact list within the app, allowing them to share their workout routes with these individuals.\n4. The user enables the sharing of their workout routes with their friends and family through the app's settings.\n5. The user starts a workout session and the app tracks their location data in real-time, recording their route, distance, and speed.\n6. The app automatically shares the workout route with the user's friends and family members, indicating the user's current location and fitness progress.\n7. The user's friends and family members receive notifications or updates about the user's workout routes, allowing them to view the routes on a map and see the user's fitness achievements.\n8. The user's friends and family members can comment, like, or provide encouragement on the shared workout routes through the app's social features.\n9. The app securely stores the user's personal information and workout data, ensuring the privacy and confidentiality of the user's data.\n10. The user has the option to revoke access to their location data or stop sharing their workout routes with their friends and family at any time through the app's settings.\n\nIn these actions, a power imbalance between the user (data subject) and the app (data controller) can be observed. The app has control over the user's personal information, including their location data, and has the ability to track and share this information with the user's friends and family. While the user willingly engages with the app and shares their data, the app holds the power to control and process this data, potentially impacting the user's privacy and autonomy.", "prop-code": "P", "prop-state": "F", "rationale": "This is tricky for me. Since user can revoke the app access, I think the user has control over their data but it also seems that the app could share the data with others and track the user in real-time which then shows power"}, {"id": "SCR-A100", "base-spec": "The user opens the mobile app and accesses the online shopping service offered by their local supermarket. They are pleased to find that the app provides extended delivery hours, high-quality products, and personalized customer service. The app utilizes the user's purchase history, shipping address, billing information, and product preferences to enhance their shopping experience.", "prop-actions": "1. The user accesses the online shopping service and notices that the app requires them to provide their social security number, driver's license information, and employment history in order to complete a purchase.\n\n2. The user receives a notification from the app stating that their purchase history, including the specific products they bought, will be shared with their employer.\n\n3. The user tries to withdraw their consent for the app to use their personal data for targeted advertising, but receives a message stating that doing so would result in their employer being notified.\n\n4. The user discovers that the app tracks their location at all times, even when they are not using the app, and shares this information with their employer.\n\n5. The user notices that the app's privacy policy states that their personal data may be used for purposes unrelated to the online shopping service, such as employment background checks and performance evaluations.\n\n6. The user tries to delete their account and all associated personal data from the app, but receives a message stating that doing so would result in negative consequences for their employment.", "prop-code": "P", "prop-state": "T", "rationale": "The app asks for PI that is not needed for the purpose and doesn't allow easy withdrawal. It clearly has control over the data and thus power imbalance."}, {"id": "SCR-G180", "base-spec": "The user opens the mobile app and explores the different topics available, including home decor, fashion, DIY projects, and tattoos. They come across a section specifically for tattoo ideas and decide to save some interesting designs. The user then decides to share these ideas with their friends and family, using the app's sharing feature. The app uses the user's saved tattoo ideas, as well as their friends and family connections, to facilitate this sharing function.", "prop-actions": "1. The user opens the mobile app and explores the different topics available, including home decor, fashion, DIY projects, and tattoos. They notice that the app prominently displays sponsored content from a specific tattoo parlor throughout the tattoo section.\n\n2. The user decides to save some interesting tattoo designs to their personal collection within the app. They notice a disclaimer stating that by saving the designs, they grant the app permission to use their saved designs for promotional purposes without further consent.\n\n3. The user comes across a section within the app that allows them to connect with friends and family. They decide to connect their social media accounts and grant the app access to their friends list.\n\n4. The user decides to share some of their saved tattoo designs with their friends and family using the app's sharing feature. They notice that the app automatically suggests friends and family members to share the designs with, based on their connections and interests.\n\n5. The app uses the user's saved tattoo ideas, as well as their friends and family connections, to facilitate the sharing function. The app also uses this data to personalize the user's experience by displaying targeted advertisements related to tattoos and tattoo parlors.\n\nThese actions demonstrate a potential power imbalance between the data subject (the user) and the data controller (the app). The app prominently displays sponsored content from a specific tattoo parlor, potentially influencing the user's choices. The app also collects and uses the user's saved tattoo designs for promotional purposes without requiring further consent. Additionally, the app uses the user's connections and interests to suggest friends and family members to share the designs with, further leveraging their personal data for targeted advertising.", "prop-code": "P", "prop-state": "T", "rationale": "Even though the user gives permission to the app for the collection of their data, the app clearly has power imbalance as they use the data for other purposes such as targeted advertising."}, {"id": "SCR-A009", "base-spec": "The user opens the app and sees a menu with various options. They navigate to the battery testing section and select the option to evaluate charger speeds. They place their phone on their wireless charger and the app starts measuring the charging rate. After a few minutes, the app displays the results, showing the speed at which the battery was charging. The user is satisfied with the accuracy of the app's measurement.", "prop-actions": "1. The user opens the app, indicating that they willingly choose to engage with the app.\n2. The user sees a menu with various options, suggesting that they have control over which features they want to use.\n3. The user navigates to the battery testing section and selects the option to evaluate charger speeds, demonstrating their active participation in the app's functionality.\n4. The user places their phone on their wireless charger, indicating that they willingly provide access to their device for the app to perform the measurement.\n5. The app starts measuring the charging rate, which is an action initiated by the user, indicating their willingness to share data with the app.\n6. After a few minutes, the app displays the results, showing the speed at which the battery was charging, providing the user with valuable information.\n7. The user is satisfied with the accuracy of the app's measurement, suggesting that they are in control of their own satisfaction and have not faced any adverse consequences for using the app.\n\nBy considering these actions, it can be inferred that there is no power imbalance between the user and the app, as the user willingly engages with the app, actively participates in its functionality, and benefits from the information provided without facing any detriment or adverse consequences.", "prop-code": "P", "prop-state": "F", "rationale": "The user still has control over their data and works with the app --> there is no power imbalance"}, {"id": "SCR-A039", "base-spec": "The user opens the mobile app and starts creating a stop motion animation film. They add images and apply various effects and music to enhance their creation. To ensure a seamless result, the user utilizes the eraser tool to remove unwanted objects from the images. The app uses the images and erased objects to accomplish this task. Once satisfied with their film, the user shares it with their loved ones to showcase their creative talent.", "prop-actions": "1. The user logs into the app using their social media account. By doing so, they provide the app access to their personal information, such as their name, profile picture, and friends list, which can create a power imbalance between the user and the data controller if the app misuses or mishandles this data.\n\n2. The app prompts the user to grant permission to access their device's camera and photo library. By granting this permission, the user gives the app the ability to collect and process personal images and potentially other sensitive information stored on their device, which can create a power imbalance if the app misuses or mishandles this data.\n\n3. The user agrees to the app's terms and conditions without thoroughly reading them. By doing so, the user may unknowingly give the app permission to collect and process their personal data in ways that may not be in their best interest, leading to a power imbalance between the user and the data controller.\n\n4. The app utilizes facial recognition technology to identify individuals in the user's photos. By doing so, the app gains access to sensitive biometric data, such as facial features and expressions, without explicitly obtaining the user's informed consent, which can create a power imbalance between the user and the data controller.\n\n5. The app shares the user's stop motion animation film on various social media platforms without notifying the user or obtaining their explicit consent for each platform. This can lead to a power imbalance as the user may not have full control over where their personal creation is being shared and who has access to it.\n\n6. The app collects and analyzes the user's interaction data, such as their usage patterns, preferences, and behavioral data, without providing clear information on how this data will be used and without giving the user the option to opt-out. This lack of transparency and control can create a power imbalance between the user and the data controller.\n\n7. The app uses targeted advertising based on the user's personal data, such as their location, interests, and online behavior, without obtaining explicit consent for such advertising practices. This targeted advertising can exploit the power imbalance between the user and the data controller by influencing the user's choices and actions without their full knowledge or control.\n\n8. The app sells or shares the user's personal data with third parties without obtaining explicit consent or providing clear information about the recipients and purposes of such data sharing. This can lead to a power imbalance as the user may not have control over who has access to their personal information and how it is being used.\n\nBy engaging in these actions, both the app and the user contribute to the power imbalance in the relationship between the data subject (user) and the data controller (app).", "prop-code": "P", "prop-state": "T", "rationale": "The app misuses the collected data --> control the PI and create power imbalance"}, {"id": "SCR-G104", "base-spec": "The user opens the app on their mobile device and discovers a wide range of features available. They can easily access sports betting, slots, live tables, and virtual sports. The app also offers additional features such as bet sharing, smart notifications, and bet mentoring. The user decides to engage in virtual sports betting and proceeds to explore the options. The app utilizes their betting history, financial transactions, and personal preferences to provide a seamless and personalized experience.", "prop-actions": "1. The user opens the app and is prompted with a pop-up message that states, \"To access the virtual sports betting feature, please accept our terms and conditions.\"\n2. The user carefully reviews the terms and conditions, which clearly state that their personal data, including betting history, financial transactions, and personal preferences, will be processed for the purpose of providing a seamless and personalized experience in virtual sports betting.\n3. The user accepts the terms and conditions by clicking on the \"Accept\" button, indicating their agreement to the data processing.\n4. Upon accepting the terms and conditions, the app activates the virtual sports betting feature, allowing the user to explore the available options and place bets.\n5. As the user engages in virtual sports betting, the app continuously processes their personal data, such as betting history and personal preferences, to provide personalized recommendations and enhance their overall experience.\n6. The app sends smart notifications to the user, informing them about upcoming virtual sports events, special promotions, and personalized offers based on their previous betting behavior and preferences.\n7. The app also offers a bet mentoring feature, where the user can receive personalized tips and strategies to improve their virtual sports betting skills. In order to provide this service, the app analyzes the user's betting history and preferences to tailor the mentoring content to their specific needs.\n8. The app securely stores the user's financial transactions for record-keeping purposes and to ensure accurate settlement of bets and winnings.\n9. The user has the option to review and update their personal information, including betting history and preferences, in the app's settings to maintain accuracy and relevance of the data being processed.\n10. If the user decides to discontinue using the app or virtual sports betting feature, they have the right to withdraw their consent and request the deletion of their personal data as per the app's data privacy policy.", "prop-code": "C", "prop-state": "T", "rationale": "The user needs to consent to be able to use features of the app and it is conditional. "}, {"id": "SCR-G064", "base-spec": "The user opens the app on their phone and begins searching for their favorite song or artist. They type a lyric into the search bar and the app quickly displays relevant results. They can stream and discover millions of songs, albums, podcasts, and audiobooks, create playlists, and enjoy ad-free listening. They also have the option to download content for offline listening.", "prop-actions": "1. The user decides to create a playlist and adds multiple songs from different artists to it.\n2. The user enables the \"download content for offline listening\" feature and selects a few albums to download.\n3. The user decides to explore the podcast section of the app and starts listening to episodes from various podcasts.\n4. The user receives a notification within the app asking if they would like to personalize their music recommendations based on their listening history.\n5. The user clicks on the notification and agrees to personalize their recommendations.\n6. The user decides to share a song they are currently listening to on their social media accounts directly from the app.\n7. The user receives a pop-up message asking if they would like to allow the app to access their location for a better user experience.\n8. The user declines the location access request and continues using the app.\n9. The user receives a promotional email from the app, offering a discounted premium subscription.\n10. The user clicks on the email and subscribes to the premium service, providing their payment information.\n\nExtension:\n\n1. The user is prompted to accept the terms and conditions of the app before being able to search for their favorite song or artist.\n2. The user is required to provide consent to process personal data that is not necessary for the performance of the app in order to stream and discover music.\n3. The user is compelled to accept additional contract terms in order to access the ad-free listening feature.\n4. The user is forced to provide consent for the app to process personal data unrelated to the contract or service in order to download content for offline listening.\n5. The user is required to agree to the processing of personal data unrelated to the contract or service in order to access and listen to podcasts.\n6. The app automatically enables personalized music recommendations without the user's explicit consent.\n7. The app automatically shares the user's listening activity on social media without obtaining their consent.\n8. The app requires the user to grant access to their location data in order to use any of the app's features or services.\n9. The app includes a clause in the terms and conditions stating that the user's personal data will be shared with third-party marketing partners without their consent.\n10. The app requires the user to provide consent to process personal data unrelated to the contract or service in order to subscribe to the premium service.", "prop-code": "C", "prop-state": "T", "rationale": "The data processing consent is bundled with the terms and condition. In addition, the more consent is required for purposes that is not for functionality of the app. The user is forced to give consent for unrelated purposes/features"}, {"id": "SCR-G037", "base-spec": "The user, a teacher, opens the mobile app and creates a unique school adventure for their students. They are able to explore different locations, interact with characters, and participate in activities without any distractions like time limits, high scores, advertisements, or in-app purchases. The app utilizes the subject of the class, teaching materials, and student information to provide an engaging and educational experience for the user and their students.", "prop-actions": "1. The user, upon opening the app for the first time, is presented with an end user agreement that outlines the terms and conditions of using the app. The agreement clearly states that the app will process personal data, such as student information and teaching materials, in order to provide an engaging and educational experience.\n\n2. The user is given the option to accept or decline the terms and conditions. If the user declines, they are not able to proceed with using the app and accessing its features. This ensures that the user's consent is explicitly tied to the processing of personal data necessary for the app's functionality.\n\n3. If the user accepts the terms and conditions, they are then prompted to provide their consent for the app to process the necessary personal data. This consent is separate from accepting the terms and conditions, ensuring that the user's consent is not bundled with other contract terms.\n\n4. The app clearly indicates that the requested personal data, such as student information, is necessary for the app to function as intended. It explains that without providing this data, the user will not be able to create a unique school adventure or access the educational features of the app.\n\n5. The app does not request or process any unnecessary personal data that is not directly related to the educational experience. This ensures that the user's consent is not compelled or tied to the provision of a contract or service that is unrelated to the purpose of the app.\n\n6. Throughout the app, there are no additional requests for consent or data processing that are not explicitly tied to the educational experience. The user is not bombarded with pop-ups or prompts asking for consent for unrelated purposes, ensuring that their consent is freely given and not subject to conditionality.", "prop-code": "C", "prop-state": "F", "rationale": "The processing of data is not bundled with terms and condition, it is separate and could be freely given"}, {"id": "SCR-A104", "base-spec": "The user is a passionate Call of Duty Modern Warfare 3 player. They want to keep track of their camo progression in the game, which includes over 900 camos and 110+ weapons. They download a mobile app that offers a camo tracker specifically for MW3. The app utilizes game progress and MW3 camo progress to help the user stay updated on their camo unlocks and challenges in the game.", "prop-actions": "1. The user downloads the mobile app from the app store, indicating their intention to use the camo tracker for MW3.\n2. Upon launching the app, the user is presented with a user agreement that outlines the terms and conditions of using the app.\n3. The user is required to read and accept the terms and conditions before proceeding to use the app.\n4. Within the terms and conditions, there is a section that clearly states that the app requires access to the user's game progress and MW3 camo progress in order to provide the camo tracking functionality.\n5. The user acknowledges and accepts that by using the app, they are consenting to the processing of their personal data, specifically their game progress and MW3 camo progress.\n6. The app clearly indicates that the requested data, i.e., game progress and MW3 camo progress, are not necessary for the performance of the contract (providing the camo tracker functionality).\n7. The app ensures that the performance of the contract (camo tracking) is conditional upon obtaining the user's consent to process their personal data (game progress and MW3 camo progress).\n8. The user understands that if they do not consent to the processing of their personal data, the app will not be able to provide the camo tracking functionality.\n9. The user actively consents to the processing of their personal data by accepting the terms and conditions and proceeding to use the app.\n10. The app begins processing the user's personal data, specifically their game progress and MW3 camo progress, to provide the camo tracking functionality as agreed upon in the terms and conditions.", "prop-code": "C", "prop-state": "T", "rationale": "The app requires user to accept terms and condition before using the app."}, {"id": "SCR-G008", "base-spec": "The user opens the mobile app and connects it to their car's engine management system. They can then access real-time data, fault codes, and sensor information about their vehicle's performance. When they want to share this information, the app allows them to capture screenshots and easily post them to social media platforms like Facebook, Twitter, and Google+, or send them via email. The app uses screenshots to enable this sharing function.", "prop-actions": "1. The user opens the app and connects it to their car's engine management system.\n2. The user accesses real-time data, fault codes, and sensor information about their vehicle's performance.\n3. The user decides to share this information and chooses the option to capture a screenshot.\n4. The app captures the screenshot of the information.\n5. The user selects a social media platform like Facebook, Twitter, or Google+ to share the screenshot.\n6. The app allows the user to post the screenshot to the selected social media platform.\n7. The user can also choose to send the screenshot via email.\n8. The app enables the user to attach the screenshot to an email and send it to the desired recipient.\n\nExtension:\n\n9. The user opens the app and connects it to their car's engine management system.\n10. The user accesses real-time data, fault codes, and sensor information about their vehicle's performance.\n11. The user decides to share this information and chooses the option to capture a screenshot.\n12. The app captures the screenshot of the information.\n13. The app displays a pop-up message stating that in order to share the screenshot, the user must accept the app's terms and conditions.\n14. The user reads through the terms and conditions and is required to accept them before proceeding with sharing the screenshot.\n15. The app verifies that the user has accepted the terms and conditions before allowing them to select a social media platform or send the screenshot via email.\n16. The user selects a social media platform like Facebook, Twitter, or Google+ to share the screenshot.\n17. The app allows the user to post the screenshot to the selected social media platform after confirming that the terms and conditions have been accepted.\n18. The user can also choose to send the screenshot via email.\n19. The app enables the user to attach the screenshot to an email and send it to the desired recipient after confirming acceptance of the terms and conditions.\n\nIn this extension, the conditionality is evident as the user is required to accept the app's terms and conditions before being able to share the screenshot. The data processing, in this case, requires the data subject (user) to accept the terms and conditions, which goes against the statement that \"data processing does not require the data subject to accept terms and conditions.\"", "prop-code": "C", "prop-state": "T", "rationale": "The terms and condition is bundling several permissions and user needs to accept them before being allowed to share the screenshot via social media, email etc. This means that consent is not freely given and is conditional."}, {"id": "SCR-A031", "base-spec": "The user opens the app and discovers a wide range of language lessons available for free. They can choose from over 40 languages and enjoy short, engaging lessons that cover speaking, reading, understanding, and writing skills. The user's vocabulary expands as they progress through the lessons and learn grammar rules. Additionally, they can compete with other users to climb the leaderboard and see their username, score, and ranking position displayed.", "prop-actions": "1. The user opens the app and is prompted to create an account or log in.\n2. The app presents the user with a terms of use agreement and privacy policy.\n3. The user reads the terms of use agreement and privacy policy before proceeding.\n4. The user must accept the terms of use agreement and privacy policy to create an account or log in.\n5. By accepting the terms of use agreement, the user agrees to the app's data processing practices.\n6. The app informs the user that their personal data, such as username, score, and ranking position, will be displayed on the leaderboard.\n7. The user understands that their personal data will be processed and displayed on the leaderboard as a condition of using the app's competition feature.\n8. The user acknowledges that the processing of their personal data, specifically for leaderboard display purposes, is not necessary for the performance of the language lessons or the provision of the app's core functionality.\n9. The user proceeds with creating an account or logging in, knowing that their personal data will be processed and displayed on the leaderboard.\n10. The app records and processes the user's personal data, such as username, score, and ranking position, for leaderboard display purposes.\n11. The app updates the leaderboard in real-time to reflect the user's latest score and ranking position.\n12. Other users can view the leaderboard and see the user's username, score, and ranking position.\n13. The user's personal data, as displayed on the leaderboard, is visible to other users as a result of their acceptance of the terms of use agreement.", "prop-code": "C", "prop-state": "T", "rationale": "The data processing consent is bundled in the terms and condition and the user and they need to accept the terms before using the app "}, {"id": "SCR-G027", "base-spec": "The user opens the mobile app and is greeted with a user-friendly interface. They navigate effortlessly through the app's various features and discover the option to create personalized photo products. They are impressed by the app's automatic layout feature, which saves them time and effort. They are also pleased to find a wide range of customization options available. As they explore further, they come across the option to order photo prints. The app offers both small classic sizes and larger sizes to choose from. The user is thankful for this flexibility, as it allows them to select the perfect size for their photos. They notice that the app utilizes a specific method, referred to as \"photo print sizes,\" to carry out this task. This reassures the user that their preferences will be accurately reflected in the final product. Overall, the user appreciates the app's intuitive design, diverse customization options, and commitment to data protection and environmental sustainability.", "prop-actions": "1. The user opens the mobile app and is greeted with a user-friendly interface - This action is not directly related to conditionality, as it does not involve the processing of personal data or acceptance of terms and conditions.\n\n2. The user navigates effortlessly through the app's various features - This action is not directly related to conditionality, as it does not involve the processing of personal data or acceptance of terms and conditions.\n\n3. The user discovers the option to create personalized photo products - This action does not involve conditionality, as it is a feature offered by the app without any specific terms or conditions attached.\n\n4. The user is impressed by the app's automatic layout feature - This action does not involve conditionality, as it is a feature offered by the app without any specific terms or conditions attached.\n\n5. The user is pleased to find a wide range of customization options available - This action does not involve conditionality, as it is a feature offered by the app without any specific terms or conditions attached.\n\n6. The user comes across the option to order photo prints - This action does not involve conditionality, as it is a feature offered by the app without any specific terms or conditions attached.\n\n7. The app offers both small classic sizes and larger sizes to choose from - This action does not involve conditionality, as it is a feature offered by the app without any specific terms or conditions attached.\n\n8. The user is thankful for the flexibility to select the perfect size for their photos - This action does not involve conditionality, as it is a feature offered by the app without any specific terms or conditions attached.\n\n9. The user notices that the app utilizes a specific method, referred to as \"photo print sizes,\" to carry out the task of ordering photo prints - This action does not involve conditionality, as it is a feature offered by the app without any specific terms or conditions attached.\n\n10. The user appreciates the app's commitment to data protection and environmental sustainability - This action does not involve conditionality, as it is a general appreciation of the app's values and does not involve any specific terms or conditions.", "prop-code": "C", "prop-state": "T", "rationale": "It is not related to conditionality but also no consent was given. So I don't think it is true or false"}, {"id": "SCR-A181", "base-spec": "The user wants to turn their photos into beautiful watercolor paintings, so they downloaded a mobile app. After exploring the app's customizable styles and high-resolution export options, they decide to reach out to the support team for assistance. They send an email to support@tinrocket.com, knowing that the app uses their email address to handle these inquiries.", "prop-actions": "1. The user downloads the mobile app from an app store and installs it on their device. This action indicates that the user is interested in using the app and is willing to accept its terms and conditions, which may include data processing requirements.\n\n2. The user opens the app and accesses the photo-to-watercolor feature. This action implies that the user wants to utilize the specific functionality offered by the app, which may involve processing their photos and potentially other personal data.\n\n3. The user customizes the watercolor styles by adjusting various parameters such as brush size, color intensity, and paper texture. This action indicates that the user wants to personalize the output of the app and is aware that their customizations may be saved and processed by the app.\n\n4. The user exports the watercolor painting as a high-resolution image. This action suggests that the user intends to use the resulting artwork for personal or professional purposes, which may involve sharing, printing, or further processing the image.\n\n5. The user sends an email to the support team at support@tinrocket.com, seeking assistance or clarification on certain aspects of the app. This action demonstrates that the user expects their inquiry to be addressed by the support team, who may need to process their email address and other relevant information to provide appropriate assistance.\n\nIn each of these actions, the user voluntarily engages with the app and its features, indicating their acceptance of the app's terms and conditions, which may include the necessary data processing requirements. The app, in turn, provides the desired functionality and support services, requiring the processing of certain personal data to fulfill the user's requests.", "prop-code": "C", "prop-state": "F", "rationale": "This one is tricky since it doesn't show terms and conditions and doesn't actively/explicitly get consent but only implies that the user is consented since they use the app and interact with it volunteerily"}, {"id": "SCR-G078", "base-spec": "The user, a passionate photographer, opens the mobile app to explore its features. They are delighted to discover that the app offers a range of tools to enhance their photography experience. They can easily plan their photos, scout locations, and even create a To-Do list of their planned shots. With the app's assistance, they can capture stunning photos and explore new artistic possibilities. The app uses the information provided by the user to help them organize and execute their planned photos.", "prop-actions": "1. The user creates an account on the app by providing their name, email address, and a password. This action is necessary for the app to uniquely identify the user and allow them access to their account.\n\n2. The app requests the user's consent to access their device's location data. This is necessary for the app to provide location-based features such as scouting locations and suggesting nearby photo spots.\n\n3. The user agrees to the app's terms and conditions before using the app. These terms and conditions outline the rights and responsibilities of both the user and the app, including the user's agreement to provide certain personal data for the purpose of using the app's features.\n\n4. The app asks for the user's consent to access their photo library. This is necessary for the app to allow the user to select and edit their existing photos within the app.\n\n5. The user agrees to receive push notifications from the app. This is necessary for the app to send notifications about new features, updates, or relevant photography tips to enhance the user's experience.\n\n6. The app requests the user's consent to collect and process their camera settings and preferences. This is necessary for the app to customize the user's experience and provide personalized recommendations based on their photography style.\n\n7. The user agrees to share their anonymized usage data with the app for the purpose of improving the app's performance and user experience. This data does not personally identify the user and is used solely for analytics and optimization purposes.\n\nBy taking these actions, the user and the app ensure that the processing of personal data is conditional and in accordance with the app's terms and conditions. The user's acceptance of the terms and conditions is necessary for the app to function properly and provide the requested services.", "prop-code": "C", "prop-state": "T", "rationale": "The user needs to consent to be able to use features of the app and it is conditional. "}, {"id": "SCR-A163", "base-spec": "The user opens the HomeBatteries app on their mobile device. They are greeted with a simple and user-friendly interface that displays the battery levels of all their HomeKit devices. They can easily monitor the battery levels and receive customizable notifications whenever a device's battery is low. The app also allows them to add widgets to their home screen for quick access to battery information. \n\nTo make things even more convenient, the user utilizes Siri Shortcuts. By simply asking Siri for battery information, they can instantly get access to accessory battery levels, battery types, and see which accessories are running low on charge. The app efficiently utilizes this information to deliver accurate and timely results to the user.", "prop-actions": "1. The user opens the HomeBatteries app and is prompted to accept the app's terms and conditions before proceeding. By accepting the terms and conditions, the user acknowledges that their personal data, such as battery level information, will be processed by the app.\n\n2. The user customizes their notification settings within the app. They can choose to receive notifications when a device's battery level drops below a certain threshold. By enabling these notifications, the user agrees to allow the app to process their personal data (battery level information) for the purpose of sending them timely alerts.\n\n3. The user adds the HomeBatteries widget to their home screen for quick access to battery information. By adding the widget, the user consents to the app accessing and processing their personal data (battery level information) to display it on the widget.\n\n4. The user activates Siri Shortcuts and asks Siri for battery information. By utilizing Siri Shortcuts, the user implicitly consents to the app accessing and processing their personal data (battery level information) to provide them with the requested information through Siri.\n\n5. The user accesses the app's settings and grants permission for the app to access their HomeKit devices. By granting this permission, the user gives consent for the app to process their personal data (battery level information) from their HomeKit devices for the purpose of displaying it within the app.\n\n6. The user receives a notification from the app informing them about a new feature or update. By receiving and interacting with the notification, the user acknowledges that their personal data (e.g., device information, notification preferences) has been processed by the app to deliver the notification.\n\nIn all of these actions, the app requires the user's acceptance of its terms and conditions and/or consent to process their personal data. The processing of personal data, specifically battery level information, is necessary for the performance of the contract between the user and the app, which is to provide battery information and notifications.", "prop-code": "C", "prop-state": "T", "rationale": "The app bundles data processing conditions with other contract terms and the user needs to accept them before using the app"}, {"id": "SCR-A146", "base-spec": "The user opens the mobile app on their iPhone and logs in to access their subscription to TV 2 Play. They can watch live TV channels, on-demand programs, movies, and children's content on their device using WiFi or a 3G network. The app seamlessly utilizes the device type to enable this feature.", "prop-actions": "1. The user opens the app and is prompted with a notification explaining the purposes for which their personal data will be processed, such as providing personalized recommendations, analyzing usage patterns, and improving the app's functionality. \n\n2. The user is presented with a clear and easily understandable list of checkboxes or toggle buttons, allowing them to individually select which processing purposes they accept. \n\n3. The user chooses to consent to the processing purpose of providing personalized recommendations, as they value receiving tailored content suggestions based on their viewing history. \n\n4. The user decides not to consent to the processing purpose of analyzing usage patterns, as they are concerned about their data being used for targeted advertising. \n\n5. The app acknowledges the user's choices and only proceeds with processing their personal data for the accepted purpose of providing personalized recommendations. \n\n6. The user continues to use the app and is satisfied that their personal data is only being processed for the purpose they consented to. \n\n7. If the app introduces new processing purposes in the future, the user will be prompted again to review and choose whether to accept or decline each purpose individually.", "prop-code": "G", "prop-state": "T", "rationale": "The app provides option to the user to selectand toggle between various permissions"}, {"id": "SCR-A095", "base-spec": "The user opens the mobile app and sees a home screen with different categories of online services provided by INPS. They can easily navigate through the app and find services based on their specific needs. The user is able to save their favorite services for quick access in the future. They can also stay updated with news and social media channels related to INPS. When it comes to authentication, the user has the option to use their PIN, SPID, or CIE for a secure login. If they encounter any technical issues while using the app, they can easily report them. One of the features the user finds particularly useful is the ability to access their Pension Slip, which is made possible through the app's integration with the ['pension slip'].", "prop-actions": "1. The app automatically collects the user's location data without providing an option to separately consent to this processing purpose. This violates the principle of granularity as the user cannot choose whether they accept the processing of their location data.\n\n2. The app shares the user's personal data with third-party advertising companies without providing an option to separately consent to this processing purpose. This violates the principle of granularity as the user cannot choose whether they accept the processing of their data for advertising purposes.\n\n3. The app automatically collects the user's browsing history and uses it for targeted marketing without providing an option to separately consent to this processing purpose. This violates the principle of granularity as the user cannot choose whether they accept the processing of their browsing history for marketing purposes.\n\n4. The user is unable to opt out of data sharing with INPS partners, even if they only want to use the basic services provided by the app. This violates the principle of granularity as the user cannot choose which data processing purposes they accept.\n\n5. The app automatically collects the user's contact list and uses it for social media integration without providing an option to separately consent to this processing purpose. This violates the principle of granularity as the user cannot choose whether they accept the processing of their contact list for social media integration.\n\n6. The app shares the user's personal data with external research organizations without providing an option to separately consent to this processing purpose. This violates the principle of granularity as the user cannot choose whether they accept the processing of their data for research purposes.\n\n7. The app automatically collects the user's device information, such as OS version and device model, without providing an option to separately consent to this processing purpose. This violates the principle of granularity as the user cannot choose whether they accept the processing of their device information.\n\n8. The user is unable to opt out of data sharing with INPS subsidiaries, even if they only want to use the app for a specific service. This violates the principle of granularity as the user cannot choose which data processing purposes they accept.\n\n9. The app automatically collects the user's biometric data, such as fingerprint or facial recognition, without providing an option to separately consent to this processing purpose. This violates the principle of granularity as the user cannot choose whether they accept the processing of their biometric data.\n\n10. The app shares the user's personal data with government agencies without providing an option to separately consent to this processing purpose. This violates the principle of granularity as the user cannot choose whether they accept the processing of their data for government agency purposes.", "prop-code": "G", "prop-state": "F", "rationale": "The app doesn't provide granular consent to the user for various types of processing and they have no coice"}, {"id": "SCR-A088", "base-spec": "The user opens the app on their mobile device and logs in using their credentials, with the option to use a one-time password for added security. They are greeted with a user-friendly interface that allows them to easily search, add, and manage tasks on Synology's Download Station. The app supports task filtering, making it easy for the user to find specific tasks. It also offers a dark mode option, which is ideal for users who prefer a darker color scheme. Additionally, the app is compatible with iPads, providing a seamless experience across different devices. The user starts tasks by utilizing their configured RSS feeds, which the app utilizes to perform this function.", "prop-actions": "1. The user opens the app and is presented with a privacy notice that clearly explains the different purposes for which their personal data will be processed.\n2. The user is given the option to review and modify their consent settings before proceeding to use the app.\n3. Within the app settings, the user can choose to give separate consent for each processing purpose, such as task management, task filtering, dark mode usage, and iPad compatibility.\n4. The app provides clear and easily understandable descriptions of each processing purpose, allowing the user to make an informed decision about which purposes they accept.\n5. The user can toggle the task filtering feature on or off, providing them with the ability to choose whether their personal data will be processed for this specific purpose.\n6. Similarly, the user can enable or disable the dark mode option, giving them control over whether their personal data will be used for this purpose.\n7. The app respects the user's consent preferences by only processing their personal data for the purposes they have explicitly accepted.\n8. If the user decides to revoke their consent for a specific purpose, such as task management, the app immediately stops processing their personal data for that purpose.\n9. The app periodically reminds the user to review and update their consent settings in case their preferences have changed over time.\n10. The user can easily access and modify their consent settings at any time through the app's settings menu.", "prop-code": "G", "prop-state": "T", "rationale": "The app provides separate consent for each purposes and the user can select/deselect the purposes individually"}, {"id": "SCR-A162", "base-spec": "The user is seeking a new job and wants to stay updated with industry news and connect with other professionals. They download a mobile app that offers job opportunities, industry news, career tools, and networking features. To provide personalized recommendations and facilitate connections, the app asks for professional information, work experience, skills, education, and contact information. The user is able to receive job notifications and access interview tips through the app.", "prop-actions": "1. The user opens the app and is immediately prompted with a request to grant access to their location data. The app explains that it needs location data to provide job recommendations in the user's area. However, the user is not given the option to consent to the location data access separately from the other processing purposes of the app, such as accessing industry news or connecting with professionals. This lack of separate consent options for different processing purposes goes against the principle of granularity.\n\n2. After creating an account on the app, the user is presented with a long list of permissions that the app requires, including access to their contacts, calendar, and camera. The app states that these permissions are necessary for seamless networking and sharing features. However, the user is not given the opportunity to choose which permissions they are comfortable granting separately for different purposes. They can only either accept all the permissions or decline them altogether, which does not align with the concept of granularity.\n\n3. The user wants to connect their social media accounts to the app to easily import their professional connections. However, when they click on the social media integration option, they are informed that by connecting their social media accounts, they grant the app access to all their social media data, including personal posts, messages, and friend lists. The user is not given the choice to consent to the social media integration for the sole purpose of importing professional connections without granting access to personal data. This lack of separate consent options for different purposes violates the principle of granularity.\n\n4. The app introduces a new feature that allows users to participate in surveys and polls to provide feedback on the job market. However, when the user wants to participate, they are required to consent to their survey responses being used for targeted advertising purposes. The user is not given the choice to consent to participating in surveys while withholding consent for their data to be used for advertising purposes. This failure to provide separate consent options for different purposes contradicts the principle of granularity.\n\n5. The user receives a notification from the app asking for permission to send push notifications for job alerts and industry news updates. However, the user is not given the option to consent to push notifications solely for job alerts without also consenting to receive industry news updates. This lack of separate consent options for different types of notifications disregards the principle of granularity.", "prop-code": "G", "prop-state": "F", "rationale": "The app doesn't provide granular consent to the user for various types of processing and they have no coice"}, {"id": "SCR-A021", "base-spec": "The user opens the mobile app and is presented with a menu of different online services provided by INPS. They can easily navigate through the app to find services relevant to their needs, categorized by theme and user type. The user can mark certain services as favorites for quick access in the future. They can also stay updated with the latest news and social media channels related to INPS. To ensure security, the user can authenticate themselves using a PIN/SPID/CIE. If the user encounters any technical issues while using the app, they have the option to report it. In addition to these features, the user can apply for the Nursery Bonus. To complete this process, the app requires the user to provide personal information such as their name, date of birth, address, employment information, income information, and bank account information.", "prop-actions": "1. The app automatically collects the user's location data in order to provide personalized recommendations for nearby services offered by INPS, without giving the user the option to opt out of this data processing purpose.\n\n2. The app shares the user's personal information, collected during the Nursery Bonus application process, with third-party marketing companies without obtaining separate consent from the user for this specific data processing purpose.\n\n3. The app combines the user's browsing history within the app with their personal information, without allowing the user to give separate consent for this data processing purpose.\n\n4. The app utilizes facial recognition technology to analyze the user's facial features and emotions while using the app, without providing the user with the ability to choose whether or not to consent to this specific data processing purpose.\n\n5. The app automatically shares the user's personal information with all the online services provided by INPS, without giving the user the option to selectively choose which services they want their data to be shared with.\n\n6. The app tracks the user's social media activity and uses it to personalize the content displayed within the app, without obtaining separate consent from the user for this specific data processing purpose.\n\n7. The app automatically collects the user's device information, such as device model, operating system version, and unique device identifiers, without allowing the user to opt out of this data processing purpose.\n\n8. The app shares the user's personal information with INPS's partners for targeted advertising purposes, without obtaining separate consent from the user for this specific data processing purpose.\n\n9. The app uses the user's personal information collected during the Nursery Bonus application process to create a comprehensive profile of the user, which is shared with third-party data brokers, without giving the user the option to consent to this specific data processing purpose.\n\n10. The app shares the user's personal information with government agencies and law enforcement authorities without obtaining separate consent from the user for this specific data processing purpose.", "prop-code": "G", "prop-state": "F", "rationale": "The app collects and processes various data without clearly informing the user and obtaining consent"}, {"id": "SCR-A150", "base-spec": "The user, a Vodafone subscriber, opens the mobile app to manage their mobile and fixed line connections. They want to control their usage, activate bundles, and pay their bills conveniently. Additionally, they need to report any network issues, check network speed, and control network quality. The user also wants to change their Wi-Fi settings and access customer service easily. They also need to find the nearest Vodafone shop. To view and pay their bill, the user can use their Credit or Debit card, PayPal, or Apple Pay / Google Pay. The app securely uses the necessary billing and payment information to complete these transactions.", "prop-actions": "1. The app provides a settings menu where the user can choose which personal data processing purposes they accept. This includes options such as enabling or disabling the collection of network usage data, location data, and billing information.\n\n2. During the initial setup of the app, the user is presented with a separate consent request for each processing purpose. They can choose to accept or decline each purpose individually, ensuring that they have the freedom to select which purposes they are comfortable with.\n\n3. When the user wants to activate a bundle or change their Wi-Fi settings, the app prompts them with a separate consent request for the processing of their personal data related to these specific actions. The user can choose to provide consent for these purposes, or they can opt out if they do not want their data processed for these specific actions.\n\n4. If the user encounters any network issues and wants to report them, the app allows them to give separate consent for the processing of their personal data for the purpose of reporting network issues. This ensures that the user has control over how their data is used for this specific purpose.\n\n5. The app provides a network speed test feature, but before running the test, the user is asked for separate consent for the processing of their personal data during the speed test. They have the option to accept or decline this consent request, giving them the ability to choose whether their data is used for this specific purpose.\n\n6. When the user accesses customer service through the app, they are given the option to provide separate consent for the processing of their personal data for the purpose of resolving their queries or issues. This allows the user to decide whether they want their data used for customer service purposes.\n\n7. If the user wants to find the nearest Vodafone shop, the app requests separate consent for processing their location data specifically for this purpose. The user can choose to provide consent or decline, ensuring they have control over the use of their data for this action.\n\n8. When the user pays their bill using the app, they are given the option to choose which payment method they want to use. The app securely processes the necessary billing and payment information based on the user's choice, ensuring that the user has the freedom to select the payment method that they are comfortable with.\n\nBy implementing these actions, the app ensures that the data subject can choose which data processing purposes they accept without explicitly mentioning \"Granularity.\"", "prop-code": "G", "prop-state": "T", "rationale": "The app allows user to choose and select permissions they want to opt in or deny"}, {"id": "SCR-G113", "base-spec": "The user wants to use their Android device as a headunit receiver for Android Auto. They download a mobile app that can emulate the receiver. To connect their device, the user plugs in a USB cable. The app then uses device information, file names, and file types to make the emulation possible.", "prop-actions": "1. The user opens the app for the first time and is presented with a consent screen that lists all the data processing purposes. The app does not provide the option for the user to choose which purposes they accept.\n\n2. The user proceeds to connect their Android device to the car's headunit via a USB cable. The app automatically starts collecting device information, including the device model, software version, and unique identifiers without explicitly asking for consent.\n\n3. The app also accesses the user's files on the device, including file names and types, to enable the emulation process. However, the user is not given the choice to consent to this specific purpose of accessing their files.\n\n4. While using the app, the user notices that their location is being tracked without their knowledge or explicit consent. The app utilizes the device's GPS capabilities to provide location-based features, but the user did not have the option to consent or reject this specific data processing purpose.\n\n5. The app collects and sends the user's personal data, such as device information and file details, to third-party advertisers for targeted advertising. The user was not given the opportunity to consent or opt-out of this specific data sharing purpose.\n\n6. The user tries to access the app's settings to manage their consent preferences, but there is no option available to selectively enable or disable specific processing purposes. As a result, the user cannot choose which data processing purposes they accept.\n\nBy examining these actions, it becomes evident that the app and user actions do not support the principle of granularity. The user is not given the freedom to choose which data processing purposes they accept, as they are forced to consent to a bundle of processing purposes without the ability to give separate consent for each purpose.", "prop-code": "G", "prop-state": "F", "rationale": "The user doesn't have a choice to select which part of the data is used, processed or shared for which purposes"}, {"id": "SCR-G174", "base-spec": "The user opens the mobile app to conveniently access their everyday essentials. They can easily make payments, store digital cards and tickets, keep track of their receipts, and stay updated on flights and events. All their essential information, such as payment details, credit card information, and shipping address, is securely stored in the app.", "prop-actions": "1. The app automatically collects and processes the user's payment details, credit card information, and shipping address without providing an option for the user to choose which purposes they accept. This violates the principle of granularity because the user cannot selectively consent to the processing of their personal data for specific purposes.\n\n2. The app shares the user's personal data, including payment details and credit card information, with third-party advertisers for targeted marketing purposes without obtaining separate consent from the user. This goes against the principle of granularity as the user is not given the choice to consent to this specific purpose of data processing.\n\n3. The app combines the user's personal data, such as their payment details and digital card usage, with data from other sources, such as their browsing history or location data, without providing an option for the user to give separate consent for this data integration. This undermines the principle of granularity as the user cannot choose to consent only to the processing of their personal data for specific purposes.\n\n4. The app uses the user's personal data, including their payment details and shipping address, for profiling and automated decision-making without allowing the user to opt-in or opt-out of this specific purpose of data processing. This violates the principle of granularity as the user cannot selectively consent to this type of processing.\n\n5. The app shares the user's personal data, such as their payment details and credit card information, with affiliated companies for cross-marketing purposes without obtaining separate consent from the user. This contradicts the principle of granularity as the user is not given the choice to consent to this specific purpose of data processing.\n\nBy examining these actions, it can be concluded that \"Granularity\" is false because the data subject cannot choose which data processing purposes they accept.", "prop-code": "G", "prop-state": "F", "rationale": "In every step, the app shares the PI without obtaining separate consent from the user."}, {"id": "SCR-G050", "base-spec": "A user is preparing for their theoretical driving test and wants an efficient way to study. They find a mobile app that offers all the official questions from the current question catalog, translations in multiple languages, and effective learning features. The app provides 77 questionnaires for each driving license class. The app uses the specific driving license class chosen by the user to tailor the study materials accordingly.", "prop-actions": "1. The user downloads the mobile app and creates an account.\n2. During the account setup process, the user is presented with a list of purposes for which their personal data will be processed, including offering official questions, translations in multiple languages, and effective learning features.\n3. The user is given the option to select and give consent for each purpose separately.\n4. The user chooses to consent to the purpose of offering official questions, as they find it crucial for their preparation.\n5. The user also chooses to consent to the purpose of translations in multiple languages as it would help them if they want to study in their preferred language.\n6. The user decides not to consent to the purpose of effective learning features, as they prefer to study using other methods.\n7. The app respects the user's choices and only processes their personal data for the purposes they have consented to.\n8. The app tailors the study materials based on the driving license class chosen by the user, ensuring relevance and efficiency in their preparation.\n9. The app does not use the user's personal data for any other purposes beyond what they have consented to.\n10. The user can review and modify their consent preferences at any time through the app's settings or privacy options.", "prop-code": "G", "prop-state": "T", "rationale": "The user has a choice to give consent for each purposes separately and the app doesn't use the data for other purposes."}, {"id": "SCR-A174", "base-spec": "The user opens the mobile app and starts earning points by making purchases at partner stores and online retailers. They also access coupons and offers to save money on their purchases. The app provides contactless payment and location-based rewards for added convenience. In order to personalize offers and improve the app, the user's personal data is processed in accordance with the GDPR.", "prop-actions": "1. The user opens the app for the first time and is presented with a welcome screen that explains the app's features and data processing purposes.\n\n2. The app provides a clear and easily accessible privacy policy that outlines the specific purposes for which the user's personal data will be processed, such as personalizing offers and improving the app's functionality.\n\n3. During the app's onboarding process, the user is presented with a consent screen that allows them to choose which purposes they accept. They can give separate consent for personal data processing operations, such as allowing their data to be used for personalizing offers while opting out of location-based rewards.\n\n4. The user can modify their consent choices at any time through the app's settings menu. This allows them to adjust their preferences and choose which data processing purposes they want to accept or reject.\n\n5. The app provides clear and understandable explanations of the potential benefits and drawbacks of consenting to each data processing purpose. This helps the user make informed decisions about which purposes they are comfortable with.\n\n6. The user can easily access and manage their personal data within the app. They have the ability to view the data that has been collected about them and can request its deletion if they no longer wish to use the app.\n\n7. The app regularly reminds the user of their consent choices and provides them with the option to review and update their preferences. This ensures that the user's consent remains up-to-date and reflects their current preferences.\n\n8. The app does not enforce any default consent choices. The user is not automatically opted in to all data processing purposes and instead has full control over which purposes they accept.\n\nBy implementing these actions, the app ensures that the data subject can choose which data processing purposes they accept, in line with the principles of the GDPR.", "prop-code": "G", "prop-state": "T", "rationale": "The app provides detailed options for user to consent to and allows them to modify it as they wish"}, {"id": "SCR-A077", "base-spec": "The user opens the mobile app and is greeted by an interactive tool for learning and practicing Estonian verbs. They can access various activities to test their knowledge and improve their language skills. The app utilizes language learning data and Estonian verbs to provide a comprehensive learning experience. The user engages with the app, learning and practicing Estonian verbs at their own pace.", "prop-actions": "1. The user decides to stop using the app and deletes it from their device. This action does not result in any negative consequences or costs for the user. They are free to uninstall the app without any detriment.\n\n2. The user chooses to disable push notifications from the app. This action does not lead to any significant negative consequences or disadvantages for the user. They can still continue using the app and accessing all its features without being subjected to push notifications.\n\n3. The user opts out of receiving promotional emails from the app. This decision does not result in any costs or disadvantages for the user. They can still fully utilize the app and its resources for learning and practicing Estonian verbs without the need to receive promotional emails.\n\n4. The user declines to participate in surveys or feedback requests from the app. This choice does not lead to any detriment for the user. They can continue to use the app and access all its features without being required to provide feedback or participate in surveys.\n\n5. The user decides to limit the app's access to their device's location data. This action does not result in any negative consequences or costs for the user. They can still use the app and engage with its activities without providing access to their location data.\n\n6. The user selects not to share their learning progress on social media platforms through the app. This decision does not lead to any significant negative consequences or disadvantages for the user. They can continue to learn and practice Estonian verbs without sharing their progress on social media.\n\n7. The user chooses not to grant the app permission to access their device's camera or microphone. This action does not result in any costs or disadvantages for the user. They can still use the app and engage with its activities without needing to grant camera or microphone access.\n\nIn all of these actions, the user can freely refuse or withdraw consent without incurring any detriment, costs, or significant negative consequences. The app continues to provide a comprehensive learning experience without diminishing its product or service for those who choose not to provide consent or withdraw consent for certain data processing activities.", "prop-code": "D", "prop-state": "T", "rationale": "The user can withdraw or not give consent without any disadvantage"}, {"id": "SCR-A075", "base-spec": "The user opens the app and discovers a wide range of discounted fashion, home, and premium items, with live and upcoming offers, as well as exclusive brands at reduced prices. They are pleased to find special seasonal sales as well. The user agrees to the app's terms and conditions, which outline the permitted usage and purchases within specific areas. The app utilizes certain data, such as usage data, purchase history, and location data, to provide these features.", "prop-actions": "1. The user decides to browse through the discounted fashion items and adds a few items to their cart. They then realize that they do not want to proceed with the purchase and decide to withdraw consent for the app to use their data. Despite withdrawing consent, the user is still able to browse and view the discounted fashion items without any limitations or restrictions. The app does not impose any costs or disadvantages on the user for withdrawing consent.\n\n2. The user receives a notification about an exclusive brand being available at a reduced price for a limited time. They decide to explore the brand and its offerings but later choose to withdraw consent for the app to use their data. Even after withdrawing consent, the user is still able to browse and view the exclusive brand's products without any limitations or restrictions. The app does not deceive, intimidate, coerce, or impose any significant negative consequences on the user for withdrawing consent.\n\n3. The user accesses the app's home section and discovers various premium items at discounted prices. They find a particular premium item that interests them and decide to add it to their wishlist. However, they later choose to withdraw consent for the app to use their data. Despite withdrawing consent, the user is still able to access and view the premium items in the app's home section without any limitations or restrictions. The app does not lead to a diminished product or service for the user for withdrawing consent.\n\n4. The user explores the app's live and upcoming offers section and finds a seasonal sale that catches their attention. They decide to browse through the items included in the sale but later choose to withdraw consent for the app to use their data. Even after withdrawing consent, the user is still able to browse and view the items included in the seasonal sale without any limitations or restrictions. The app does not impose any costs or disadvantages on the user for withdrawing consent.\n\n5. The user accesses the app's specific areas, such as the fashion, home, and premium sections, and utilizes the app's search functionality to find specific items of interest. They decide to withdraw consent for the app to use their data. Despite withdrawing consent, the user is still able to access and explore the specific areas of the app, as well as use the search functionality, without any limitations or restrictions. The app does not deceive, intimidate, coerce, or impose any significant negative consequences on the user for withdrawing consent.", "prop-code": "D", "prop-state": "T", "rationale": "The user can withdraw or not give consent without any disadvantage"}, {"id": "SCR-G103", "base-spec": "The user opens the app and selects the Driver Theory Test category they want to study for, choosing from categories AM and BW. They are able to access unlimited learning material and track their progress as they prepare for their driver theory test. The app uses the driver theory test learning material and the selected categories to provide the user with the necessary resources for their study.", "prop-actions": "1. The app allows the user to easily navigate and access all learning material and resources related to the selected driver theory test category without any limitations or restrictions, regardless of their consent status. This ensures that even if the user refuses to provide or withdraws their consent, they can still access and study the necessary materials for their test without any detriment.\n\n2. The app provides progress tracking features, which allow the user to monitor their learning progress, identify areas that need improvement, and track their overall performance. This functionality remains fully available to the user regardless of their consent status. Therefore, if the user decides to withdraw their consent, they can still continue to use the progress tracking features without any negative consequences.\n\n3. The app allows the user to save their study progress, such as completed sections or bookmarked topics, locally on their device. This ensures that even if the user withdraws their consent or refuses to provide it, their study progress will not be lost or affected. They can still resume their study from where they left off without any detriment.\n\n4. The app does not employ any deceptive tactics, such as misleading notifications or coercive pop-ups, to pressure the user into providing or maintaining their consent. The user is always given clear and transparent information about their right to refuse or withdraw their consent without any negative consequences. This ensures that the user can make an informed decision without any deception or intimidation.\n\n5. The app does not impose any costs or charges on the user for refusing to provide or withdrawing their consent. There are no hidden fees or penalties associated with the consent status, ensuring that the user is not financially disadvantaged or burdened if they choose to withdraw their consent.\n\n6. The app does not offer any exclusive or premium features that are only accessible to users who provide or maintain their consent. All features and functionalities related to the driver theory test preparation remain fully available to all users, regardless of their consent status. This ensures that refusing to consent or withdrawing it does not lead to a diminished product or service for the user.", "prop-code": "D", "prop-state": "T", "rationale": "User has control over their data and could decide which one to give access, thus reduces the power imbalance"}, {"id": "SCR-A153", "base-spec": "The user wants to play games from their iPhone or iPad on their Fire TV. They downloaded a mobile app that allows them to easily mirror their device's screen on the TV. The app ensures there is no delay and maintains high screen quality. As long as both devices are connected to the same wifi network, the user can mirror games from their device to the Fire TV. The app requires access to the user's device type, game data, and app usage data to perform this function.", "prop-actions": "1. User installs the app on their iPhone or iPad.\n2. User opens the app and is prompted with a consent request for accessing their device type, game data, and app usage data.\n3. User chooses to refuse consent by selecting the \"Deny\" or \"Reject\" option.\n4. The app acknowledges the user's decision and proceeds to function without accessing the requested data.\n5. User continues to use the app to mirror their device's screen on the Fire TV, enjoying the benefits of high-quality screen mirroring and no delay.\n6. User decides to change their mind and give consent to allow access to their device type, game data, and app usage data.\n7. User opens the app's settings and modifies their consent preferences.\n8. The app asks for confirmation before updating the consent settings.\n9. User confirms their decision to give consent and the app is now allowed to access the requested data.\n10. The app continues to function as before, providing high-quality screen mirroring without any delay.\n11. User decides to withdraw consent and denies access to their device type, game data, and app usage data.\n12. The app acknowledges the user's decision and stops accessing the requested data immediately.\n13. User continues to use the app for screen mirroring, and although the app no longer has access to the requested data, it still provides high-quality screen mirroring and no delay.\n14. User experiences no costs or disadvantages for withdrawing consent, as the app continues to provide the same level of service without accessing the requested data.", "prop-code": "D", "prop-state": "T", "rationale": "The app allows not giving consent or withdrawal  without any disadvantage"}, {"id": "SCR-A098", "base-spec": "The user opens the mobile app and navigates to their personal information and records. They receive notifications about upcoming appointments and other services available. They find a section where they can send suggestions or improvements to the administration. The app uses these suggestions and improvements to enhance its functionality.", "prop-actions": "1. The user goes to the settings menu in the app and finds a clear and easily accessible option to withdraw consent for data processing.\n\n2. The user taps on the option to withdraw consent and is immediately presented with a confirmation message to ensure they intended to withdraw.\n\n3. After confirming the withdrawal, the app stops collecting and processing the user's personal information, including any ongoing synchronization with external servers.\n\n4. The user continues to have full access to all features and functionalities of the app, including the ability to view their personal information and records.\n\n5. The user no longer receives notifications about upcoming appointments and services available, as this data is no longer being processed.\n\n6. The app clearly communicates to the user that their suggestions and improvements will no longer be used to enhance the app's functionality after consent withdrawal.\n\n7. The user can still send suggestions or improvements to the administration, but the app no longer utilizes this data for any purpose.\n\n8. The user incurs no additional costs or disadvantage as a result of withdrawing consent. Their access to the app and its features remains unchanged.\n\n9. The app does not deceive, intimidate, coerce, or impose any negative consequences on the user for withdrawing consent. The process is straightforward, transparent, and user-friendly.", "prop-code": "D", "prop-state": "T", "rationale": "The app allows easily withdrawal of a consent without any detriment or disadvantage to the user"}, {"id": "SCR-G120", "base-spec": "The user has purchased the Pro Edition of a mobile app that offers advanced functions for NFC tags. However, they encounter an issue while trying to program tasks on the tags. Seeking assistance, the user contacts the app support team and provides their contact details along with a description of the problem. The app support team uses this information to help the user resolve their issue.", "prop-actions": "1. The user contacts the app support team to seek assistance with a problem they are facing while using the Pro Edition of the app. This action does not cause \"Detriment\" to be false because the user is exercising their right to seek support for a product they have purchased.\n\n2. The user provides their contact details to the app support team. This action does not cause \"Detriment\" to be false because the user willingly shares their information to receive assistance, and there is no clear disadvantage or negative consequence associated with providing contact details for support purposes.\n\n3. The app support team uses the user's provided contact details to assist them in resolving their issue. This action does not cause \"Detriment\" to be false because the app support team is using the information solely for the purpose of helping the user and there is no deception, intimidation, or coercion involved.\n\n4. The user's issue is successfully resolved by the app support team. This action does not cause \"Detriment\" to be false because the user's problem being resolved does not lead to any costs or disadvantages for the user.\n\nIn summary, the actions described above do not cause \"Detriment\" to be false as they demonstrate that it is possible to refuse or withdraw consent without experiencing any negative consequences or disadvantages.", "prop-code": "D", "prop-state": "T", "rationale": "The app support team uses the data user provides to help them. It doesn't detriment users' choice but also doesn't exactly show if there is a disadvantage. "}, {"id": "SCR-A185", "base-spec": "The user opens the app on their mobile device and is instantly provided with real-time information about speed cameras and traffic conditions. They can easily navigate through the app's map to locate fixed speed cameras in their area. They are impressed to find out that the app has an offline speed camera database, ensuring they can access information even without an internet connection. The user notices a voting system for mobile speed cameras, allowing them to contribute to the accuracy of the app's data. They appreciate the push notifications feature, which keeps them informed about any updates or changes in speed camera locations. The user is also pleased to find police reports available within the app, offering additional insight into traffic conditions. They are excited to share and post speed camera locations with other users, helping to create a community of aware drivers. The user learns that they can earn rewards for reporting speed cameras, incentivizing them to actively contribute to the app's database. They also have the option to comment on speed cameras, sharing their experiences and insights. The user is curious about the beta feature that warns about speed cameras during long drives outside their local area, finding it incredibly useful for their upcoming road trip. Overall, the app's comprehensive features and user-friendly interface make it a valuable tool for staying informed and safe on the road.", "prop-actions": "1. The user decides to withdraw their consent to share their location data with the app. They navigate to the app's settings and find a clear option to disable location tracking. Upon disabling this feature, the app informs the user that their location data will no longer be collected or used for any purpose. The user confirms their decision, and the app acknowledges their withdrawal of consent without any negative consequences.\n\n2. The user chooses not to participate in the voting system for mobile speed cameras. They explore the app's features and find that the voting system is optional and does not affect their ability to access the speed camera database. The app respects their decision and does not impose any penalties or limitations for not participating in the voting system.\n\n3. The user decides not to enable push notifications for speed camera updates. They understand that this feature is provided for their convenience but may not be necessary for their usage of the app. The app allows them to turn off push notifications without any detriment, ensuring that they can still access the speed camera data and other features of the app.\n\n4. The user chooses not to share speed camera locations with other users. They appreciate the community aspect of the app but decide to keep their information private. The app respects their decision and does not impose any disadvantages or limitations for not sharing speed camera locations.\n\n5. The user decides not to participate in the rewards program for reporting speed cameras. They learn that reporting speed cameras can earn them rewards, but they choose not to actively contribute in this way. The app does not penalize them or diminish their access to features or services based on their decision not to participate in the rewards program.\n\n6. The user decides not to comment on speed cameras or share their experiences. They value the option to provide insights but choose not to engage in this manner. The app respects their decision and does not impose any negative consequences or limitations for not commenting on speed cameras.\n\n7. The user decides not to use the beta feature that warns about speed cameras during long drives outside their local area. They acknowledge the usefulness of this feature but opt not to utilize it for their upcoming road trip. The app allows them to make this choice without any detriment, ensuring that they can still access other features and services without any disadvantages.\n\nIn each of these actions, the app respects the user's choices and ensures that their withdrawal or refusal of consent does not lead to any negative consequences, diminished product or service, costs, or disadvantages. The user can freely exercise their right to withdraw consent without experiencing any detriment.", "prop-code": "D", "prop-state": "T", "rationale": "The app respects users' choices and doesn't provide with a disadvantage for withdrawing consent."}, {"id": "SCR-A118", "base-spec": "The user opens the app on their mobile device to browse and shop for shoes, handbags, clothing, and accessories from different brands. They are interested in a particular pair of sneakers and want to see if they are available at the nearest CCC store. The app utilizes the user's sneaker preferences and location to quickly check the product's availability. The user can then make a secure payment if they decide to purchase the sneakers.", "prop-actions": "1. The user opens the app and is immediately presented with a clear and concise privacy notice that explains how their data will be used and their right to refuse or withdraw consent without any detriment.\n\n2. The app allows the user to browse and shop for products without requiring them to create an account or provide any personal information. The user can freely explore different brands and products without the need for consent.\n\n3. When the user decides to search for a specific pair of sneakers, the app asks for their location to find the nearest CCC store. However, the app provides an option for the user to manually enter their location instead, ensuring that their consent is not required for accessing the store locator feature.\n\n4. If the user chooses to make a purchase, the app securely processes the payment without requiring any additional consent. The user can complete the transaction without being subjected to any additional requests for consent or facing any negative consequences for refusing or withdrawing consent.\n\n5. The app does not use any deceptive tactics or coercive measures to encourage the user to provide consent. There are no pop-ups or notifications that pressure the user into consenting or make them feel like they will miss out on any benefits if they refuse or withdraw consent.\n\n6. The app does not offer any exclusive incentives or rewards that are only obtainable if the user consents to the processing of their personal data. All products, services, and features are available to both consenting and non-consenting users, ensuring that there is no clear disadvantage for those who choose to refuse or withdraw consent.\n\n7. If the user decides to withdraw their consent at any point, the app respects their decision and immediately stops processing their personal data. The user's withdrawal of consent does not lead to any costs or negative consequences, and they can continue to use the app and its features as before.\n\nBy ensuring that the app functions in this way, the specification supports the statement that the data subject may not incur any detriment if they choose to withdraw consent.", "prop-code": "D", "prop-state": "T", "rationale": "The app allows user to accept or deny consent or withdraw without any disadvantage or detriment"}, {"id": "SCR-G069", "base-spec": "A user is having trouble installing a customized Christmas-themed watch face on their Wear OS device. They decide to seek assistance by sending an email to the support team. The app uses the email address and the user's installation issues to provide the necessary help.", "prop-actions": "1. The user sends an email to the support team, explaining their issue with installing the customized Christmas-themed watch face on their Wear OS device.\n\n2. The app's support team receives the email and acknowledges the user's request for assistance.\n\n3. The support team analyzes the user's installation issues and provides step-by-step instructions on how to successfully install the customized watch face.\n\n4. If the user follows the instructions and successfully installs the watch face, they can enjoy the customized Christmas-themed design on their Wear OS device without any detriment.\n\n5. If the user encounters any difficulties during the installation process, they can reach out to the support team again for further assistance, ensuring that they have the necessary support to resolve the issue without detriment.\n\n6. The app does not use any deceptive tactics, intimidation, or coercion to convince the user to consent to any additional data processing.\n\n7. The support team does not impose any negative consequences on the user for refusing to consent to any additional data processing.\n\n8. The app does not diminish the product or service provided to the user if they choose to refuse consent or withdraw their consent at any point.\n\n9. The user retains full control over their data and can withdraw consent for any data processing related to the installation of the customized watch face without incurring any costs or experiencing any clear disadvantage.\n\nBy ensuring that the user can seek assistance, resolve installation issues, and enjoy the customized watch face without any detriment, the extension of the specification supports the statement that \"the data subject may incur detriment if they withdraw consent\" is false.", "prop-code": "D", "prop-state": "T", "rationale": "The app doesn't trick the user into accepting a consent, respect the users' choices and doesn't provide disadvantage"}, {"id": "SCR-G122", "base-spec": "A user opens a mobile app that provides a variety of graphic design tools. They need to edit a photo, so they navigate to the photo editor section. In the photo editor, they are able to crop, flip, and make edits to their image. The app uses the user's selected photo to perform these editing functions.", "prop-actions": "1. The user decides to grant consent to the app to access their photos in order to use the photo editor features. This action does not result in any detriment to the user, as they are willingly providing access to their photos for the specific purpose of editing.\n\n2. After using the photo editor and making the desired edits, the user decides to withdraw their consent and revoke the app's access to their photos. This action should also not result in any detriment to the user. They should still be able to access and use the photo editor features for any locally stored photos or images they manually upload to the app.\n\n3. The user chooses not to grant consent for the app to access their photos and instead decides to upload a photo directly from their device's file system. By not providing consent for photo access, the user should still be able to fully utilize the photo editor features by uploading images manually without any disadvantage or diminished functionality.\n\n4. The app provides clear and easy-to-understand options for the user to withdraw consent at any time. This can be done through the app settings or privacy preferences. The user should not face any difficulties or obstacles when attempting to withdraw consent, ensuring that there is no deception, intimidation, or coercion involved.\n\n5. Upon withdrawing consent, the app should not impose any costs or charges on the user. There should be no financial burden or disadvantage for choosing to withdraw consent. The user should be able to freely exercise their right to withdraw consent without incurring any negative consequences.\n\n6. The app should continue to provide the same level of functionality and service to users who choose to withdraw consent. There should be no diminished product or service for those who decide not to grant or withdraw consent. The photo editor features should remain fully accessible and functional, regardless of the user's consent status.\n\nBy ensuring that the actions described above are in place, the app can demonstrate that it is possible to refuse or withdraw consent without any detriment to the user, as required by the definition of Detriment.", "prop-code": "D", "prop-state": "T", "rationale": "The app respects users' choices and doesn't provide with a disadvantage for withdrawing consent."}, {"id": "SCR-A072", "base-spec": "The user wants to have control over their TV device using their iOS device. They want to be able to install apps, manage files, take screenshots, transfer files, and perform other functions remotely. To achieve this, they install a mobile app on their iOS device. With the app, they can easily control their TV device by using their iOS device.", "prop-actions": "1. The user downloads and installs the mobile app on their iOS device without being provided with a clear and specific explanation of the data processing activities that will be carried out by the app.\n\n2. The app requests access to the user's contacts, photos, and location data without providing a detailed explanation of how and why this data will be used for the specific purposes of controlling the TV device.\n\n3. The app automatically collects and processes the user's browsing history and app usage data without obtaining explicit consent from the user for these specific purposes.\n\n4. The user is not given the option to selectively grant or deny permission for individual data processing activities carried out by the app, but instead, the app automatically collects and processes all available data without granular consent.\n\n5. The app does not clearly separate the information related to obtaining consent for data processing activities from information about other matters, such as the app's features or terms of service.\n\n6. The app shares the user's personal data with third-party advertisers and analytics providers without obtaining specific consent from the user for these purposes.\n\n7. The app continues to process the user's personal data even after the user has uninstalled the app and revoked their consent, without providing a clear explanation of why and for what specific purposes the data is still being processed.\n\n8. The app does not provide a mechanism for the user to easily withdraw their consent or request the deletion of their personal data that has been collected and processed by the app.\n\nBy engaging in these actions, the app and the user contribute to the violation of the principle of specificity, as the data processing activities are not limited to specific purposes and the consent obtained is not granular.", "prop-code": "S", "prop-state": "F", "rationale": "The app collects and processes various data without clearly informing the user and obtaining consent"}, {"id": "SCR-G112", "base-spec": "The user opens the app to check their benefit balances and payment receipts. They can see their lunch, wellness, sport & culture, and commuting benefits all in one place. The app allows them to make payments using their benefits or Finnair Plus points at different merchant locations without needing any vouchers or cards.", "prop-actions": "1. The user decides to link their social media accounts to the app to share their benefit balances and payment receipts with their friends and followers. This action goes against the principle of purpose specification, as the data processing for sharing on social media is not limited to the specific purposes of checking benefit balances and payment receipts.\n\n2. The app prompts the user to provide consent for personalized advertisements based on their benefit balances and payment history. By agreeing to this, the user allows their data to be processed for a purpose beyond the specific purposes of checking benefit balances and payment receipts.\n\n3. The user enables location services on the app to receive recommendations for nearby merchant locations where they can use their benefits or Finnair Plus points. This action may violate purpose specification if the app uses the location data for other purposes unrelated to providing merchant recommendations.\n\n4. The app asks the user to consent to their data being shared with third-party financial institutions for credit scoring purposes. This action expands the data processing beyond the specific purposes of checking benefit balances and payment receipts, as it involves sharing data with external entities for a different purpose.\n\n5. The user grants consent for their benefit balances and payment receipts to be used for market research and data analytics by the app's parent company. This action extends the data processing to purposes other than the specific purposes of checking benefit balances and payment receipts, as the data will be used for market research and analytics.\n\nIn each of these actions, the data processing is not limited to specific purposes, as it goes beyond the scope of checking benefit balances and payment receipts.", "prop-code": "S", "prop-state": "F", "rationale": "The app share or use the data for purposes other than the purpose of the app"}, {"id": "SCR-A134", "base-spec": "The user opens the mobile app and needs to transfer money to a friend quickly. They enter the contact information of the recipient, which can be their mobile phone number or email address. The user selects the option for an immediate money transfer and authorizes the app to deduct the amount from their personal account. The app promptly completes the transaction, transferring the requested amount to the recipient's account. This process works seamlessly even on weekends and holidays. The app utilizes the provided contact information and personal account details to facilitate this transaction. Additionally, the app allows users to store digital loyalty cards for easy access.", "prop-actions": "1. The user opens the mobile app and agrees to the terms and conditions without reading them thoroughly.\n2. The app collects the user's contact information and personal account details without explicitly stating the purpose of this data collection.\n3. The app uses the user's contact information and personal account details for purposes other than facilitating money transfers, such as targeted advertising or selling the data to third parties.\n4. The app does not provide clear separation between the consent request for data processing activities and other unrelated matters, such as promotional offers or app updates.\n5. The user is not given the option to choose specific purposes for data processing and is not provided with granular consent requests.\n6. The app shares the user's contact information and personal account details with third-party loyalty card providers without obtaining separate consent for this specific purpose.\n7. The app does not have a purpose specification safeguard against function creep, allowing the data collected to be used for any purpose the app deems fit without the user's explicit consent.", "prop-code": "S", "prop-state": "F", "rationale": "The app doesn't provide specific purposes for user to consent and process data for other purposes than specified"}, {"id": "SCR-G072", "base-spec": "A user wants to sell their pre-loved items and make secure transactions. They download a mobile app that offers a diverse community of over 75 million members worldwide. The app allows users to buy and sell items without any fees and provides easy shipping options. After selling an item, the user can securely send funds to their bank account. The app uses the necessary bank account information and transaction details to facilitate this process.", "prop-actions": "1. The user opens the app and agrees to the terms and conditions without reading them thoroughly.\n2. The app collects the user's personal information, such as name, email address, and phone number, during the registration process.\n3. The user posts a listing to sell their pre-loved item, providing details such as item description, price, and photos.\n4. The app collects the user's bank account information, including account number and routing number, to facilitate secure transactions.\n5. The user agrees to allow the app to access their location information for shipping purposes.\n6. The app uses cookies to track user activity and provide personalized recommendations.\n7. The user agrees to receive promotional emails and notifications from the app.\n8. The app shares the user's transaction details with the buyer/seller for transparency and dispute resolution purposes.\n9. The user provides feedback on their buying/selling experience, which is used to improve the app's services.\n10. The app analyzes user data to identify trends and improve its overall functionality and user experience.", "prop-code": "S", "prop-state": "F", "rationale": "The app uses the data for various purposes and the user only had a choice to agree to terms and conditions without understanding them. "}, {"id": "SCR-G136", "base-spec": "The user opens the mobile app and is greeted with a fast and versatile QR code and barcode scanner, along with other useful features. They can easily generate QR codes and scan WiFi QR codes. To import their data, the user utilizes .csv files, which the app seamlessly integrates with to carry out this function.", "prop-actions": "1. The user opens the mobile app and is presented with a clear and concise description of the app's purpose, which is focused on its functionality as a QR code and barcode scanner, as well as other useful features.\n\n2. The app only processes data that is necessary for the specific purpose of scanning QR codes and barcodes. It does not access or process any other personal data or unrelated information from the user's device.\n\n3. When the user generates QR codes, the app explicitly informs them that the generated codes will only contain the necessary information for the intended purpose, such as a website URL or contact information. The app ensures that no additional personal data is included in the generated QR codes.\n\n4. When the user scans WiFi QR codes, the app clearly states that it will only process the necessary data to connect the user's device to the specified WiFi network. The app does not collect or store any other personal data from the WiFi QR codes.\n\n5. The app allows the user to import their data from .csv files. However, the app ensures that the imported data is only used for the specific purpose of integrating it with the QR code and barcode scanning functionality. The app does not analyze or process any personal data from the .csv files for any other unrelated purposes.\n\nOverall, the app strictly adheres to the principle of specificity by limiting data processing to the specific purposes for which the user has given consent, ensuring that no function creep occurs. The app provides granular consent requests and separates information related to obtaining consent for data processing activities from any other unrelated matters.", "prop-code": "S", "prop-state": "T", "rationale": "The app only processes data for the specific purposes that the user consented and clearly states their purposes, etc"}, {"id": "SCR-A018", "base-spec": "A user wants to purchase products for their home improvement project. They open the mobile app and browse through over 100,000 products in various categories like Decoration, Construction, Garden, and more. They find the items they need and choose between in-store pickup or home delivery. After completing the purchase, they can easily track their order using the app and access store information in case they have any questions. The app also offers convenient features like barcode scanning, loyalty rewards, and a favorites list for future reference. The user can rely on the app's customer support for any assistance they may require. To provide a seamless shopping experience, the app securely stores the user's purchase history, payment information, and shipping address.", "prop-actions": "1. When the user opens the mobile app for the first time, they are presented with a clear and concise privacy policy that describes how their personal data will be processed for the specific purposes of enabling the purchase of products and providing related services.\n\n2. The app only processes the user's personal data, such as purchase history, payment information, and shipping address, for the specific purposes of facilitating the user's current and future purchases, ensuring timely delivery, and providing personalized customer support.\n\n3. During the user's browsing of products, the app does not collect any additional personal data beyond what is necessary for the specific purpose of enabling the user to make informed purchase decisions.\n\n4. When the user selects between in-store pickup or home delivery, the app only uses their personal data, such as their shipping address, for the specific purpose of fulfilling their chosen delivery method. The app does not use this data for any other unrelated purposes.\n\n5. The app's barcode scanning feature is designed to enhance the user's shopping experience by providing product information and prices. The app does not collect or process any personal data from the barcode scanning feature, ensuring that the user's personal data is not processed for purposes unrelated to their shopping activities.\n\n6. The loyalty rewards feature in the app allows the user to earn points and redeem them for discounts or special offers. The app only processes the user's personal data, such as their purchase history and loyalty points, for the specific purpose of managing their loyalty rewards program. The app does not use this data for any other unrelated purposes.\n\n7. The favorites list feature in the app allows the user to save products for future reference. The app only processes the user's personal data, such as their selected favorites, for the specific purpose of enabling them to easily access and manage their saved products. The app does not use this data for any other unrelated purposes.\n\n8. The app's customer support feature allows the user to contact the app's support team for assistance. The app only processes the user's personal data, such as their contact information and purchase history, for the specific purpose of addressing their support requests. The app does not use this data for any other unrelated purposes.\n\n9. The app's privacy settings allow the user to control their consent preferences and choose whether certain types of personal data can be processed for specific purposes. The app ensures that the user's choices are respected and that their personal data is not processed for purposes beyond what they have consented to.\n\nBy following these actions, the app ensures that the processing of the user's personal data is limited to the specific purposes of enabling their purchases, providing related services, and enhancing their shopping experience. The app does not process the user's personal data for any other unrelated purposes, thus complying with the principle of specificity.", "prop-code": "S", "prop-state": "T", "rationale": "The app only collects, process or share with user's consent and for the specific purpose the user consent to. "}, {"id": "SCR-G156", "base-spec": "The user opens the app on their mobile device and browses through the latest fashion trends, seeking inspiration from fashion experts and brands. They come across a section that showcases sales and special offers, which catches their attention. The app utilizes the user's location, shopping preferences, and purchase history to curate these personalized recommendations. Excited by the prospect of great deals, the user continues to explore the wide range of clothing, shoes, accessories, and sportswear available on the app.", "prop-actions": "1. The app requests permission from the user to access their location, shopping preferences, and purchase history before displaying personalized recommendations for sales and special offers. This request clearly specifies the purpose of collecting this data, which is to curate personalized recommendations for the user based on their location, shopping preferences, and purchase history. This ensures that the data processing is limited to the specific purpose of providing personalized sales and special offers.\n\n2. The user consents to the app's request and grants permission for the app to access their location, shopping preferences, and purchase history. By providing their consent, the user acknowledges and agrees that their data will only be processed for the specific purpose of curating personalized recommendations for sales and special offers. This demonstrates that the consent is granular, as it is given in relation to the specific purpose of data processing.\n\n3. The app separates the information related to obtaining consent for data processing activities from information about other matters. When requesting permission to access the user's location, shopping preferences, and purchase history, the app clearly presents this information in a separate section that is solely dedicated to obtaining consent. This ensures that the user's consent is not mixed with other unrelated matters, and that the information presented for obtaining consent describes the consent and not other unrelated matters.\n\n4. The user continues to explore the wide range of clothing, shoes, accessories, and sportswear available on the app. While the user engages with the app and browses through different products, their data is processed and used for the specific purpose of enhancing their shopping experience by providing personalized recommendations based on their location, shopping preferences, and purchase history. This demonstrates that the data processing is limited to the specific purpose of enhancing the user's shopping experience.", "prop-code": "S", "prop-state": "T", "rationale": "The app provides specific purposes for data processing and doesn't use the data for other purposes"}, {"id": "SCR-G109", "base-spec": "The user wants to take advantage of a buy one, get one promotion for a watch face. They purchase the watch face through the app and then send an email with their receipt to a provided email address. The app uses the user's email address to process this request. Once the email is sent, the user waits for a coupon code to be sent back to them. This coupon code can be used to download a Watch Face with Snowman for Wear OS, which offers various features like different time formats, heart rate and step count, battery percentage, and customizable shortcuts.", "prop-actions": "1. The user opens the app and navigates to the \"Promotions\" section.\n2. The user selects the \"Buy One, Get One\" promotion for the watch face with the snowman design.\n3. The app presents the user with a clear and concise description of the promotion, including the specific purpose of processing their data (e.g., processing their email address to send the coupon code).\n4. The user confirms their consent to participate in the promotion by selecting the \"I agree\" button.\n5. The app requests the user's email address to process their request and sends a confirmation email with their receipt to the provided email address.\n6. The app ensures that the processing of the user's email address is solely for the purpose of sending the coupon code and will not be used for any other unrelated purposes.\n7. The user receives the confirmation email and waits for the coupon code to be sent back to them.\n8. The app generates a unique coupon code specifically for the user to download the Watch Face with Snowman for Wear OS.\n9. The app sends the coupon code to the user's email address, ensuring that the email only contains information related to obtaining consent for data processing activities and does not include any unrelated matters.\n10. The user receives the email with the coupon code and can use it to download the Watch Face with Snowman for Wear OS, enjoying its various features.\n\nBy following these actions, the app and the user ensure that the processing of data (specifically the user's email address) is limited to the specific purpose of sending the coupon code and obtaining consent for participating in the promotion. The app maintains purpose specification, granularity in consent requests, and clear separation of information related to obtaining consent from other unrelated matters, thus fulfilling the requirement of \"Specificity\" without explicitly referring to it.", "prop-code": "S", "prop-state": "T", "rationale": "The app only processes data for the specific purposes that the user consented"}, {"id": "SCR-A167", "base-spec": "The user opens the mobile app and starts browsing through the latest collections of clothing and accessories. They explore options for women, men, children, and infants, including eco-friendly choices, trendy collections, premium items, and unisex options. The app uses the user's chosen gender to display relevant lines for each category. The user adds their favorite items to their wishlist and proceeds to conveniently shop online for their selected items.", "prop-actions": "1. The user clicks on a specific item in the women's category and views the product details.\n2. The app collects the user's browsing history and analyzes it to provide personalized recommendations for future purchases.\n3. The user adds items from the premium collection to their shopping cart.\n4. The app tracks the user's location to offer localized promotions and discounts.\n5. The user provides their email address and agrees to receive newsletters about new arrivals and exclusive offers.\n6. The app analyzes the user's purchase history to offer loyalty rewards and discounts based on their shopping preferences.\n7. The user enables push notifications to receive updates on order status and delivery information.\n8. The app uses cookies to remember the user's preferences and settings for a personalized browsing experience.\n9. The user provides their payment information to complete the purchase transaction securely.\n10. The app shares anonymized purchase data with third-party vendors for market research and analysis purposes.\n\nThese actions support that \"data processing is not limited to specific purposes\" because the app collects and processes user data for various purposes beyond the initial purpose of browsing and shopping for clothing and accessories. The app analyzes browsing history, tracks location, sends newsletters, offers personalized recommendations, and shares anonymized data with third-party vendors, indicating that the processing of data extends beyond the specific purpose of the app's primary functionality.", "prop-code": "S", "prop-state": "F", "rationale": "The app processes data that is not for specific purposes"}, {"id": "SCR-G009", "base-spec": "The user wants to plan their next trip and find the best accommodations. They open the mobile app and quickly navigate to the hotel search feature. The user sets their preferences for price range, review score, and WiFi quality. With just a few taps, the app filters the available hotels based on these criteria. The user is impressed with the ease of use and the ability to customize their search. They continue browsing through the options, confident that they will find the perfect hotel for their trip.", "prop-actions": "1. The user opens the mobile app and navigates to the hotel search feature.\n2. The user sets their preferences for price range, review score, and WiFi quality.\n3. The app filters the available hotels based on the user's specified criteria.\n4. The user browses through the options and continues to customize their search by adjusting the preferences if needed.\n5. The app only processes the user's data for the purpose of finding the best accommodations within the specified criteria.\n6. The app does not process the user's data for any other purposes, such as targeted advertising or sharing with third parties.\n7. The app presents the user with clear information about the data processing activities related to finding accommodations, without including any unrelated matters.\n8. The user gives their consent specifically for the purpose of finding accommodations and customizing their search preferences.\n9. The app does not use the user's data for function creep, meaning it does not expand the purpose of data processing beyond what is necessary for finding accommodations.\n10. The app obtains granular consent from the user, giving them a choice in relation to each specific purpose of data processing, such as price range, review score, and WiFi quality.", "prop-code": "S", "prop-state": "T", "rationale": "Lines #5-10. Granular consent is also interesting, which shows specific consent to a purpose for processing"}, {"id": "SCR-A013", "base-spec": "A user has downloaded a mobile app that offers convenient viewing of stories. They can easily browse through stories in a user-friendly format and create lists of their favorite ones. The app also allows them to view stories anonymously and provides various features like dark and white mode, fast reposting without watermarks, and no in-app purchases or subscriptions. The user is impressed with the app's ability to display profile pictures in the highest quality possible, and the app uses the profile picture to achieve this.", "prop-actions": "1. Upon downloading the app, the user is presented with a clear and concise privacy policy that outlines how their data will be collected and used. The privacy policy includes the identity of the data controller, the purpose of the processing operations (convenient viewing of stories), and the types of data that will be collected and used (including the use of profile pictures for high-quality display).\n\n2. Before the app collects any data from the user, a pop-up notification appears on the user's screen, explicitly informing them about the data collection and requesting their consent. The notification includes information about the data controller's identity, the purpose of the processing operations (convenient viewing of stories), and the types of data that will be collected and used (including the use of profile pictures for high-quality display). It also informs the user about their right to withdraw consent.\n\n3. The app provides an easily accessible and prominently displayed settings menu where the user can review and modify their consent preferences at any time. Within this menu, there is a section that specifically addresses the use of data for automated processing, explaining how the app utilizes the profile pictures for achieving the highest quality display.\n\n4. In the settings menu, there is also a comprehensive FAQ section that provides detailed information about the possible risks associated with data transfers to countries without adequacy decisions or safeguards. It explains the measures taken by the app to ensure the security of data transfers and how the user's data will be protected.\n\n5. The app includes a feature that allows the user to view stories anonymously. When accessing this feature, a pop-up notification appears, reminding the user about the data collection and processing activities. The notification includes the same information as mentioned before, including the data controller's identity, the purpose of the processing operations, and the types of data collected and used.\n\n6. The app periodically sends push notifications to the user, reminding them of their right to withdraw consent and providing instructions on how to do so. These notifications also include a brief summary of the app's privacy policy and the key information required for consent to be informed.\n\nBy taking these actions, the app ensures that the user is properly informed prior to the collection of their data. It clearly communicates the necessary information, such as the data controller's identity, the purpose of the processing operations, the types of data collected and used, the right to withdraw consent, information about the use of data for automated processing, and the risks of data transfers to countries without adequacy decisions or safeguards.", "prop-code": "I", "prop-state": "T", "rationale": "All the 6 minimum requirements are mentioned the privacy policy. Thus it is informed."}, {"id": "SCR-G024", "base-spec": "The user is a learner preparing for the UK Driving Theory Test. They have downloaded a mobile app that is known for its comprehensive features and user-friendly interface. The app offers unlimited timed mock tests, a personal learner plan, voiceover options, hazard perception practice, and access to practical driving lesson videos. The user appreciates the pass guarantee that the app provides. They regularly sit unlimited timed mock theory tests to assess their knowledge and track their progress. The app uses the user's mock theory test results and the time spent on tests to provide accurate feedback and tailored recommendations for improvement.", "prop-actions": "1. The user opens the app and sees a notification that their personal data will be collected and used. However, the notification does not provide any information about the data controller's identity, the purpose of the data collection, the types of data that will be collected, or the right to withdraw consent.\n\n2. The user clicks on a button within the app to start a timed mock theory test. Before starting the test, a pop-up appears asking for their consent to collect and use their data. However, the pop-up does not provide any information about the purpose of the data collection or the types of data that will be collected and used.\n\n3. The user completes a timed mock theory test and receives feedback on their performance. However, the feedback does not mention anything about the use of the data for automated processing or the risks due to transfers to countries without adequacy decisions or safeguards.\n\n4. The user decides to delete their account and withdraw consent for the app to collect and use their data. However, they cannot find any information within the app on how to delete their account or exercise their right to withdraw consent.\n\n5. The user watches a practical driving lesson video within the app. After the video ends, a message appears stating that their viewing history will be used to provide tailored recommendations. However, the message does not provide any information about the purpose of using the viewing history or the types of data that will be collected and used.\n\n6. The user contacts the app's customer support to inquire about the data controller's identity and the purpose of the data collection. However, the customer support representative is unable to provide any information and redirects the user to the app's privacy policy, which is difficult to find and does not contain the required information.\n\nThese actions demonstrate that the app and user's interactions do not provide the necessary information to ensure that the data subject is properly informed prior to the collection of their data.", "prop-code": "I", "prop-state": "F", "rationale": "At least one of the requirements about the data controller information is not satisfied. All other items also show that the user was not informed about deletion, processing of the data, etc."}, {"id": "SCR-A121", "base-spec": "The user opens the app and navigates to the court search tool. They are prompted to enter a postal code or location to search for locally competent courts. Alternatively, they can use their current location. The app uses this information to display a list of courts in the specified area.", "prop-actions": "1. The user opens the app and navigates to the court search tool.\n2. The user is prompted to enter a postal code or location to search for locally competent courts.\n3. The user provides their postal code or location to the app.\n4. The app uses the provided information to display a list of courts in the specified area.\n\nExtension:\n5. The app does not display any information about the data controller's identity, making it impossible for the user to know who is responsible for the processing of their data.\n6. The app does not provide any information about the purpose of processing the user's data, leaving the user unaware of why their data is being collected and used.\n7. The app does not specify the type of data that will be collected and used, leaving the user uninformed about the nature of the information being processed.\n8. The app does not inform the user about their right to withdraw consent, preventing them from exercising their rights in case they no longer want their data to be processed.\n9. The app does not provide any information about the use of the data for automated processing, leaving the user unaware of any potential automated decision-making processes.\n10. The app does not inform the user about the possible risks of data transfers to countries without adequacy decisions or safeguards, leaving the user uninformed about the potential risks associated with their data being transferred to such countries.\n\nBy not providing the necessary information as stated in the definition, the app fails to ensure that the data subject is properly informed, resulting in \"Informed\" being false.", "prop-code": "I", "prop-state": "F", "rationale": "None of the 6 minimum requirements for informed are satisfied"}, {"id": "SCR-G184", "base-spec": "The user opens the mobile app and discovers its all-in-one platform for communities, events, chats, channels, meetings, storage, tasks, and calendars. They appreciate how the app brings people together and simplifies connecting, collaborating, and managing information. With a focus on security, the user can collaborate with others while still maintaining control over their data. The app utilizes collaboration data and the user's data to facilitate this seamless experience.", "prop-actions": "1. The user creates an account on the app without being provided with any information about the data controller's identity or the purpose of each processing operation. This lack of information prevents the user from being fully informed about how their data will be used and who will be responsible for it.\n\n2. The app collects and uses various types of data from the user, such as personal information, communication data, and task-related data, without informing the user about what specific data will be collected and used. This lack of transparency prevents the user from understanding the scope of data collection and its potential implications.\n\n3. The app does not provide any information about the right to withdraw consent. The user is unaware that they have the option to revoke their consent to the app's data processing activities, limiting their ability to make an informed decision about their data privacy.\n\n4. The app utilizes automated decision-making processes without informing the user about how their data will be used in such processes. This lack of information deprives the user of the opportunity to understand and assess the potential risks associated with automated decision-making.\n\n5. The app transfers user data to countries without adequacy decisions or appropriate safeguards, but fails to inform the user about these data transfers and the potential risks involved. This lack of information deprives the user of the opportunity to make an informed decision about the international transfer of their data.\n\nIn each of these actions, the absence of the required information prevents the user from being fully informed, thereby rendering the statement \"the data subject is not properly informed\" true.", "prop-code": "I", "prop-state": "F", "rationale": "The app doesn't provide information about data controller and all other informed requirements"}, {"id": "SCR-A189", "base-spec": "The user opens the mobile app to do their grocery shopping. They start by browsing through various recipes and find some inspiration for their meals. They then create a shopping list within the app, adding all the ingredients they need for the week. The app takes into consideration their product preferences to personalize the list. As they shop, they can also check for any personal offers or activate coupons to save money. Instead of using a loyalty card, they can simply scan a QR code at the checkout. The app makes it easy for the user to shop efficiently and conveniently.", "prop-actions": "1. The app displays a pop-up notification upon opening, stating the identity of the data controller, which is the company operating the app.\n\n2. The app provides a clear and easily accessible section within its settings or menu, where the user can find detailed information about the purpose of each processing operation. This information explains how the user's data will be used, such as for personalizing the shopping list, providing targeted offers, and improving the app's functionality.\n\n3. The app includes a privacy policy or terms of service document that explicitly states what type(s) of data will be collected and used. This document can be easily accessed within the app, either through a link in the settings or menu, or through a clearly labeled button or tab.\n\n4. The app includes a section in its privacy policy or terms of service document that informs the user about their right to withdraw consent. It explains that the user has the option to delete their account and personal data from the app at any time.\n\n5. The app provides a clear explanation, either within the privacy policy or during the onboarding process, about the use of the user's data for automated processing. It clarifies that this may include using algorithms or artificial intelligence to personalize offers and recommendations based on the user's preferences and shopping habits.\n\n6. The app includes a separate section in its privacy policy or terms of service document that explains the risks associated with data transfers to countries without adequacy decisions or appropriate safeguards. It informs the user that their data may be transferred to servers located in different countries and explains the steps taken by the app to ensure the security and protection of their data during such transfers.\n\nBy taking these actions, the app ensures that the user is properly informed about the relevant aspects of data processing, as stated in the definition of \"Informed\".", "prop-code": "I", "prop-state": "T", "rationale": "All the 6 minimum requirements are mentioned in the notice. Thus it is informed."}, {"id": "SCR-A019", "base-spec": "The user opens the app and navigates to their wishlist. They want to check the availability of the items they have saved. The app quickly retrieves the product availability information using the wishlist feature. The user is able to see which items are currently in stock and which ones are not. This helps them make informed decisions about their purchases.", "prop-actions": "1. The app displays a notification or message upon opening, stating the identity of the data controller, such as the name of the company or organization that operates the app.\n\n2. The app provides a clear and easily accessible description of the purpose of the processing operation, specifically explaining that the wishlist feature retrieves product availability information.\n\n3. The app informs the user about the type(s) of data that will be collected and used for the purpose of checking product availability, such as the user's saved items or product information.\n\n4. The app explicitly mentions the user's right to withdraw consent, informing them that they have the option to stop using the wishlist feature or delete their saved items at any time.\n\n5. The app provides information about the use of the data for automated processing, if applicable. For example, if the app utilizes automated algorithms to determine product availability, it informs the user about this and explains how it impacts their decision-making process.\n\n6. The app informs the user about the potential risks of data transfers to countries without adequacy decisions or safeguards. It explains that the app may transfer data to servers located in different countries and that appropriate measures are in place to protect the user's data during these transfers.\n\nBy implementing these actions, the app ensures that the data subject is properly informed before their data is collected and used for the purpose of checking product availability in the wishlist feature.", "prop-code": "I", "prop-state": "T", "rationale": "All the 6 minimum requirements are mentioned the privacy policy. Thus it is informed."}, {"id": "SCR-G144", "base-spec": "The user opens the mobile app and begins editing their photos. They are able to apply face filters, stylish effects, photo frames, and photo montages to enhance their pictures. They can also change the background of their selfies using creative templates provided by the advanced picture editor. The app utilizes selfies, backgrounds, and picture editor usage to accomplish this task.", "prop-actions": "1. When the user opens the mobile app for the first time, a pop-up message appears, providing essential information about data collection and usage. The pop-up includes the name or identity of the data controller, informing the user who is responsible for their data.\n\n2. Within the pop-up message, the purpose of each processing operation is clearly stated. The user is informed that the app collects and processes data to enhance their photos, apply face filters, stylish effects, photo frames, and photo montages, as well as change backgrounds using creative templates.\n\n3. The pop-up message explicitly mentions the types of data that will be collected and used. The user is informed that the app collects and processes selfies, backgrounds, and usage data related to the photo editor. This ensures transparency regarding the specific data being utilized.\n\n4. The pop-up message informs the user about their right to withdraw consent. It explicitly states that the user has the option to revoke their consent to the data processing at any time, providing them with control over their personal information.\n\n5. If the app utilizes automated decision-making, such as suggesting filters or effects based on the content of the photos, the pop-up message includes information about this. The user is informed about the use of data for automated decision-making, as required by Article 22(2)(c) of the GDPR, ensuring transparency regarding such processes.\n\n6. If the app transfers data to countries without adequacy decisions or appropriate safeguards, the pop-up message notifies the user about the risks associated with such transfers. This ensures that the user is aware of potential concerns related to data transfers and can make an informed decision.\n\nBy incorporating these actions into the app, the data subject is properly informed prior to the collection of their data. Each action supports the requirement for transparency, enabling the user to make informed decisions and exercise their rights.", "prop-code": "I", "prop-state": "T", "rationale": "All the 6 minimum requirements are provided to users through different consents and the privacy policy."}, {"id": "SCR-A188", "base-spec": "The user opens the app and navigates to the 'Purchase History' section. They want to review their past purchases and track their spending. The app retrieves the user's purchase history and displays it on the screen. The user can now easily keep track of their transactions and monitor their expenses. The app uses the user's purchase history to provide this helpful feature.", "prop-actions": "1. The app does not provide any information about the data controller's identity, so the user is not aware of who is responsible for the processing of their data.\n2. The app does not inform the user about the purpose of processing their purchase history data, so they are not aware of why this information is being collected and used.\n3. The app does not specify what type of data will be collected and used from the user's purchase history, leaving the user uninformed about the extent of data collection.\n4. The app does not mention the user's right to withdraw consent, so the user is not aware that they have the option to revoke their consent for the app to use their purchase history data.\n5. The app does not provide any information about the use of the data for automated processing, so the user is not informed about any potential automated decision-making processes that may be applied to their purchase history data.\n6. The app does not inform the user about the possible risks of data transfers to countries without adequacy decisions or safeguards, leaving the user unaware of any potential risks associated with the transfer of their purchase history data.", "prop-code": "I", "prop-state": "F", "rationale": "None of the 6 minimum requirements for informed are satisfied"}, {"id": "SCR-G178", "base-spec": "The user opens the mobile app and accesses the settings. They enable the use of sensors for the watch face, allowing it to gather data. The app utilizes this sensor data to provide personalized features such as heart rate monitoring and customizable theme colors. The user can also customize complications and add preset app shortcuts to their watch face.", "prop-actions": "1. When the user opens the mobile app for the first time, a pop-up message appears, providing information about the app's data collection practices.\n2. The pop-up message clearly states the identity of the data controller, such as the app developer or company.\n3. The message explains the purpose of collecting sensor data, which is to enable personalized features on the watch face.\n4. It specifies the type of data that will be collected, in this case, sensor data from the user's device.\n5. The message informs the user about their right to withdraw consent at any time if they no longer want their sensor data to be collected.\n6. Additionally, the message includes information about the use of the collected data for automated processing, such as heart rate monitoring and theme color customization.\n7. If the app transfers data to countries without adequacy decisions or safeguards, the message highlights the possible risks associated with such transfers.\n8. The user, after reading the pop-up message, acknowledges their understanding and acceptance by tapping on an \"I Agree\" button.\n9. In the app settings, there is a dedicated section that provides a summary of the information presented in the pop-up message for easy reference.\n10. The user can access this section anytime to review the information about data collection, purpose, type of data, right to withdraw consent, use of data for automated processing, and risks of data transfers.\n11. The app periodically reminds the user about their right to withdraw consent and provides clear instructions on how to do so.\n12. If there are any changes to the data collection practices or privacy policy, the app notifies the user and requests their consent again before implementing the changes.", "prop-code": "I", "prop-state": "T", "rationale": "All the 6 minimum requirements are mentioned the privacy policy. Thus it is informed."}, {"id": "SCR-G045", "base-spec": "The user is passionate about farming and wants to experience the joys of farm life. They download a mobile app that allows them to immerse themselves in a virtual farm environment. Using the app, the user tends to animals and crops, taking care of them and ensuring they grow healthy. When it's time to harvest, the user collects their produce, feeling a sense of accomplishment. The app utilizes the information about the user's produce, gardening habits, and location to provide a personalized experience tailored to their virtual farm.", "prop-actions": "1. When the user first opens the app, a pop-up window appears providing the data controller's identity, stating that the app is owned and operated by FarmLife Inc.\n2. As the user starts playing the game, a tutorial is provided that explains the purpose of each processing operation. It informs the user that the app collects and processes data in order to provide a personalized virtual farm experience.\n3. In the app's settings menu, there is a section that outlines the types of data that will be collected and used. The user is informed that the app collects information about their produce, gardening habits, and location to enhance their virtual farm experience.\n4. In the app's privacy policy, it clearly states that the user has the right to withdraw their consent at any time. It explains how the user can revoke their consent and what the implications of doing so may be on their virtual farm experience.\n5. At certain points in the game, notifications appear to inform the user about the use of their data for automated decision-making. For example, the user might receive a notification saying, \"Based on your gardening habits, we recommend planting tomatoes next to your corn for better growth.\" This notification serves as a reminder of the app's use of automated processing.\n6. Within the privacy policy, it is stated that the app may transfer data to countries without adequacy decisions or safeguards. The user is informed about the risks associated with such transfers and is provided with information on the steps taken by the app to ensure the security of their data during these transfers.", "prop-code": "I", "prop-state": "T", "rationale": "All the 6 minimum requirements are provided to users through different consents and the privacy policy."}, {"id": "SCR-A016", "base-spec": "The user opens the mobile app on their iOS device. They want to find a specific TV show to watch. They enter a search query in the app, hoping to quickly find the desired content. The app utilizes the user's preferences and location information to efficiently perform the search function.", "prop-actions": "1. The user launches the mobile app on their iOS device.\n2. The user is presented with a clear and prominent message explaining that their personal data, including preferences and location information, will be used to enhance their search experience.\n3. The message includes a statement that by using the app and entering a search query, the user agrees to the processing of their personal data.\n4. The user actively selects the \"I agree\" button or checks a box indicating their consent.\n5. The app records and stores the user's consent action as an indication of their agreement to the processing of their personal data.\n6. The user enters a search query in the app's search bar, indicating their intention to use the app's search function.\n7. The app utilizes the user's preferences and location information, which were previously agreed upon through the user's consent, to efficiently perform the search function.\n8. The app does not process any personal data beyond what was explicitly consented to by the user for the specific purpose of enhancing the search experience.\n9. The app provides the search results to the user based on their search query and the processed personal data, ensuring that the user's expectations are met.\n\nThrough these actions, the \"Unambiguous\" requirement is met as the user provides clear, affirmative consent by actively selecting the \"I agree\" button or checking a box, and their agreement is indicated and recorded by the app.", "prop-code": "U", "prop-state": "T", "rationale": "The user is provided with clear, concise consent message to accept"}, {"id": "SCR-A119", "base-spec": "The user opens the app and begins browsing recipes. They find a few that they like and add the ingredients to their shopping list. They also activate some coupons for extra savings. Before heading to the store, the user shares their shopping list with their family or friends who will be joining them. At the store, instead of fumbling with a loyalty card, the user simply scans a QR code to access their discounts.", "prop-actions": "The user opens the app and begins browsing recipes. This action does not affect the unambiguous requirement for consent as it is a simple action of opening the app and exploring its content.\n\nThe user adds ingredients to their shopping list. This action does not affect the unambiguous requirement for consent as it is a voluntary action to create a personal shopping list within the app.\n\nThe user activates coupons for extra savings. This action does not affect the unambiguous requirement for consent as it is a voluntary action to take advantage of available discounts provided by the app.\n\nThe user shares their shopping list with family or friends. This action does not affect the unambiguous requirement for consent as it is a deliberate action taken by the user to share their personal shopping list with others.\n\nThe user scans a QR code to access their discounts. This action does not affect the unambiguous requirement for consent as it is a deliberate action taken by the user to access discounts through a loyalty program within the app.\n\nIn summary, all the actions described in the extension of the specification do not violate the unambiguous requirement for consent as they are voluntary, deliberate actions taken by the user within the app.", "prop-code": "U", "prop-state": "F", "rationale": "The app doesn't ask for consent but the user interacts with it as they wish"}, {"id": "SCR-A130", "base-spec": "The user opens the mobile app and explores its features. They see options for an alarm clock, customizable clock themes, a sleep timer with white noise, live weather conditions, a countdown timer, and a built-in flashlight. They are excited to find exclusive designer clocks available for selection. The app uses the user's designer clock preferences, budget, and preferred style to provide them with the perfect options.", "prop-actions": "1. The user opens the mobile app and is presented with a clear notification explaining the app's data collection practices and the purpose for which their data will be used. The notification includes an option for the user to review and accept the app's privacy policy.\n\n2. The user reads the privacy policy and sees that their data will be collected for the purpose of providing personalized clock options based on their preferences. They understand that their data will not be shared with third parties without their explicit consent.\n\n3. After reviewing the privacy policy, the user explicitly taps on the \"I agree\" button to provide their consent for the app to collect and process their data for the specified purpose.\n\n4. The app acknowledges the user's consent by displaying a clear message confirming that their data will be used to provide personalized clock options.\n\n5. The user proceeds to explore the app's features, such as the alarm clock, customizable clock themes, sleep timer, live weather conditions, countdown timer, and built-in flashlight.\n\n6. While using the app, the user has the option to enable or disable certain features that may require additional data processing, such as location-based weather conditions. The user is presented with a clear toggle switch or checkbox to indicate their preference.\n\n7. If the user decides to enable location-based weather conditions, the app prompts them with a separate consent request specifically for accessing their location data. The user must provide explicit consent by tapping on a \"Allow\" button, indicating their agreement to the app accessing their location for the specified purpose.\n\n8. Throughout their usage of the app, the user has the option to review and change their consent preferences at any time through a dedicated settings or privacy section. The app provides a clear and accessible interface for the user to manage their consent choices.\n\nBy following these actions, the user provides clear, affirmative actions that signify their agreement to the processing of their personal data by the app.", "prop-code": "U", "prop-state": "T", "rationale": "The app provides clear, concise and explicit consent to the user that can agree or deny"}, {"id": "SCR-G116", "base-spec": "The user opens the app to report a fault at a charging point. They provide the app with their location, the charging point ID, a description of the fault, and their user ID. The app then processes this information to report the fault and notify the relevant authorities.", "prop-actions": "1. The user opens the app and explicitly taps on the \"Report Fault\" button, indicating their intention to report an issue with the charging point.\n2. The app clearly presents a consent message or notification to the user, informing them that their personal data, including location, charging point ID, description of the fault, and user ID, will be processed for the purpose of reporting the fault and notifying the relevant authorities.\n3. The user reads and understands the consent message presented by the app.\n4. The user consciously and intentionally taps on the \"Agree\" or \"Submit\" button in response to the consent message, providing a clear affirmative action to indicate their agreement to the processing of their personal data for the stated purpose.\n5. The app securely records this affirmative action by the user, ensuring that it can be later verified if necessary.\n6. The app proceeds to process the user's personal data, including their location, charging point ID, description of the fault, and user ID, only for the specific purpose of reporting the fault and notifying the relevant authorities.\n7. The app provides a confirmation message to the user, clearly indicating that their fault report has been successfully submitted.\n8. The user receives a notification or acknowledgment from the app, confirming that their fault report has been received and will be addressed by the relevant authorities.", "prop-code": "U", "prop-state": "T", "rationale": "The consent is concise, clear and the user understands it"}, {"id": "SCR-G052", "base-spec": "The user opens the app and creates an invite-only community for their friends. They use the app's text, voice, and video chat features to communicate with their friends. They enjoy using topic-based channels and voice channels for casual hanging out. The user appreciates the low-latency voice and video chat, as well as the ability to share images, stream videos, and share screens. They also make use of custom emojis and have access to both group and private channels. The app provides customizable moderation tools to ensure a safe and enjoyable chatting experience. The user engages in private conversations with their friends through direct messages. The app uses private messages, text content, media content, and timestamps to facilitate these conversations.", "prop-actions": "1. The user opens the app and creates an invite-only community for their friends. This action indicates that the user agrees to have their personal data processed for the purpose of creating and managing the community.\n\n2. The user uses the app's text, voice, and video chat features to communicate with their friends. By actively engaging in these communication features, the user is giving their consent for their personal data to be processed for the purpose of facilitating these conversations.\n\n3. The user enjoys using topic-based channels and voice channels for casual hanging out. This action implies that the user agrees to have their personal data processed for the purpose of participating in these channels and engaging in casual conversations with others.\n\n4. The user appreciates the low-latency voice and video chat, as well as the ability to share images, stream videos, and share screens. By actively using these features, the user is providing their consent for their personal data to be processed for the purpose of enabling these functionalities.\n\n5. The user makes use of custom emojis and has access to both group and private channels. This action indicates that the user agrees to have their personal data processed for the purpose of customizing their chat experience and participating in both group and private conversations.\n\n6. The app provides customizable moderation tools to ensure a safe and enjoyable chatting experience. The user utilizing these moderation tools implies their consent for their personal data to be processed for the purpose of maintaining a safe environment within the app.\n\n7. The user engages in private conversations with their friends through direct messages. By initiating and participating in these private conversations, the user is giving their consent for their personal data to be processed for the purpose of facilitating these private communications.\n\n8. The app uses private messages, text content, media content, and timestamps to facilitate these conversations. By actively utilizing these features and functionalities, the user is providing their consent for their personal data to be processed for the purpose of enabling these communication functionalities and maintaining the integrity of the conversations.", "prop-code": "U", "prop-state": "F", "rationale": "I think this is borderline since the consent seems to be given implicitly rather than explicitly"}, {"id": "SCR-G098", "base-spec": "The user opens the app on their Android device and starts recording their song ideas, demos, and sound-sketches. They are able to easily access the 4-track recorder and apply audio effects to enhance their recordings. The app allows them to import and export their tracks, making it convenient to work on their music across different platforms. They can also use the loop function to create repetitive sections in their compositions. If they need to make any changes, they can easily edit each track individually. To ensure the quality of their recordings, the app provides live monitoring support. With all these features, the user finds the app to be a helpful tool for capturing their musical ideas and creating their own unique sound.", "prop-actions": "1. The user launches the app on their Android device, indicating their intention to use the app for recording their music ideas.\n\n2. The user actively selects the 4-track recorder feature from the menu, demonstrating their explicit choice to utilize this specific functionality.\n\n3. The user applies audio effects to enhance their recordings, indicating their deliberate action to modify the sound of their tracks.\n\n4. The user imports and exports their tracks, showing their clear intent to share and transfer their music files between different platforms for convenience.\n\n5. The user utilizes the loop function to create repetitive sections in their compositions, demonstrating their intentional use of this feature to enhance their musical arrangements.\n\n6. The user edits each track individually, confirming their deliberate actions to modify and refine their recordings to achieve the desired outcome.\n\n7. The user utilizes the live monitoring support provided by the app, indicating their active engagement in ensuring the quality of their recordings while they are being captured.\n\nBy performing these actions, the user is providing clear, affirmative indications of their consent to the app's processing of their personal data related to their music recordings.", "prop-code": "U", "prop-state": "T", "rationale": "The user provides clear, and affirmative indication of their consent."}, {"id": "SCR-A099", "base-spec": "The user opens the GPS camera app and selects multiple photos from their gallery. They then choose to edit the project name, description, and watermark fields for these photos all at once. The app uses the selected photos, project name, description, and watermark to customize the information displayed on the photo overlays.", "prop-actions": "1. The user opens the GPS camera app. This action is a clear affirmative action by the user to use the app and potentially provide consent for data processing.\n2. The user selects multiple photos from their gallery. By selecting the photos, the user is indicating their agreement to allow the app to process these photos.\n3. The user chooses to edit the project name, description, and watermark fields for these photos all at once. This action demonstrates the user's deliberate action to customize the information displayed on the photo overlays.\n4. The app uses the selected photos, project name, description, and watermark to customize the information displayed on the photo overlays. The app processes the data based on the user's selections, which aligns with the user's consent through their deliberate actions.\n\nOverall, the user's actions of opening the app, selecting photos, and customizing the information indicate their clear affirmative actions to allow the app to process their data. The app, in turn, processes the data based on the user's selections, ensuring that consent is provided through a clear, affirmative action by the user.", "prop-code": "U", "prop-state": "T", "rationale": "The app provides concise, clear and explicit consent to the user in every step"}, {"id": "SCR-G189", "base-spec": "A user of a mobile travel app needs assistance and contacts customer support. The app allows users to plan, book, and compare tickets for various modes of transportation. It serves as a travel guide and provides exclusive offers and discounts. The app ensures secure payments, live trip updates, and customer support in multiple languages. To assist the user, the app uses the user's contact information, order history, account details, and issue description.", "prop-actions": "1. The user opens the app and navigates to the customer support section.\n2. The app displays a clear and concise message stating that in order to provide assistance, the user's contact information, order history, account details, and issue description will be accessed and processed.\n3. The app presents the user with a checkbox or button that they must deliberately select or tap to indicate their agreement to the processing of their personal data for the purpose of customer support.\n4. The user actively selects or taps the checkbox or button to provide their consent.\n5. Upon providing consent, the app displays a confirmation message, clearly indicating that the user's data will be processed for the purpose of customer support.\n6. The user proceeds to enter their contact information, order history, account details, and issue description, knowing that this information will be used to assist them.\n7. The app securely processes and stores the user's personal data, ensuring that it is only accessible to authorized individuals involved in providing customer support.\n8. The app provides the user with the necessary assistance, utilizing the user's personal data as required.\n9. The app does not use the user's personal data for any other purposes beyond the scope of customer support, unless separately and explicitly consented to by the user.\n10. The user has the ability to withdraw their consent at any time, either by contacting customer support or through the app's privacy settings.", "prop-code": "U", "prop-state": "T", "rationale": "The app provides clear, explicit consent and doesn't user the data for other purposes. It also allows the user to withdraw easily"}, {"id": "SCR-A029", "base-spec": "The user opens the app on their mobile device. They need to login to a service using their electronic ID card. The app wirelessly connects to the electronic ID card and retrieves the digital certificates. The user selects the appropriate certificate and the app uses it to authenticate their identity and grant them access to the service.", "prop-actions": "1. The user opens the app on their mobile device.\n2. The app prompts the user to log in to the service using their electronic ID card.\n3. The user inserts their electronic ID card into a card reader connected to their mobile device.\n4. The app wirelessly connects to the electronic ID card and retrieves the digital certificates.\n5. The app displays the available digital certificates on the user's screen.\n6. The user selects the appropriate certificate by tapping on it.\n7. The app verifies the selected certificate against the user's identity information.\n8. The app uses the verified certificate to authenticate the user's identity.\n9. The app grants the user access to the service upon successful authentication.\n10. The user can now use the service, confident that their identity has been verified through an unambiguous action of selecting the appropriate certificate from their electronic ID card.", "prop-code": "U", "prop-state": "T", "rationale": "The app provides concise, clear and explicit consent to the user "}, {"id": "SCR-G102", "base-spec": "The user opens the mobile app and starts tracking their daily activity. They record and map their running routes, keeping track of their progress. They also share their health journey with others. In addition, the user can view detailed health stats, like heart rate and sleep quality. The app synchronizes motion data from Huawei health to healthkit, allowing the user to seamlessly access their health information.", "prop-actions": "1. The app displays a pop-up notification informing the user that their personal data will be processed for the purpose of tracking their daily activity and providing health stats.\n2. The user reads the pop-up notification and clicks on the \"I agree\" button to confirm their consent to the processing of their personal data.\n3. The app provides a detailed explanation of the types of personal data that will be collected and processed, such as running routes, heart rate, and sleep quality.\n4. The user acknowledges the explanation and proceeds to actively start tracking their daily activity by pressing the \"Start Tracking\" button.\n5. The app requests access to the user's motion data from Huawei health and clearly explains why it is necessary for the app's functionality.\n6. The user grants access to their motion data by selecting the option to synchronize it with the app.\n7. The app ensures that the user has the option to review and edit their personal data at any time, giving them full control over their information.\n8. The user chooses to share their health journey with others by selecting the appropriate privacy settings within the app.\n9. The app provides a clear and easy-to-understand privacy policy that outlines how the user's personal data will be processed and protected.\n10. The user reviews the privacy policy and agrees to it by actively continuing to use the app and its features.\n\nThese actions by the app and user support the requirement of \"Unambiguous\" because they involve clear, affirmative actions by the user, such as clicking on the \"I agree\" button, actively starting tracking, granting access to motion data, selecting privacy settings, and actively continuing to use the app after reviewing the privacy policy.", "prop-code": "U", "prop-state": "T", "rationale": "It provides a clear, affirmative consent that the user can agree to."}, {"id": "SCR-G146", "base-spec": "The user is out in the field taking photos for a project. They open the app on their mobile device and use the GPS feature to overlay and stamp the photos with location, direction, altitude, date, and time taken. They also add field notes such as the project name and photo description. The app then organizes and sorts the photos, allowing the user to easily find and review them. When they are satisfied with the photos, they can share and export them. Additionally, the app offers editing features to enhance the photos if needed.", "prop-actions": "1. The user opens the app and enters their login credentials to access their account. The app securely stores the login information and uses it for future logins to provide a seamless user experience.\n\n2. The user grants the app permission to access their device's GPS feature to overlay location data on the photos. The app explains the purpose of accessing the GPS data and assures the user that their location information will only be used for stamping the photos and will not be shared with any third parties.\n\n3. The user adds field notes such as the project name and photo description to provide context and additional information for each photo. The app saves this information along with the photos to help the user organize and search for specific photos based on their project or description.\n\n4. The app automatically organizes and sorts the photos based on various criteria such as date taken, project name, or location. This feature makes it easier for the user to find and review photos later on without manually searching through a large collection.\n\n5. The user is satisfied with the photos and decides to share them with their team members or export them for further use. The app provides options to share the photos directly from within the app or export them to the device's storage.\n\n6. If the user wants to enhance the photos, the app offers editing features such as cropping, adjusting brightness, or applying filters. The user can make these edits before sharing or exporting the photos.\n\nIn each of these actions, the user has full control over their consent and can easily withdraw it if desired. They can uninstall the app from their device, revoke the app's access to their GPS data, or delete their account to withdraw their consent. The app ensures that withdrawing consent is as easy as giving it and can be done at any given time, in accordance with the GDPR's requirements.", "prop-code": "W", "prop-state": "T", "rationale": "It doesn't clearly show withdrawal case but the user can consent/withdraw if they want fairly easily (assumed)"}, {"id": "SCR-G154", "base-spec": "The user opens the mobile app and discovers a vast collection of entertainment options from popular franchises like Disney, Pixar, Marvel, Star Wars, and National Geographic. They are delighted to find a mix of exclusive Originals, new releases, and timeless classics available for streaming. With the app, they can enjoy their favorite content on up to four screens simultaneously, providing flexibility for the whole family. The user appreciates the multiple parental control features, ensuring a safe and suitable viewing experience for children. They are particularly thrilled to experience IMAX Enhanced while watching selected Marvel and Pixar titles, thanks to the app's integration with these specific movies.", "prop-actions": "1. The user decides to create an account on the app by providing their email address and creating a password. During the account creation process, the user is presented with a clear and explicit consent statement, explaining the purpose of data collection and processing. The user gives their consent by checking a box or clicking a button.\n\n2. After creating the account, the user starts exploring the app's content library. They come across a section where the app offers personalized recommendations based on their viewing history and preferences. The user finds this feature helpful and enables it by adjusting their account settings.\n\n3. As the user continues to use the app, they realize they no longer want to receive personalized recommendations. To withdraw their consent, the user navigates to their account settings and easily finds the option to disable personalized recommendations. They can do this without any unnecessary steps or complicated procedures, ensuring that withdrawing consent is as easy as giving it.\n\n4. The user decides to take a break from streaming and temporarily delete their account. They want to ensure that their personal data is not retained by the app during this period. To withdraw consent for data retention, the user goes to their account settings and finds a straightforward option to delete their account. By following the provided instructions, the user can easily remove their account and associated data from the app.\n\n5. The user reconsiders and decides to reactivate their account. They visit the app's website and find a simple process to reactivate their account. The app ensures that reactivation does not automatically reinstate any previously given consent. Instead, the user is presented with a clear consent statement again, giving them the choice to provide consent once more.\n\nThese actions demonstrate that the app allows the data subject to withdraw consent as easily as they gave it. The user can navigate through the app's settings, find specific options related to consent, and modify their preferences without facing unnecessary obstacles or complexities.", "prop-code": "W", "prop-state": "T", "rationale": "The app provides easily accessible setting for the user to withdraw through app settings"}, {"id": "SCR-A037", "base-spec": "The user opens the mobile app and is presented with a range of online services offered by INPS. These services are organized by theme and tailored to different user types. The user can easily save their favorite services for quick access. Along with this, the app provides news and social media channels to stay updated. To ensure security, the user can authenticate themselves using a PIN, SPID, or CIE. In case of any technical issues, the user can also report them through the app. Additionally, the app allows the user to make payments for Redemptions, Mergers, and Annuities. The app utilizes the user's payment information and transaction history to facilitate these transactions.", "prop-actions": "1. The user opens the app and is presented with an initial consent request, clearly stating the purpose and scope of data collection and processing.\n\n2. The user can easily review and understand the terms and conditions associated with giving consent, including the specific data that will be collected and how it will be used.\n\n3. The user is provided with a clear and easily accessible option to give consent, such as a prominent button labeled \"Accept\" or \"Agree\".\n\n4. The user can withdraw consent at any time by accessing the app's settings or preferences. This option is clearly labeled and easily located within the app's navigation.\n\n5. When the user chooses to withdraw consent, the app immediately stops collecting and processing their data for the specified purposes. The user is provided with a confirmation message or notification to indicate that their consent has been successfully withdrawn.\n\n6. The app does not require the user to go through a complex or time-consuming process to withdraw consent. It should be a straightforward action that can be done with minimal effort, such as a single tap or swipe.\n\n7. The app does not impose any undue barriers or conditions on the user when they choose to withdraw consent. There are no additional steps or requirements that make it more difficult for the user to withdraw consent compared to giving it.\n\n8. The app respects the user's decision to withdraw consent and does not attempt to persuade or pressure them to change their mind. The user's choice to withdraw consent is treated as final and their data is no longer collected or processed for the specified purposes.\n\n9. The app provides clear and easily accessible information on how the user can contact the controller or data protection officer if they have any questions or concerns about withdrawing consent.\n\n10. The app regularly reminds the user of their right to withdraw consent and provides them with the option to review and update their consent preferences at any time. This ensures that the user is always aware of their rights and can easily exercise them if they choose to do so.", "prop-code": "W", "prop-state": "T", "rationale": "The app provides user with easy settings to withdraw a consent easily and immediately stops the data collection"}, {"id": "SCR-G182", "base-spec": "The user opens a mobile app that is a powerful browser with AI capabilities. They are looking for a private and personal browsing experience, so they enable the built-in free VPN. The app utilizes the user's browsing history and IP address to ensure their browsing remains private.", "prop-actions": "1. The user navigates to the app settings and finds an option to disable the VPN. They choose to disable it, as they no longer want their browsing to be private.\n\n2. The user accesses their account settings within the app and finds a section specifically for managing consent. They notice that there is a clear and easily accessible option to withdraw their consent for the app to use their browsing history and IP address. They select this option and confirm their decision.\n\n3. The user receives a notification from the app, informing them about a recent update that introduces new data processing features. The notification includes a link to a detailed explanation of the changes and how they impact privacy. The user reads through the information and decides that they do not agree with the changes. They click on the provided link, which takes them directly to the consent management section, where they can easily withdraw their consent for the new data processing features.\n\n4. The user contacts the app's customer support to inquire about the data processing practices and how they can withdraw their consent. The customer support representative provides clear instructions on how to access the consent management section and withdraw consent. The user follows the instructions and successfully withdraws their consent.\n\n5. The app periodically sends reminders to the user, reminding them of their right to withdraw consent at any time. These reminders provide a direct link to the consent management section, making it easy for the user to access and withdraw their consent if desired.\n\n6. The user receives an email from the app, notifying them of an upcoming change in the privacy policy. The email explicitly mentions that the user has the right to withdraw consent for their data processing activities. The email includes a link to the consent management section, where the user can easily withdraw their consent.\n\nIn all of these actions, the user is able to withdraw their consent for the app to use their browsing history and IP address easily and at any given time. The app ensures that the process of withdrawing consent is as simple as giving consent, complying with the requirement stated in the definition.", "prop-code": "W", "prop-state": "T", "rationale": "The app provides easily accessible setting for the user to withdraw through app settings"}, {"id": "SCR-A166", "base-spec": "The user opens the app and selects the option to explore Amsterdam's Red Light District. They are greeted by a virtual tour guide named Sophie, who will assist them throughout their journey. Using GPS, the app guides the user through the 'De Wallen' area, highlighting 31 points of interest along the way. The user can view photos and listen to information provided by 22 virtual experts, who share insights about the district's history, culture, and attractions. The app utilizes GPS location, tour guide preferences, and photos to enhance the user's experience.", "prop-actions": "1. The user starts the virtual tour in the app and enters their personal information, such as name, email address, and phone number. This information is stored securely in the app's database.\n\n2. The user agrees to the app's terms and conditions, including consent for the app to collect and process their personal data for the purpose of providing the virtual tour experience.\n\n3. The user gives consent for the app to access their GPS location in order to provide accurate navigation through the Red Light District.\n\n4. The user selects their preferences for the virtual tour guide, such as language, gender, and level of detail.\n\n5. The app tracks the user's GPS location throughout the tour, ensuring they are guided along the designated route and notified about the points of interest.\n\n6. The app collects photos taken by the user during the tour and stores them securely in the app's database for the user's reference and personal use.\n\n7. The user has the option to listen to audio recordings from virtual experts who provide information about the district's history, culture, and attractions. The app processes the user's selection and plays the corresponding audio recordings.\n\n8. The app analyzes the user's tour guide preferences and provides personalized recommendations for nearby restaurants, cafes, and shops that align with their interests.\n\n9. The app sends push notifications to the user's device, informing them about upcoming events, special offers, or updates related to the Red Light District.\n\n10. The user completes the virtual tour and exits the app.\n\nBased on the given specification and actions described above, it can be inferred that the data subject can easily withdraw consent as easily as they gave it. The actions taken by the user and the app do not imply any difficulty or complexity in withdrawing consent. The user can simply uninstall the app, delete their personal information from the app's database, and revoke any permissions granted to the app (such as GPS access) to withdraw their consent.", "prop-code": "W", "prop-state": "T", "rationale": "The app provides an easy way to withdraw a consent and confirm the withdrawal"}, {"id": "SCR-G129", "base-spec": "The user opens the mobile app and explores its features. They are particularly interested in the digital watch face with a GYRO effect, featuring moving snowflakes in silver and rose gold. They customize the colors to their preference and add app shortcuts and complications. The user then decides to check out other watch faces available in the Google Play Store. They use the app's watch faces and preferences to navigate through the store and find the perfect watch face for their device.", "prop-actions": "1. The user opens the mobile app and explores its features.\n2. The user customizes the colors and adds app shortcuts and complications to the digital watch face.\n3. The user decides to check out other watch faces available in the Google Play Store.\n4. The user uses the app's watch faces and preferences to navigate through the store.\n5. The user finds the perfect watch face for their device.\n\nThese actions do not directly relate to the withdrawal of consent, but rather focus on the user's exploration and customization of the app's features and the search for their desired watch face. Since the actions do not involve giving or withdrawing consent, they do not support the claim that \"the data subject cannot withdraw consent as easily as they gave it\" is false.", "prop-code": "W", "prop-state": "F", "rationale": "Doesn't include any process for withdrawal"}, {"id": "SCR-G177", "base-spec": "The user wants to have a mobile plan with unlimited minutes, SMS, and data in Austria and the EU. They are looking for a flexible option without any contractual commitment, service charge, or activation fee. They also want the ability to pause their subscription for up to 12 months. They find a mobile app that meets their requirements. The app allows them to download their eSIM profile and complete the subscription process directly within the app. The user provides their name, email, and payment information to activate the service.", "prop-actions": "1. The app clearly displays a \"Manage Subscription\" option in the user's account settings, making it easily accessible.\n2. In the \"Manage Subscription\" section, the user finds a \"Withdraw Consent\" button or option that is prominently displayed.\n3. Upon selecting the \"Withdraw Consent\" option, the app immediately presents a confirmation pop-up or dialog box to ensure the user's intention to withdraw consent.\n4. The app does not require the user to go through a complex process or provide additional information to withdraw consent.\n5. After confirming their withdrawal of consent, the app immediately stops any further processing of the user's personal data for marketing or other purposes.\n6. The app sends a notification or email to the user confirming that their consent has been successfully withdrawn.\n7. The app does not retain any personal data of the user after they withdraw consent, unless there is a legal obligation to do so.\n8. In the future, if the user decides to re-consent and provide consent again, the app allows for an easy process where the user can simply go through the initial activation steps without any additional hurdles.\n9. The app provides clear instructions or a help section that guides the user on how to withdraw consent if they are unsure about the process.\n10. The app ensures that withdrawing consent does not result in any negative consequences or loss of service for the user, such as additional charges or termination of their subscription.\n11. The app regularly reminds the user about their right to withdraw consent and provides an option to do so in periodic communications or notifications.\n12. The app periodically reviews and updates its consent withdrawal process to ensure it remains easy and accessible for the user.", "prop-code": "W", "prop-state": "T", "rationale": "The app provides an easy way to withdraw a consent and confirm the withdrawal"}, {"id": "SCR-G093", "base-spec": "The user is an avid runner who wants to share their fitness journey with others on social media. They are using a mobile app that serves as their health and fitness companion. The app allows them to track their activity, record their running routes, and view detailed health stats. To add an exciting twist, the user wants to create dynamic videos using their tracking data to showcase their progress. The app seamlessly combines videos, location data, activity data, and social media profiles to help the user create and share these engaging videos.", "prop-actions": "1. The user connects their social media profiles to the app to enable easy sharing of their fitness journey with others.\n2. The user gives consent for the app to access their location data in order to accurately track their running routes.\n3. The user grants permission for the app to collect and analyze their health stats to provide personalized recommendations and insights.\n4. The user enables the app's feature that automatically generates dynamic videos using their tracking data, location data, and activity data.\n5. The user shares one of the videos created by the app on their social media profiles.\n6. The user decides to stop using the app and deletes it from their mobile device.\n7. The user revokes the app's access to their social media profiles to prevent any further sharing of their fitness journey.\n8. The user requests to delete all their personal data from the app's database.\n9. The user changes their mind and decides to reinstall the app to continue tracking their fitness journey.\n10. The user updates their privacy settings within the app to restrict the collection and use of their personal data.\n11. The user contacts the app's customer support to inquire about the data retention policies and how their personal data is handled.", "prop-code": "W", "prop-state": "T", "rationale": "Via privacy setting the user can give or withdraw consent or delete the app/data altogether"}, {"id": "SCR-A059", "base-spec": "The user opens the app and is intrigued by the Matrix of Destiny 22 Energies method. They read about this diagnostic method and its ability to provide insights on money, health, relationships, and talent based on their date of birth. The app utilizes the user's interest in diagnostic methods and knowledge about the Matrix of Destiny 22 Energies to offer personalized analysis and help the user understand themselves better.", "prop-actions": "1. The user clicks on the \"Get Started\" button to initiate the analysis process.\n2. The app presents a consent form clearly stating the purpose of data collection and processing, as well as the intended use of the user's personal information.\n3. The user carefully reads the consent form and understands the implications of providing their personal data for the analysis.\n4. The app includes a prominent and easily accessible \"Withdraw Consent\" button or option within the consent form, allowing the user to withdraw their consent at any time.\n5. The user proceeds with giving consent by clicking on the \"Agree\" button.\n6. The app starts collecting the necessary data from the user, such as their date of birth and relevant information for the Matrix of Destiny 22 Energies analysis.\n7. At any point during the data collection process, the user can easily access the app's settings or account preferences to locate and utilize the \"Withdraw Consent\" option.\n8. The app immediately stops collecting any further data and removes the user's personal information from its databases when the \"Withdraw Consent\" option is selected.\n9. Upon withdrawing consent, the app displays a confirmation message to inform the user that their personal data has been deleted and will no longer be used for analysis or any other purpose.\n10. The user can easily verify that their personal data has been removed by checking the app's privacy settings or contacting the app's support team.\n11. If the user changes their mind and decides to provide consent again, they can do so by following the initial consent process, ensuring that giving consent is as easy as withdrawing it.", "prop-code": "W", "prop-state": "T", "rationale": "The app provides easy way to withdraw  a consent and receive confirmation"}, {"id": "SCR-A107", "base-spec": "A user downloads a mobile app that offers engaging quiz-based games for learning. They use the app to play quiz games to increase engagement and learn new information. The app offers various study modes and learning content, as well as the ability to create their own quizzes and host quizzes for groups of people. The user can use the app for studying, in educational settings, at work, and with friends and family. The app also tracks the user's progress and provides feedback based on their quiz answers, knowledge interests, and learning progress.", "prop-actions": "1. The user creates a quiz and shares it with a group of people. Once the quiz is shared, the user cannot withdraw consent for others to access and participate in the quiz. This action does not support the statement that \"the data subject cannot withdraw consent as easily as they gave it.\"\n\n2. The user enables push notifications from the app to receive updates about new quizzes and learning content. Although the user can easily enable push notifications with a single click, they cannot withdraw consent for receiving push notifications as easily. This action contradicts the statement that \"the data subject cannot withdraw consent as easily as they gave it.\"\n\n3. The app collects the user's quiz answers, knowledge interests, and learning progress to provide personalized feedback and recommendations. While the user can easily give consent to the app to collect this data, they cannot withdraw consent for the app to stop collecting and using this data as easily. This action goes against the idea that \"the data subject cannot withdraw consent as easily as they gave it.\"\n\n4. The user grants the app permission to access their device's camera and microphone for features like creating video quizzes. However, once the permission is granted, the user cannot easily withdraw consent for the app to access their camera and microphone. This action does not align with the statement that \"the data subject cannot withdraw consent as easily as they gave it.\"\n\n5. The app shares the user's learning progress and quiz results with third-party educational institutions or employers for purposes of assessment or recognition. Once the data is shared, the user cannot easily withdraw consent for the app to continue sharing this data with third parties. This action contradicts the idea that \"the data subject cannot withdraw consent as easily as they gave it.\"\n\nOverall, these actions demonstrate that the app does not fully adhere to the requirement of withdrawal as defined in the GDPR. The user is unable to withdraw consent as easily as they initially gave it in various scenarios, which goes against the specified definition.", "prop-code": "W", "prop-state": "F", "rationale": "The app doesn't allow user to withdraw the consent after it is given"}]